******************************************************************
*  COPYBOOK  : GOAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AK
******************************************************************
 01  PT-OAK-PARTY.

          03 PT-OAK-INSURED-NAME              PIC X(40).
          03 PT-OAK-TAX-ID                    PIC X(11).
          03 PT-OAK-ADDRESS-LINE1             PIC X(30).
          03 PT-OAK-ADDRESS-LINE2             PIC X(30).
          03 PT-OAK-CITY                      PIC X(20).
          03 PT-OAK-STATE-CODE                PIC X(2).
          03 PT-OAK-ZIP-CODE                  PIC X(9).
          03 PT-OAK-PHONE                     PIC X(14).
          03 PT-OAK-AGENCY-CODE               PIC X(6).
          03 PT-OAK-AGENT-NAME                PIC X(30).
