******************************************************************
*  COPYBOOK  : GOAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AK
******************************************************************
 01  EN-OAK-ENDORSEMENT.

          03 EN-OAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OAK-FORM-NUMBER               PIC X(10).
          03 EN-OAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-OAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
