******************************************************************
*  COPYBOOK  : GOALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AL
******************************************************************
 01  EN-OAL-ENDORSEMENT.

          03 EN-OAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OAL-FORM-NUMBER               PIC X(10).
          03 EN-OAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-OAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
