******************************************************************
*  COPYBOOK  : GOARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AR
******************************************************************
 01  PT-OAR-PARTY.

          03 PT-OAR-INSURED-NAME              PIC X(40).
          03 PT-OAR-TAX-ID                    PIC X(11).
          03 PT-OAR-ADDRESS-LINE1             PIC X(30).
          03 PT-OAR-ADDRESS-LINE2             PIC X(30).
          03 PT-OAR-CITY                      PIC X(20).
          03 PT-OAR-STATE-CODE                PIC X(2).
          03 PT-OAR-ZIP-CODE                  PIC X(9).
          03 PT-OAR-PHONE                     PIC X(14).
          03 PT-OAR-AGENCY-CODE               PIC X(6).
          03 PT-OAR-AGENT-NAME                PIC X(30).
