******************************************************************
*  COPYBOOK  : GOARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AR
******************************************************************
 01  EN-OAR-ENDORSEMENT.

          03 EN-OAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OAR-FORM-NUMBER               PIC X(10).
          03 EN-OAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-OAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
