******************************************************************
*  COPYBOOK  : GOAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : AZ
******************************************************************
 01  EN-OAZ-ENDORSEMENT.

          03 EN-OAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OAZ-FORM-NUMBER               PIC X(10).
          03 EN-OAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-OAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
