******************************************************************
*  COPYBOOK  : GOCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CA
******************************************************************
 01  PT-OCA-PARTY.

          03 PT-OCA-INSURED-NAME              PIC X(40).
          03 PT-OCA-TAX-ID                    PIC X(11).
          03 PT-OCA-ADDRESS-LINE1             PIC X(30).
          03 PT-OCA-ADDRESS-LINE2             PIC X(30).
          03 PT-OCA-CITY                      PIC X(20).
          03 PT-OCA-STATE-CODE                PIC X(2).
          03 PT-OCA-ZIP-CODE                  PIC X(9).
          03 PT-OCA-PHONE                     PIC X(14).
          03 PT-OCA-AGENCY-CODE               PIC X(6).
          03 PT-OCA-AGENT-NAME                PIC X(30).
