******************************************************************
*  COPYBOOK  : GOCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CA
******************************************************************
 01  EN-OCA-ENDORSEMENT.

          03 EN-OCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OCA-FORM-NUMBER               PIC X(10).
          03 EN-OCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
