******************************************************************
*  COPYBOOK  : GOCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CO
******************************************************************
 01  PT-OCO-PARTY.

          03 PT-OCO-INSURED-NAME              PIC X(40).
          03 PT-OCO-TAX-ID                    PIC X(11).
          03 PT-OCO-ADDRESS-LINE1             PIC X(30).
          03 PT-OCO-ADDRESS-LINE2             PIC X(30).
          03 PT-OCO-CITY                      PIC X(20).
          03 PT-OCO-STATE-CODE                PIC X(2).
          03 PT-OCO-ZIP-CODE                  PIC X(9).
          03 PT-OCO-PHONE                     PIC X(14).
          03 PT-OCO-AGENCY-CODE               PIC X(6).
          03 PT-OCO-AGENT-NAME                PIC X(30).
