******************************************************************
*  COPYBOOK  : GOCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CO
******************************************************************
 01  EN-OCO-ENDORSEMENT.

          03 EN-OCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OCO-FORM-NUMBER               PIC X(10).
          03 EN-OCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-OCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
