******************************************************************
*  COPYBOOK  : GOCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CT
******************************************************************
 01  EN-OCT-ENDORSEMENT.

          03 EN-OCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OCT-FORM-NUMBER               PIC X(10).
          03 EN-OCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-OCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
