******************************************************************
*  COPYBOOK  : GOCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : CT
******************************************************************
 01  PT-OCT-PARTY.

          03 PT-OCT-INSURED-NAME              PIC X(40).
          03 PT-OCT-TAX-ID                    PIC X(11).
          03 PT-OCT-ADDRESS-LINE1             PIC X(30).
          03 PT-OCT-ADDRESS-LINE2             PIC X(30).
          03 PT-OCT-CITY                      PIC X(20).
          03 PT-OCT-STATE-CODE                PIC X(2).
          03 PT-OCT-ZIP-CODE                  PIC X(9).
          03 PT-OCT-PHONE                     PIC X(14).
          03 PT-OCT-AGENCY-CODE               PIC X(6).
          03 PT-OCT-AGENT-NAME                PIC X(30).
