******************************************************************
*  COPYBOOK  : GODCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : DC
******************************************************************
 01  EN-ODC-ENDORSEMENT.

          03 EN-ODC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ODC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ODC-FORM-NUMBER               PIC X(10).
          03 EN-ODC-EFFECTIVE-DATE            PIC X(10).
          03 EN-ODC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
