******************************************************************
*  COPYBOOK  : GODCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : DC
******************************************************************
 01  PT-ODC-PARTY.

          03 PT-ODC-INSURED-NAME              PIC X(40).
          03 PT-ODC-TAX-ID                    PIC X(11).
          03 PT-ODC-ADDRESS-LINE1             PIC X(30).
          03 PT-ODC-ADDRESS-LINE2             PIC X(30).
          03 PT-ODC-CITY                      PIC X(20).
          03 PT-ODC-STATE-CODE                PIC X(2).
          03 PT-ODC-ZIP-CODE                  PIC X(9).
          03 PT-ODC-PHONE                     PIC X(14).
          03 PT-ODC-AGENCY-CODE               PIC X(6).
          03 PT-ODC-AGENT-NAME                PIC X(30).
