******************************************************************
*  COPYBOOK  : GODEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : DE
******************************************************************
 01  EN-ODE-ENDORSEMENT.

          03 EN-ODE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ODE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ODE-FORM-NUMBER               PIC X(10).
          03 EN-ODE-EFFECTIVE-DATE            PIC X(10).
          03 EN-ODE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
