******************************************************************
*  COPYBOOK  : GODEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : DE
******************************************************************
 01  PT-ODE-PARTY.

          03 PT-ODE-INSURED-NAME              PIC X(40).
          03 PT-ODE-TAX-ID                    PIC X(11).
          03 PT-ODE-ADDRESS-LINE1             PIC X(30).
          03 PT-ODE-ADDRESS-LINE2             PIC X(30).
          03 PT-ODE-CITY                      PIC X(20).
          03 PT-ODE-STATE-CODE                PIC X(2).
          03 PT-ODE-ZIP-CODE                  PIC X(9).
          03 PT-ODE-PHONE                     PIC X(14).
          03 PT-ODE-AGENCY-CODE               PIC X(6).
          03 PT-ODE-AGENT-NAME                PIC X(30).
