******************************************************************
*  COPYBOOK  : GOFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : FL
******************************************************************
 01  EN-OFL-ENDORSEMENT.

          03 EN-OFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OFL-FORM-NUMBER               PIC X(10).
          03 EN-OFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-OFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
