******************************************************************
*  COPYBOOK  : GOFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : FL
******************************************************************
 01  PT-OFL-PARTY.

          03 PT-OFL-INSURED-NAME              PIC X(40).
          03 PT-OFL-TAX-ID                    PIC X(11).
          03 PT-OFL-ADDRESS-LINE1             PIC X(30).
          03 PT-OFL-ADDRESS-LINE2             PIC X(30).
          03 PT-OFL-CITY                      PIC X(20).
          03 PT-OFL-STATE-CODE                PIC X(2).
          03 PT-OFL-ZIP-CODE                  PIC X(9).
          03 PT-OFL-PHONE                     PIC X(14).
          03 PT-OFL-AGENCY-CODE               PIC X(6).
          03 PT-OFL-AGENT-NAME                PIC X(30).
