******************************************************************
*  COPYBOOK  : GOGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : GA
******************************************************************
 01  PT-OGA-PARTY.

          03 PT-OGA-INSURED-NAME              PIC X(40).
          03 PT-OGA-TAX-ID                    PIC X(11).
          03 PT-OGA-ADDRESS-LINE1             PIC X(30).
          03 PT-OGA-ADDRESS-LINE2             PIC X(30).
          03 PT-OGA-CITY                      PIC X(20).
          03 PT-OGA-STATE-CODE                PIC X(2).
          03 PT-OGA-ZIP-CODE                  PIC X(9).
          03 PT-OGA-PHONE                     PIC X(14).
          03 PT-OGA-AGENCY-CODE               PIC X(6).
          03 PT-OGA-AGENT-NAME                PIC X(30).
