******************************************************************
*  COPYBOOK  : GOGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : GA
******************************************************************
 01  EN-OGA-ENDORSEMENT.

          03 EN-OGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OGA-FORM-NUMBER               PIC X(10).
          03 EN-OGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
