******************************************************************
*  COPYBOOK  : GOHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : HI
******************************************************************
 01  PT-OHI-PARTY.

          03 PT-OHI-INSURED-NAME              PIC X(40).
          03 PT-OHI-TAX-ID                    PIC X(11).
          03 PT-OHI-ADDRESS-LINE1             PIC X(30).
          03 PT-OHI-ADDRESS-LINE2             PIC X(30).
          03 PT-OHI-CITY                      PIC X(20).
          03 PT-OHI-STATE-CODE                PIC X(2).
          03 PT-OHI-ZIP-CODE                  PIC X(9).
          03 PT-OHI-PHONE                     PIC X(14).
          03 PT-OHI-AGENCY-CODE               PIC X(6).
          03 PT-OHI-AGENT-NAME                PIC X(30).
