******************************************************************
*  COPYBOOK  : GOHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : HI
******************************************************************
 01  EN-OHI-ENDORSEMENT.

          03 EN-OHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OHI-FORM-NUMBER               PIC X(10).
          03 EN-OHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-OHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
