******************************************************************
*  COPYBOOK  : GOIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IA
******************************************************************
 01  PT-OIA-PARTY.

          03 PT-OIA-INSURED-NAME              PIC X(40).
          03 PT-OIA-TAX-ID                    PIC X(11).
          03 PT-OIA-ADDRESS-LINE1             PIC X(30).
          03 PT-OIA-ADDRESS-LINE2             PIC X(30).
          03 PT-OIA-CITY                      PIC X(20).
          03 PT-OIA-STATE-CODE                PIC X(2).
          03 PT-OIA-ZIP-CODE                  PIC X(9).
          03 PT-OIA-PHONE                     PIC X(14).
          03 PT-OIA-AGENCY-CODE               PIC X(6).
          03 PT-OIA-AGENT-NAME                PIC X(30).
