******************************************************************
*  COPYBOOK  : GOIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IA
******************************************************************
 01  EN-OIA-ENDORSEMENT.

          03 EN-OIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OIA-FORM-NUMBER               PIC X(10).
          03 EN-OIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
