******************************************************************
*  COPYBOOK  : GOIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : ID
******************************************************************
 01  EN-OID-ENDORSEMENT.

          03 EN-OID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OID-FORM-NUMBER               PIC X(10).
          03 EN-OID-EFFECTIVE-DATE            PIC X(10).
          03 EN-OID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
