******************************************************************
*  COPYBOOK  : GOILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IL
******************************************************************
 01  EN-OIL-ENDORSEMENT.

          03 EN-OIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OIL-FORM-NUMBER               PIC X(10).
          03 EN-OIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-OIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
