******************************************************************
*  COPYBOOK  : GOILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IL
******************************************************************
 01  PT-OIL-PARTY.

          03 PT-OIL-INSURED-NAME              PIC X(40).
          03 PT-OIL-TAX-ID                    PIC X(11).
          03 PT-OIL-ADDRESS-LINE1             PIC X(30).
          03 PT-OIL-ADDRESS-LINE2             PIC X(30).
          03 PT-OIL-CITY                      PIC X(20).
          03 PT-OIL-STATE-CODE                PIC X(2).
          03 PT-OIL-ZIP-CODE                  PIC X(9).
          03 PT-OIL-PHONE                     PIC X(14).
          03 PT-OIL-AGENCY-CODE               PIC X(6).
          03 PT-OIL-AGENT-NAME                PIC X(30).
