******************************************************************
*  COPYBOOK  : GOINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IN
******************************************************************
 01  PT-OIN-PARTY.

          03 PT-OIN-INSURED-NAME              PIC X(40).
          03 PT-OIN-TAX-ID                    PIC X(11).
          03 PT-OIN-ADDRESS-LINE1             PIC X(30).
          03 PT-OIN-ADDRESS-LINE2             PIC X(30).
          03 PT-OIN-CITY                      PIC X(20).
          03 PT-OIN-STATE-CODE                PIC X(2).
          03 PT-OIN-ZIP-CODE                  PIC X(9).
          03 PT-OIN-PHONE                     PIC X(14).
          03 PT-OIN-AGENCY-CODE               PIC X(6).
          03 PT-OIN-AGENT-NAME                PIC X(30).
