******************************************************************
*  COPYBOOK  : GOINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : IN
******************************************************************
 01  EN-OIN-ENDORSEMENT.

          03 EN-OIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OIN-FORM-NUMBER               PIC X(10).
          03 EN-OIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-OIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
