******************************************************************
*  COPYBOOK  : GOKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : KS
******************************************************************
 01  EN-OKS-ENDORSEMENT.

          03 EN-OKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OKS-FORM-NUMBER               PIC X(10).
          03 EN-OKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-OKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
