******************************************************************
*  COPYBOOK  : GOKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : KS
******************************************************************
 01  PT-OKS-PARTY.

          03 PT-OKS-INSURED-NAME              PIC X(40).
          03 PT-OKS-TAX-ID                    PIC X(11).
          03 PT-OKS-ADDRESS-LINE1             PIC X(30).
          03 PT-OKS-ADDRESS-LINE2             PIC X(30).
          03 PT-OKS-CITY                      PIC X(20).
          03 PT-OKS-STATE-CODE                PIC X(2).
          03 PT-OKS-ZIP-CODE                  PIC X(9).
          03 PT-OKS-PHONE                     PIC X(14).
          03 PT-OKS-AGENCY-CODE               PIC X(6).
          03 PT-OKS-AGENT-NAME                PIC X(30).
