******************************************************************
*  COPYBOOK  : GOKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : KY
******************************************************************
 01  EN-OKY-ENDORSEMENT.

          03 EN-OKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OKY-FORM-NUMBER               PIC X(10).
          03 EN-OKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-OKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
