******************************************************************
*  COPYBOOK  : GOKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : KY
******************************************************************
 01  PT-OKY-PARTY.

          03 PT-OKY-INSURED-NAME              PIC X(40).
          03 PT-OKY-TAX-ID                    PIC X(11).
          03 PT-OKY-ADDRESS-LINE1             PIC X(30).
          03 PT-OKY-ADDRESS-LINE2             PIC X(30).
          03 PT-OKY-CITY                      PIC X(20).
          03 PT-OKY-STATE-CODE                PIC X(2).
          03 PT-OKY-ZIP-CODE                  PIC X(9).
          03 PT-OKY-PHONE                     PIC X(14).
          03 PT-OKY-AGENCY-CODE               PIC X(6).
          03 PT-OKY-AGENT-NAME                PIC X(30).
