******************************************************************
*  COPYBOOK  : GOLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : LA
******************************************************************
 01  EN-OLA-ENDORSEMENT.

          03 EN-OLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OLA-FORM-NUMBER               PIC X(10).
          03 EN-OLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
