******************************************************************
*  COPYBOOK  : GOMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MA
******************************************************************
 01  PT-OMA-PARTY.

          03 PT-OMA-INSURED-NAME              PIC X(40).
          03 PT-OMA-TAX-ID                    PIC X(11).
          03 PT-OMA-ADDRESS-LINE1             PIC X(30).
          03 PT-OMA-ADDRESS-LINE2             PIC X(30).
          03 PT-OMA-CITY                      PIC X(20).
          03 PT-OMA-STATE-CODE                PIC X(2).
          03 PT-OMA-ZIP-CODE                  PIC X(9).
          03 PT-OMA-PHONE                     PIC X(14).
          03 PT-OMA-AGENCY-CODE               PIC X(6).
          03 PT-OMA-AGENT-NAME                PIC X(30).
