******************************************************************
*  COPYBOOK  : GOMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MA
******************************************************************
 01  EN-OMA-ENDORSEMENT.

          03 EN-OMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMA-FORM-NUMBER               PIC X(10).
          03 EN-OMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
