******************************************************************
*  COPYBOOK  : GOMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MD
******************************************************************
 01  EN-OMD-ENDORSEMENT.

          03 EN-OMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMD-FORM-NUMBER               PIC X(10).
          03 EN-OMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
