******************************************************************
*  COPYBOOK  : GOMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : ME
******************************************************************
 01  EN-OME-ENDORSEMENT.

          03 EN-OME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OME-FORM-NUMBER               PIC X(10).
          03 EN-OME-EFFECTIVE-DATE            PIC X(10).
          03 EN-OME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
