******************************************************************
*  COPYBOOK  : GOMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : ME
******************************************************************
 01  PT-OME-PARTY.

          03 PT-OME-INSURED-NAME              PIC X(40).
          03 PT-OME-TAX-ID                    PIC X(11).
          03 PT-OME-ADDRESS-LINE1             PIC X(30).
          03 PT-OME-ADDRESS-LINE2             PIC X(30).
          03 PT-OME-CITY                      PIC X(20).
          03 PT-OME-STATE-CODE                PIC X(2).
          03 PT-OME-ZIP-CODE                  PIC X(9).
          03 PT-OME-PHONE                     PIC X(14).
          03 PT-OME-AGENCY-CODE               PIC X(6).
          03 PT-OME-AGENT-NAME                PIC X(30).
