******************************************************************
*  COPYBOOK  : GOMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MI
******************************************************************
 01  PT-OMI-PARTY.

          03 PT-OMI-INSURED-NAME              PIC X(40).
          03 PT-OMI-TAX-ID                    PIC X(11).
          03 PT-OMI-ADDRESS-LINE1             PIC X(30).
          03 PT-OMI-ADDRESS-LINE2             PIC X(30).
          03 PT-OMI-CITY                      PIC X(20).
          03 PT-OMI-STATE-CODE                PIC X(2).
          03 PT-OMI-ZIP-CODE                  PIC X(9).
          03 PT-OMI-PHONE                     PIC X(14).
          03 PT-OMI-AGENCY-CODE               PIC X(6).
          03 PT-OMI-AGENT-NAME                PIC X(30).
