******************************************************************
*  COPYBOOK  : GOMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MI
******************************************************************
 01  EN-OMI-ENDORSEMENT.

          03 EN-OMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMI-FORM-NUMBER               PIC X(10).
          03 EN-OMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
