******************************************************************
*  COPYBOOK  : GOMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MN
******************************************************************
 01  PT-OMN-PARTY.

          03 PT-OMN-INSURED-NAME              PIC X(40).
          03 PT-OMN-TAX-ID                    PIC X(11).
          03 PT-OMN-ADDRESS-LINE1             PIC X(30).
          03 PT-OMN-ADDRESS-LINE2             PIC X(30).
          03 PT-OMN-CITY                      PIC X(20).
          03 PT-OMN-STATE-CODE                PIC X(2).
          03 PT-OMN-ZIP-CODE                  PIC X(9).
          03 PT-OMN-PHONE                     PIC X(14).
          03 PT-OMN-AGENCY-CODE               PIC X(6).
          03 PT-OMN-AGENT-NAME                PIC X(30).
