******************************************************************
*  COPYBOOK  : GOMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MN
******************************************************************
 01  EN-OMN-ENDORSEMENT.

          03 EN-OMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMN-FORM-NUMBER               PIC X(10).
          03 EN-OMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
