******************************************************************
*  COPYBOOK  : GOMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MO
******************************************************************
 01  EN-OMO-ENDORSEMENT.

          03 EN-OMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMO-FORM-NUMBER               PIC X(10).
          03 EN-OMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
