******************************************************************
*  COPYBOOK  : GOMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MO
******************************************************************
 01  PT-OMO-PARTY.

          03 PT-OMO-INSURED-NAME              PIC X(40).
          03 PT-OMO-TAX-ID                    PIC X(11).
          03 PT-OMO-ADDRESS-LINE1             PIC X(30).
          03 PT-OMO-ADDRESS-LINE2             PIC X(30).
          03 PT-OMO-CITY                      PIC X(20).
          03 PT-OMO-STATE-CODE                PIC X(2).
          03 PT-OMO-ZIP-CODE                  PIC X(9).
          03 PT-OMO-PHONE                     PIC X(14).
          03 PT-OMO-AGENCY-CODE               PIC X(6).
          03 PT-OMO-AGENT-NAME                PIC X(30).
