******************************************************************
*  COPYBOOK  : GOMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MS
******************************************************************
 01  EN-OMS-ENDORSEMENT.

          03 EN-OMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMS-FORM-NUMBER               PIC X(10).
          03 EN-OMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
