******************************************************************
*  COPYBOOK  : GOMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MS
******************************************************************
 01  PT-OMS-PARTY.

          03 PT-OMS-INSURED-NAME              PIC X(40).
          03 PT-OMS-TAX-ID                    PIC X(11).
          03 PT-OMS-ADDRESS-LINE1             PIC X(30).
          03 PT-OMS-ADDRESS-LINE2             PIC X(30).
          03 PT-OMS-CITY                      PIC X(20).
          03 PT-OMS-STATE-CODE                PIC X(2).
          03 PT-OMS-ZIP-CODE                  PIC X(9).
          03 PT-OMS-PHONE                     PIC X(14).
          03 PT-OMS-AGENCY-CODE               PIC X(6).
          03 PT-OMS-AGENT-NAME                PIC X(30).
