******************************************************************
*  COPYBOOK  : GOMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MT
******************************************************************
 01  PT-OMT-PARTY.

          03 PT-OMT-INSURED-NAME              PIC X(40).
          03 PT-OMT-TAX-ID                    PIC X(11).
          03 PT-OMT-ADDRESS-LINE1             PIC X(30).
          03 PT-OMT-ADDRESS-LINE2             PIC X(30).
          03 PT-OMT-CITY                      PIC X(20).
          03 PT-OMT-STATE-CODE                PIC X(2).
          03 PT-OMT-ZIP-CODE                  PIC X(9).
          03 PT-OMT-PHONE                     PIC X(14).
          03 PT-OMT-AGENCY-CODE               PIC X(6).
          03 PT-OMT-AGENT-NAME                PIC X(30).
