******************************************************************
*  COPYBOOK  : GOMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : MT
******************************************************************
 01  EN-OMT-ENDORSEMENT.

          03 EN-OMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OMT-FORM-NUMBER               PIC X(10).
          03 EN-OMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-OMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
