******************************************************************
*  COPYBOOK  : GONCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NC
******************************************************************
 01  EN-ONC-ENDORSEMENT.

          03 EN-ONC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONC-FORM-NUMBER               PIC X(10).
          03 EN-ONC-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
