******************************************************************
*  COPYBOOK  : GONDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : ND
******************************************************************
 01  EN-OND-ENDORSEMENT.

          03 EN-OND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OND-FORM-NUMBER               PIC X(10).
          03 EN-OND-EFFECTIVE-DATE            PIC X(10).
          03 EN-OND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
