******************************************************************
*  COPYBOOK  : GONDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : ND
******************************************************************
 01  PT-OND-PARTY.

          03 PT-OND-INSURED-NAME              PIC X(40).
          03 PT-OND-TAX-ID                    PIC X(11).
          03 PT-OND-ADDRESS-LINE1             PIC X(30).
          03 PT-OND-ADDRESS-LINE2             PIC X(30).
          03 PT-OND-CITY                      PIC X(20).
          03 PT-OND-STATE-CODE                PIC X(2).
          03 PT-OND-ZIP-CODE                  PIC X(9).
          03 PT-OND-PHONE                     PIC X(14).
          03 PT-OND-AGENCY-CODE               PIC X(6).
          03 PT-OND-AGENT-NAME                PIC X(30).
