******************************************************************
*  COPYBOOK  : GONEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NE
******************************************************************
 01  EN-ONE-ENDORSEMENT.

          03 EN-ONE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONE-FORM-NUMBER               PIC X(10).
          03 EN-ONE-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
