******************************************************************
*  COPYBOOK  : GONHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NH
******************************************************************
 01  PT-ONH-PARTY.

          03 PT-ONH-INSURED-NAME              PIC X(40).
          03 PT-ONH-TAX-ID                    PIC X(11).
          03 PT-ONH-ADDRESS-LINE1             PIC X(30).
          03 PT-ONH-ADDRESS-LINE2             PIC X(30).
          03 PT-ONH-CITY                      PIC X(20).
          03 PT-ONH-STATE-CODE                PIC X(2).
          03 PT-ONH-ZIP-CODE                  PIC X(9).
          03 PT-ONH-PHONE                     PIC X(14).
          03 PT-ONH-AGENCY-CODE               PIC X(6).
          03 PT-ONH-AGENT-NAME                PIC X(30).
