******************************************************************
*  COPYBOOK  : GONHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NH
******************************************************************
 01  EN-ONH-ENDORSEMENT.

          03 EN-ONH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONH-FORM-NUMBER               PIC X(10).
          03 EN-ONH-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
