******************************************************************
*  COPYBOOK  : GONJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NJ
******************************************************************
 01  PT-ONJ-PARTY.

          03 PT-ONJ-INSURED-NAME              PIC X(40).
          03 PT-ONJ-TAX-ID                    PIC X(11).
          03 PT-ONJ-ADDRESS-LINE1             PIC X(30).
          03 PT-ONJ-ADDRESS-LINE2             PIC X(30).
          03 PT-ONJ-CITY                      PIC X(20).
          03 PT-ONJ-STATE-CODE                PIC X(2).
          03 PT-ONJ-ZIP-CODE                  PIC X(9).
          03 PT-ONJ-PHONE                     PIC X(14).
          03 PT-ONJ-AGENCY-CODE               PIC X(6).
          03 PT-ONJ-AGENT-NAME                PIC X(30).
