******************************************************************
*  COPYBOOK  : GONJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NJ
******************************************************************
 01  EN-ONJ-ENDORSEMENT.

          03 EN-ONJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONJ-FORM-NUMBER               PIC X(10).
          03 EN-ONJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
