******************************************************************
*  COPYBOOK  : GONME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NM
******************************************************************
 01  EN-ONM-ENDORSEMENT.

          03 EN-ONM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONM-FORM-NUMBER               PIC X(10).
          03 EN-ONM-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
