******************************************************************
*  COPYBOOK  : GONMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NM
******************************************************************
 01  PT-ONM-PARTY.

          03 PT-ONM-INSURED-NAME              PIC X(40).
          03 PT-ONM-TAX-ID                    PIC X(11).
          03 PT-ONM-ADDRESS-LINE1             PIC X(30).
          03 PT-ONM-ADDRESS-LINE2             PIC X(30).
          03 PT-ONM-CITY                      PIC X(20).
          03 PT-ONM-STATE-CODE                PIC X(2).
          03 PT-ONM-ZIP-CODE                  PIC X(9).
          03 PT-ONM-PHONE                     PIC X(14).
          03 PT-ONM-AGENCY-CODE               PIC X(6).
          03 PT-ONM-AGENT-NAME                PIC X(30).
