******************************************************************
*  COPYBOOK  : GONVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NV
******************************************************************
 01  PT-ONV-PARTY.

          03 PT-ONV-INSURED-NAME              PIC X(40).
          03 PT-ONV-TAX-ID                    PIC X(11).
          03 PT-ONV-ADDRESS-LINE1             PIC X(30).
          03 PT-ONV-ADDRESS-LINE2             PIC X(30).
          03 PT-ONV-CITY                      PIC X(20).
          03 PT-ONV-STATE-CODE                PIC X(2).
          03 PT-ONV-ZIP-CODE                  PIC X(9).
          03 PT-ONV-PHONE                     PIC X(14).
          03 PT-ONV-AGENCY-CODE               PIC X(6).
          03 PT-ONV-AGENT-NAME                PIC X(30).
