******************************************************************
*  COPYBOOK  : GONVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NV
******************************************************************
 01  EN-ONV-ENDORSEMENT.

          03 EN-ONV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONV-FORM-NUMBER               PIC X(10).
          03 EN-ONV-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
