******************************************************************
*  COPYBOOK  : GONYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NY
******************************************************************
 01  PT-ONY-PARTY.

          03 PT-ONY-INSURED-NAME              PIC X(40).
          03 PT-ONY-TAX-ID                    PIC X(11).
          03 PT-ONY-ADDRESS-LINE1             PIC X(30).
          03 PT-ONY-ADDRESS-LINE2             PIC X(30).
          03 PT-ONY-CITY                      PIC X(20).
          03 PT-ONY-STATE-CODE                PIC X(2).
          03 PT-ONY-ZIP-CODE                  PIC X(9).
          03 PT-ONY-PHONE                     PIC X(14).
          03 PT-ONY-AGENCY-CODE               PIC X(6).
          03 PT-ONY-AGENT-NAME                PIC X(30).
