******************************************************************
*  COPYBOOK  : GONYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : NY
******************************************************************
 01  EN-ONY-ENDORSEMENT.

          03 EN-ONY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ONY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ONY-FORM-NUMBER               PIC X(10).
          03 EN-ONY-EFFECTIVE-DATE            PIC X(10).
          03 EN-ONY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
