******************************************************************
*  COPYBOOK  : GOOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OH
******************************************************************
 01  PT-OOH-PARTY.

          03 PT-OOH-INSURED-NAME              PIC X(40).
          03 PT-OOH-TAX-ID                    PIC X(11).
          03 PT-OOH-ADDRESS-LINE1             PIC X(30).
          03 PT-OOH-ADDRESS-LINE2             PIC X(30).
          03 PT-OOH-CITY                      PIC X(20).
          03 PT-OOH-STATE-CODE                PIC X(2).
          03 PT-OOH-ZIP-CODE                  PIC X(9).
          03 PT-OOH-PHONE                     PIC X(14).
          03 PT-OOH-AGENCY-CODE               PIC X(6).
          03 PT-OOH-AGENT-NAME                PIC X(30).
