******************************************************************
*  COPYBOOK  : GOOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OH
******************************************************************
 01  EN-OOH-ENDORSEMENT.

          03 EN-OOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OOH-FORM-NUMBER               PIC X(10).
          03 EN-OOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-OOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
