******************************************************************
*  COPYBOOK  : GOOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OK
******************************************************************
 01  EN-OOK-ENDORSEMENT.

          03 EN-OOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OOK-FORM-NUMBER               PIC X(10).
          03 EN-OOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-OOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
