******************************************************************
*  COPYBOOK  : GOOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OK
******************************************************************
 01  PT-OOK-PARTY.

          03 PT-OOK-INSURED-NAME              PIC X(40).
          03 PT-OOK-TAX-ID                    PIC X(11).
          03 PT-OOK-ADDRESS-LINE1             PIC X(30).
          03 PT-OOK-ADDRESS-LINE2             PIC X(30).
          03 PT-OOK-CITY                      PIC X(20).
          03 PT-OOK-STATE-CODE                PIC X(2).
          03 PT-OOK-ZIP-CODE                  PIC X(9).
          03 PT-OOK-PHONE                     PIC X(14).
          03 PT-OOK-AGENCY-CODE               PIC X(6).
          03 PT-OOK-AGENT-NAME                PIC X(30).
