******************************************************************
*  COPYBOOK  : GOORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OR
******************************************************************
 01  PT-OOR-PARTY.

          03 PT-OOR-INSURED-NAME              PIC X(40).
          03 PT-OOR-TAX-ID                    PIC X(11).
          03 PT-OOR-ADDRESS-LINE1             PIC X(30).
          03 PT-OOR-ADDRESS-LINE2             PIC X(30).
          03 PT-OOR-CITY                      PIC X(20).
          03 PT-OOR-STATE-CODE                PIC X(2).
          03 PT-OOR-ZIP-CODE                  PIC X(9).
          03 PT-OOR-PHONE                     PIC X(14).
          03 PT-OOR-AGENCY-CODE               PIC X(6).
          03 PT-OOR-AGENT-NAME                PIC X(30).
