******************************************************************
*  COPYBOOK  : GOORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : OR
******************************************************************
 01  EN-OOR-ENDORSEMENT.

          03 EN-OOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OOR-FORM-NUMBER               PIC X(10).
          03 EN-OOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-OOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
