******************************************************************
*  COPYBOOK  : GOPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : PA
******************************************************************
 01  EN-OPA-ENDORSEMENT.

          03 EN-OPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OPA-FORM-NUMBER               PIC X(10).
          03 EN-OPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
