******************************************************************
*  COPYBOOK  : GOPAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : PA
******************************************************************
 01  PT-OPA-PARTY.

          03 PT-OPA-INSURED-NAME              PIC X(40).
          03 PT-OPA-TAX-ID                    PIC X(11).
          03 PT-OPA-ADDRESS-LINE1             PIC X(30).
          03 PT-OPA-ADDRESS-LINE2             PIC X(30).
          03 PT-OPA-CITY                      PIC X(20).
          03 PT-OPA-STATE-CODE                PIC X(2).
          03 PT-OPA-ZIP-CODE                  PIC X(9).
          03 PT-OPA-PHONE                     PIC X(14).
          03 PT-OPA-AGENCY-CODE               PIC X(6).
          03 PT-OPA-AGENT-NAME                PIC X(30).
