******************************************************************
*  COPYBOOK  : GORIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : RI
******************************************************************
 01  EN-ORI-ENDORSEMENT.

          03 EN-ORI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ORI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ORI-FORM-NUMBER               PIC X(10).
          03 EN-ORI-EFFECTIVE-DATE            PIC X(10).
          03 EN-ORI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
