******************************************************************
*  COPYBOOK  : GORIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : RI
******************************************************************
 01  PT-ORI-PARTY.

          03 PT-ORI-INSURED-NAME              PIC X(40).
          03 PT-ORI-TAX-ID                    PIC X(11).
          03 PT-ORI-ADDRESS-LINE1             PIC X(30).
          03 PT-ORI-ADDRESS-LINE2             PIC X(30).
          03 PT-ORI-CITY                      PIC X(20).
          03 PT-ORI-STATE-CODE                PIC X(2).
          03 PT-ORI-ZIP-CODE                  PIC X(9).
          03 PT-ORI-PHONE                     PIC X(14).
          03 PT-ORI-AGENCY-CODE               PIC X(6).
          03 PT-ORI-AGENT-NAME                PIC X(30).
