******************************************************************
*  COPYBOOK  : GOSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : SC
******************************************************************
 01  EN-OSC-ENDORSEMENT.

          03 EN-OSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OSC-FORM-NUMBER               PIC X(10).
          03 EN-OSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-OSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
