******************************************************************
*  COPYBOOK  : GOSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : SD
******************************************************************
 01  EN-OSD-ENDORSEMENT.

          03 EN-OSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OSD-FORM-NUMBER               PIC X(10).
          03 EN-OSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-OSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
