******************************************************************
*  COPYBOOK  : GOTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : TN
******************************************************************
 01  PT-OTN-PARTY.

          03 PT-OTN-INSURED-NAME              PIC X(40).
          03 PT-OTN-TAX-ID                    PIC X(11).
          03 PT-OTN-ADDRESS-LINE1             PIC X(30).
          03 PT-OTN-ADDRESS-LINE2             PIC X(30).
          03 PT-OTN-CITY                      PIC X(20).
          03 PT-OTN-STATE-CODE                PIC X(2).
          03 PT-OTN-ZIP-CODE                  PIC X(9).
          03 PT-OTN-PHONE                     PIC X(14).
          03 PT-OTN-AGENCY-CODE               PIC X(6).
          03 PT-OTN-AGENT-NAME                PIC X(30).
