******************************************************************
*  COPYBOOK  : GOTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : TN
******************************************************************
 01  EN-OTN-ENDORSEMENT.

          03 EN-OTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OTN-FORM-NUMBER               PIC X(10).
          03 EN-OTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-OTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
