******************************************************************
*  COPYBOOK  : GOTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : TX
******************************************************************
 01  EN-OTX-ENDORSEMENT.

          03 EN-OTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OTX-FORM-NUMBER               PIC X(10).
          03 EN-OTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-OTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
