******************************************************************
*  COPYBOOK  : GOTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : TX
******************************************************************
 01  PT-OTX-PARTY.

          03 PT-OTX-INSURED-NAME              PIC X(40).
          03 PT-OTX-TAX-ID                    PIC X(11).
          03 PT-OTX-ADDRESS-LINE1             PIC X(30).
          03 PT-OTX-ADDRESS-LINE2             PIC X(30).
          03 PT-OTX-CITY                      PIC X(20).
          03 PT-OTX-STATE-CODE                PIC X(2).
          03 PT-OTX-ZIP-CODE                  PIC X(9).
          03 PT-OTX-PHONE                     PIC X(14).
          03 PT-OTX-AGENCY-CODE               PIC X(6).
          03 PT-OTX-AGENT-NAME                PIC X(30).
