******************************************************************
*  COPYBOOK  : GOUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : UT
******************************************************************
 01  EN-OUT-ENDORSEMENT.

          03 EN-OUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OUT-FORM-NUMBER               PIC X(10).
          03 EN-OUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-OUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
