******************************************************************
*  COPYBOOK  : GOVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : VA
******************************************************************
 01  EN-OVA-ENDORSEMENT.

          03 EN-OVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OVA-FORM-NUMBER               PIC X(10).
          03 EN-OVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
