******************************************************************
*  COPYBOOK  : GOVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : VT
******************************************************************
 01  EN-OVT-ENDORSEMENT.

          03 EN-OVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OVT-FORM-NUMBER               PIC X(10).
          03 EN-OVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-OVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
