******************************************************************
*  COPYBOOK  : GOWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WA
******************************************************************
 01  EN-OWA-ENDORSEMENT.

          03 EN-OWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OWA-FORM-NUMBER               PIC X(10).
          03 EN-OWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-OWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
