******************************************************************
*  COPYBOOK  : GOWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WI
******************************************************************
 01  EN-OWI-ENDORSEMENT.

          03 EN-OWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OWI-FORM-NUMBER               PIC X(10).
          03 EN-OWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-OWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
