******************************************************************
*  COPYBOOK  : GOWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WI
******************************************************************
 01  PT-OWI-PARTY.

          03 PT-OWI-INSURED-NAME              PIC X(40).
          03 PT-OWI-TAX-ID                    PIC X(11).
          03 PT-OWI-ADDRESS-LINE1             PIC X(30).
          03 PT-OWI-ADDRESS-LINE2             PIC X(30).
          03 PT-OWI-CITY                      PIC X(20).
          03 PT-OWI-STATE-CODE                PIC X(2).
          03 PT-OWI-ZIP-CODE                  PIC X(9).
          03 PT-OWI-PHONE                     PIC X(14).
          03 PT-OWI-AGENCY-CODE               PIC X(6).
          03 PT-OWI-AGENT-NAME                PIC X(30).
