******************************************************************
*  COPYBOOK  : GOWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WV
******************************************************************
 01  EN-OWV-ENDORSEMENT.

          03 EN-OWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OWV-FORM-NUMBER               PIC X(10).
          03 EN-OWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-OWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
