******************************************************************
*  COPYBOOK  : GOWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WV
******************************************************************
 01  PT-OWV-PARTY.

          03 PT-OWV-INSURED-NAME              PIC X(40).
          03 PT-OWV-TAX-ID                    PIC X(11).
          03 PT-OWV-ADDRESS-LINE1             PIC X(30).
          03 PT-OWV-ADDRESS-LINE2             PIC X(30).
          03 PT-OWV-CITY                      PIC X(20).
          03 PT-OWV-STATE-CODE                PIC X(2).
          03 PT-OWV-ZIP-CODE                  PIC X(9).
          03 PT-OWV-PHONE                     PIC X(14).
          03 PT-OWV-AGENCY-CODE               PIC X(6).
          03 PT-OWV-AGENT-NAME                PIC X(30).
