******************************************************************
*  COPYBOOK  : GOWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WY
******************************************************************
 01  PT-OWY-PARTY.

          03 PT-OWY-INSURED-NAME              PIC X(40).
          03 PT-OWY-TAX-ID                    PIC X(11).
          03 PT-OWY-ADDRESS-LINE1             PIC X(30).
          03 PT-OWY-ADDRESS-LINE2             PIC X(30).
          03 PT-OWY-CITY                      PIC X(20).
          03 PT-OWY-STATE-CODE                PIC X(2).
          03 PT-OWY-ZIP-CODE                  PIC X(9).
          03 PT-OWY-PHONE                     PIC X(14).
          03 PT-OWY-AGENCY-CODE               PIC X(6).
          03 PT-OWY-AGENT-NAME                PIC X(30).
