******************************************************************
*  COPYBOOK  : GOWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Owners and Contractors Protective Liability (OC)
*  STATE     : WY
******************************************************************
 01  EN-OWY-ENDORSEMENT.

          03 EN-OWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-OWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-OWY-FORM-NUMBER               PIC X(10).
          03 EN-OWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-OWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
