******************************************************************
*  COPYBOOK  : GHAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AK
******************************************************************
 01  PT-HAK-PARTY.

          03 PT-HAK-INSURED-NAME              PIC X(40).
          03 PT-HAK-TAX-ID                    PIC X(11).
          03 PT-HAK-ADDRESS-LINE1             PIC X(30).
          03 PT-HAK-ADDRESS-LINE2             PIC X(30).
          03 PT-HAK-CITY                      PIC X(20).
          03 PT-HAK-STATE-CODE                PIC X(2).
          03 PT-HAK-ZIP-CODE                  PIC X(9).
          03 PT-HAK-PHONE                     PIC X(14).
          03 PT-HAK-AGENCY-CODE               PIC X(6).
          03 PT-HAK-AGENT-NAME                PIC X(30).
