******************************************************************
*  COPYBOOK  : GHAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AK
******************************************************************
 01  EN-HAK-ENDORSEMENT.

          03 EN-HAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HAK-FORM-NUMBER               PIC X(10).
          03 EN-HAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-HAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
