******************************************************************
*  COPYBOOK  : GHALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AL
******************************************************************
 01  EN-HAL-ENDORSEMENT.

          03 EN-HAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HAL-FORM-NUMBER               PIC X(10).
          03 EN-HAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-HAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
