******************************************************************
*  COPYBOOK  : GHALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AL
******************************************************************
 01  PT-HAL-PARTY.

          03 PT-HAL-INSURED-NAME              PIC X(40).
          03 PT-HAL-TAX-ID                    PIC X(11).
          03 PT-HAL-ADDRESS-LINE1             PIC X(30).
          03 PT-HAL-ADDRESS-LINE2             PIC X(30).
          03 PT-HAL-CITY                      PIC X(20).
          03 PT-HAL-STATE-CODE                PIC X(2).
          03 PT-HAL-ZIP-CODE                  PIC X(9).
          03 PT-HAL-PHONE                     PIC X(14).
          03 PT-HAL-AGENCY-CODE               PIC X(6).
          03 PT-HAL-AGENT-NAME                PIC X(30).
