******************************************************************
*  COPYBOOK  : GHARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AR
******************************************************************
 01  EN-HAR-ENDORSEMENT.

          03 EN-HAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HAR-FORM-NUMBER               PIC X(10).
          03 EN-HAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-HAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
