******************************************************************
*  COPYBOOK  : GHAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AZ
******************************************************************
 01  EN-HAZ-ENDORSEMENT.

          03 EN-HAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HAZ-FORM-NUMBER               PIC X(10).
          03 EN-HAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-HAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
