******************************************************************
*  COPYBOOK  : GHAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : AZ
******************************************************************
 01  PT-HAZ-PARTY.

          03 PT-HAZ-INSURED-NAME              PIC X(40).
          03 PT-HAZ-TAX-ID                    PIC X(11).
          03 PT-HAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-HAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-HAZ-CITY                      PIC X(20).
          03 PT-HAZ-STATE-CODE                PIC X(2).
          03 PT-HAZ-ZIP-CODE                  PIC X(9).
          03 PT-HAZ-PHONE                     PIC X(14).
          03 PT-HAZ-AGENCY-CODE               PIC X(6).
          03 PT-HAZ-AGENT-NAME                PIC X(30).
