******************************************************************
*  COPYBOOK  : GHCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CA
******************************************************************
 01  PT-HCA-PARTY.

          03 PT-HCA-INSURED-NAME              PIC X(40).
          03 PT-HCA-TAX-ID                    PIC X(11).
          03 PT-HCA-ADDRESS-LINE1             PIC X(30).
          03 PT-HCA-ADDRESS-LINE2             PIC X(30).
          03 PT-HCA-CITY                      PIC X(20).
          03 PT-HCA-STATE-CODE                PIC X(2).
          03 PT-HCA-ZIP-CODE                  PIC X(9).
          03 PT-HCA-PHONE                     PIC X(14).
          03 PT-HCA-AGENCY-CODE               PIC X(6).
          03 PT-HCA-AGENT-NAME                PIC X(30).
