******************************************************************
*  COPYBOOK  : GHCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CA
******************************************************************
 01  EN-HCA-ENDORSEMENT.

          03 EN-HCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HCA-FORM-NUMBER               PIC X(10).
          03 EN-HCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
