******************************************************************
*  COPYBOOK  : GHCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CO
******************************************************************
 01  PT-HCO-PARTY.

          03 PT-HCO-INSURED-NAME              PIC X(40).
          03 PT-HCO-TAX-ID                    PIC X(11).
          03 PT-HCO-ADDRESS-LINE1             PIC X(30).
          03 PT-HCO-ADDRESS-LINE2             PIC X(30).
          03 PT-HCO-CITY                      PIC X(20).
          03 PT-HCO-STATE-CODE                PIC X(2).
          03 PT-HCO-ZIP-CODE                  PIC X(9).
          03 PT-HCO-PHONE                     PIC X(14).
          03 PT-HCO-AGENCY-CODE               PIC X(6).
          03 PT-HCO-AGENT-NAME                PIC X(30).
