******************************************************************
*  COPYBOOK  : GHCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CO
******************************************************************
 01  EN-HCO-ENDORSEMENT.

          03 EN-HCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HCO-FORM-NUMBER               PIC X(10).
          03 EN-HCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-HCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
