******************************************************************
*  COPYBOOK  : GHCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CT
******************************************************************
 01  PT-HCT-PARTY.

          03 PT-HCT-INSURED-NAME              PIC X(40).
          03 PT-HCT-TAX-ID                    PIC X(11).
          03 PT-HCT-ADDRESS-LINE1             PIC X(30).
          03 PT-HCT-ADDRESS-LINE2             PIC X(30).
          03 PT-HCT-CITY                      PIC X(20).
          03 PT-HCT-STATE-CODE                PIC X(2).
          03 PT-HCT-ZIP-CODE                  PIC X(9).
          03 PT-HCT-PHONE                     PIC X(14).
          03 PT-HCT-AGENCY-CODE               PIC X(6).
          03 PT-HCT-AGENT-NAME                PIC X(30).
