******************************************************************
*  COPYBOOK  : GHCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : CT
******************************************************************
 01  EN-HCT-ENDORSEMENT.

          03 EN-HCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HCT-FORM-NUMBER               PIC X(10).
          03 EN-HCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-HCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
