******************************************************************
*  COPYBOOK  : GHDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : DC
******************************************************************
 01  EN-HDC-ENDORSEMENT.

          03 EN-HDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HDC-FORM-NUMBER               PIC X(10).
          03 EN-HDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-HDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
