******************************************************************
*  COPYBOOK  : GHDCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : DC
******************************************************************
 01  PT-HDC-PARTY.

          03 PT-HDC-INSURED-NAME              PIC X(40).
          03 PT-HDC-TAX-ID                    PIC X(11).
          03 PT-HDC-ADDRESS-LINE1             PIC X(30).
          03 PT-HDC-ADDRESS-LINE2             PIC X(30).
          03 PT-HDC-CITY                      PIC X(20).
          03 PT-HDC-STATE-CODE                PIC X(2).
          03 PT-HDC-ZIP-CODE                  PIC X(9).
          03 PT-HDC-PHONE                     PIC X(14).
          03 PT-HDC-AGENCY-CODE               PIC X(6).
          03 PT-HDC-AGENT-NAME                PIC X(30).
