******************************************************************
*  COPYBOOK  : GHDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : DE
******************************************************************
 01  EN-HDE-ENDORSEMENT.

          03 EN-HDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HDE-FORM-NUMBER               PIC X(10).
          03 EN-HDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-HDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
