******************************************************************
*  COPYBOOK  : GHDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : DE
******************************************************************
 01  PT-HDE-PARTY.

          03 PT-HDE-INSURED-NAME              PIC X(40).
          03 PT-HDE-TAX-ID                    PIC X(11).
          03 PT-HDE-ADDRESS-LINE1             PIC X(30).
          03 PT-HDE-ADDRESS-LINE2             PIC X(30).
          03 PT-HDE-CITY                      PIC X(20).
          03 PT-HDE-STATE-CODE                PIC X(2).
          03 PT-HDE-ZIP-CODE                  PIC X(9).
          03 PT-HDE-PHONE                     PIC X(14).
          03 PT-HDE-AGENCY-CODE               PIC X(6).
          03 PT-HDE-AGENT-NAME                PIC X(30).
