******************************************************************
*  COPYBOOK  : GHFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : FL
******************************************************************
 01  EN-HFL-ENDORSEMENT.

          03 EN-HFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HFL-FORM-NUMBER               PIC X(10).
          03 EN-HFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-HFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
