******************************************************************
*  COPYBOOK  : GHFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : FL
******************************************************************
 01  PT-HFL-PARTY.

          03 PT-HFL-INSURED-NAME              PIC X(40).
          03 PT-HFL-TAX-ID                    PIC X(11).
          03 PT-HFL-ADDRESS-LINE1             PIC X(30).
          03 PT-HFL-ADDRESS-LINE2             PIC X(30).
          03 PT-HFL-CITY                      PIC X(20).
          03 PT-HFL-STATE-CODE                PIC X(2).
          03 PT-HFL-ZIP-CODE                  PIC X(9).
          03 PT-HFL-PHONE                     PIC X(14).
          03 PT-HFL-AGENCY-CODE               PIC X(6).
          03 PT-HFL-AGENT-NAME                PIC X(30).
