******************************************************************
*  COPYBOOK  : GHGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : GA
******************************************************************
 01  EN-HGA-ENDORSEMENT.

          03 EN-HGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HGA-FORM-NUMBER               PIC X(10).
          03 EN-HGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
