******************************************************************
*  COPYBOOK  : GHGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : GA
******************************************************************
 01  PT-HGA-PARTY.

          03 PT-HGA-INSURED-NAME              PIC X(40).
          03 PT-HGA-TAX-ID                    PIC X(11).
          03 PT-HGA-ADDRESS-LINE1             PIC X(30).
          03 PT-HGA-ADDRESS-LINE2             PIC X(30).
          03 PT-HGA-CITY                      PIC X(20).
          03 PT-HGA-STATE-CODE                PIC X(2).
          03 PT-HGA-ZIP-CODE                  PIC X(9).
          03 PT-HGA-PHONE                     PIC X(14).
          03 PT-HGA-AGENCY-CODE               PIC X(6).
          03 PT-HGA-AGENT-NAME                PIC X(30).
