******************************************************************
*  COPYBOOK  : GHHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : HI
******************************************************************
 01  PT-HHI-PARTY.

          03 PT-HHI-INSURED-NAME              PIC X(40).
          03 PT-HHI-TAX-ID                    PIC X(11).
          03 PT-HHI-ADDRESS-LINE1             PIC X(30).
          03 PT-HHI-ADDRESS-LINE2             PIC X(30).
          03 PT-HHI-CITY                      PIC X(20).
          03 PT-HHI-STATE-CODE                PIC X(2).
          03 PT-HHI-ZIP-CODE                  PIC X(9).
          03 PT-HHI-PHONE                     PIC X(14).
          03 PT-HHI-AGENCY-CODE               PIC X(6).
          03 PT-HHI-AGENT-NAME                PIC X(30).
