******************************************************************
*  COPYBOOK  : GHHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : HI
******************************************************************
 01  EN-HHI-ENDORSEMENT.

          03 EN-HHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HHI-FORM-NUMBER               PIC X(10).
          03 EN-HHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-HHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
