******************************************************************
*  COPYBOOK  : GHIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IA
******************************************************************
 01  PT-HIA-PARTY.

          03 PT-HIA-INSURED-NAME              PIC X(40).
          03 PT-HIA-TAX-ID                    PIC X(11).
          03 PT-HIA-ADDRESS-LINE1             PIC X(30).
          03 PT-HIA-ADDRESS-LINE2             PIC X(30).
          03 PT-HIA-CITY                      PIC X(20).
          03 PT-HIA-STATE-CODE                PIC X(2).
          03 PT-HIA-ZIP-CODE                  PIC X(9).
          03 PT-HIA-PHONE                     PIC X(14).
          03 PT-HIA-AGENCY-CODE               PIC X(6).
          03 PT-HIA-AGENT-NAME                PIC X(30).
