******************************************************************
*  COPYBOOK  : GHIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IA
******************************************************************
 01  EN-HIA-ENDORSEMENT.

          03 EN-HIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HIA-FORM-NUMBER               PIC X(10).
          03 EN-HIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
