******************************************************************
*  COPYBOOK  : GHIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : ID
******************************************************************
 01  EN-HID-ENDORSEMENT.

          03 EN-HID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HID-FORM-NUMBER               PIC X(10).
          03 EN-HID-EFFECTIVE-DATE            PIC X(10).
          03 EN-HID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
