******************************************************************
*  COPYBOOK  : GHILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IL
******************************************************************
 01  EN-HIL-ENDORSEMENT.

          03 EN-HIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HIL-FORM-NUMBER               PIC X(10).
          03 EN-HIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-HIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
