******************************************************************
*  COPYBOOK  : GHILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IL
******************************************************************
 01  PT-HIL-PARTY.

          03 PT-HIL-INSURED-NAME              PIC X(40).
          03 PT-HIL-TAX-ID                    PIC X(11).
          03 PT-HIL-ADDRESS-LINE1             PIC X(30).
          03 PT-HIL-ADDRESS-LINE2             PIC X(30).
          03 PT-HIL-CITY                      PIC X(20).
          03 PT-HIL-STATE-CODE                PIC X(2).
          03 PT-HIL-ZIP-CODE                  PIC X(9).
          03 PT-HIL-PHONE                     PIC X(14).
          03 PT-HIL-AGENCY-CODE               PIC X(6).
          03 PT-HIL-AGENT-NAME                PIC X(30).
