******************************************************************
*  COPYBOOK  : GHINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IN
******************************************************************
 01  EN-HIN-ENDORSEMENT.

          03 EN-HIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HIN-FORM-NUMBER               PIC X(10).
          03 EN-HIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-HIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
