******************************************************************
*  COPYBOOK  : GHINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : IN
******************************************************************
 01  PT-HIN-PARTY.

          03 PT-HIN-INSURED-NAME              PIC X(40).
          03 PT-HIN-TAX-ID                    PIC X(11).
          03 PT-HIN-ADDRESS-LINE1             PIC X(30).
          03 PT-HIN-ADDRESS-LINE2             PIC X(30).
          03 PT-HIN-CITY                      PIC X(20).
          03 PT-HIN-STATE-CODE                PIC X(2).
          03 PT-HIN-ZIP-CODE                  PIC X(9).
          03 PT-HIN-PHONE                     PIC X(14).
          03 PT-HIN-AGENCY-CODE               PIC X(6).
          03 PT-HIN-AGENT-NAME                PIC X(30).
