******************************************************************
*  COPYBOOK  : GHKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : KS
******************************************************************
 01  PT-HKS-PARTY.

          03 PT-HKS-INSURED-NAME              PIC X(40).
          03 PT-HKS-TAX-ID                    PIC X(11).
          03 PT-HKS-ADDRESS-LINE1             PIC X(30).
          03 PT-HKS-ADDRESS-LINE2             PIC X(30).
          03 PT-HKS-CITY                      PIC X(20).
          03 PT-HKS-STATE-CODE                PIC X(2).
          03 PT-HKS-ZIP-CODE                  PIC X(9).
          03 PT-HKS-PHONE                     PIC X(14).
          03 PT-HKS-AGENCY-CODE               PIC X(6).
          03 PT-HKS-AGENT-NAME                PIC X(30).
