******************************************************************
*  COPYBOOK  : GHKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : KS
******************************************************************
 01  EN-HKS-ENDORSEMENT.

          03 EN-HKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HKS-FORM-NUMBER               PIC X(10).
          03 EN-HKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-HKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
