******************************************************************
*  COPYBOOK  : GHKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : KY
******************************************************************
 01  PT-HKY-PARTY.

          03 PT-HKY-INSURED-NAME              PIC X(40).
          03 PT-HKY-TAX-ID                    PIC X(11).
          03 PT-HKY-ADDRESS-LINE1             PIC X(30).
          03 PT-HKY-ADDRESS-LINE2             PIC X(30).
          03 PT-HKY-CITY                      PIC X(20).
          03 PT-HKY-STATE-CODE                PIC X(2).
          03 PT-HKY-ZIP-CODE                  PIC X(9).
          03 PT-HKY-PHONE                     PIC X(14).
          03 PT-HKY-AGENCY-CODE               PIC X(6).
          03 PT-HKY-AGENT-NAME                PIC X(30).
