******************************************************************
*  COPYBOOK  : GHKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : KY
******************************************************************
 01  EN-HKY-ENDORSEMENT.

          03 EN-HKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HKY-FORM-NUMBER               PIC X(10).
          03 EN-HKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-HKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
