******************************************************************
*  COPYBOOK  : GHLAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : LA
******************************************************************
 01  PT-HLA-PARTY.

          03 PT-HLA-INSURED-NAME              PIC X(40).
          03 PT-HLA-TAX-ID                    PIC X(11).
          03 PT-HLA-ADDRESS-LINE1             PIC X(30).
          03 PT-HLA-ADDRESS-LINE2             PIC X(30).
          03 PT-HLA-CITY                      PIC X(20).
          03 PT-HLA-STATE-CODE                PIC X(2).
          03 PT-HLA-ZIP-CODE                  PIC X(9).
          03 PT-HLA-PHONE                     PIC X(14).
          03 PT-HLA-AGENCY-CODE               PIC X(6).
          03 PT-HLA-AGENT-NAME                PIC X(30).
