******************************************************************
*  COPYBOOK  : GHLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : LA
******************************************************************
 01  EN-HLA-ENDORSEMENT.

          03 EN-HLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HLA-FORM-NUMBER               PIC X(10).
          03 EN-HLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
