******************************************************************
*  COPYBOOK  : GHMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MA
******************************************************************
 01  EN-HMA-ENDORSEMENT.

          03 EN-HMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMA-FORM-NUMBER               PIC X(10).
          03 EN-HMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
