******************************************************************
*  COPYBOOK  : GHMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MA
******************************************************************
 01  PT-HMA-PARTY.

          03 PT-HMA-INSURED-NAME              PIC X(40).
          03 PT-HMA-TAX-ID                    PIC X(11).
          03 PT-HMA-ADDRESS-LINE1             PIC X(30).
          03 PT-HMA-ADDRESS-LINE2             PIC X(30).
          03 PT-HMA-CITY                      PIC X(20).
          03 PT-HMA-STATE-CODE                PIC X(2).
          03 PT-HMA-ZIP-CODE                  PIC X(9).
          03 PT-HMA-PHONE                     PIC X(14).
          03 PT-HMA-AGENCY-CODE               PIC X(6).
          03 PT-HMA-AGENT-NAME                PIC X(30).
