******************************************************************
*  COPYBOOK  : GHMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MD
******************************************************************
 01  EN-HMD-ENDORSEMENT.

          03 EN-HMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMD-FORM-NUMBER               PIC X(10).
          03 EN-HMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
