******************************************************************
*  COPYBOOK  : GHMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : ME
******************************************************************
 01  EN-HME-ENDORSEMENT.

          03 EN-HME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HME-FORM-NUMBER               PIC X(10).
          03 EN-HME-EFFECTIVE-DATE            PIC X(10).
          03 EN-HME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
