******************************************************************
*  COPYBOOK  : GHMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : ME
******************************************************************
 01  PT-HME-PARTY.

          03 PT-HME-INSURED-NAME              PIC X(40).
          03 PT-HME-TAX-ID                    PIC X(11).
          03 PT-HME-ADDRESS-LINE1             PIC X(30).
          03 PT-HME-ADDRESS-LINE2             PIC X(30).
          03 PT-HME-CITY                      PIC X(20).
          03 PT-HME-STATE-CODE                PIC X(2).
          03 PT-HME-ZIP-CODE                  PIC X(9).
          03 PT-HME-PHONE                     PIC X(14).
          03 PT-HME-AGENCY-CODE               PIC X(6).
          03 PT-HME-AGENT-NAME                PIC X(30).
