******************************************************************
*  COPYBOOK  : GHMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MI
******************************************************************
 01  EN-HMI-ENDORSEMENT.

          03 EN-HMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMI-FORM-NUMBER               PIC X(10).
          03 EN-HMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
