******************************************************************
*  COPYBOOK  : GHMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MN
******************************************************************
 01  EN-HMN-ENDORSEMENT.

          03 EN-HMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMN-FORM-NUMBER               PIC X(10).
          03 EN-HMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
