******************************************************************
*  COPYBOOK  : GHMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MN
******************************************************************
 01  PT-HMN-PARTY.

          03 PT-HMN-INSURED-NAME              PIC X(40).
          03 PT-HMN-TAX-ID                    PIC X(11).
          03 PT-HMN-ADDRESS-LINE1             PIC X(30).
          03 PT-HMN-ADDRESS-LINE2             PIC X(30).
          03 PT-HMN-CITY                      PIC X(20).
          03 PT-HMN-STATE-CODE                PIC X(2).
          03 PT-HMN-ZIP-CODE                  PIC X(9).
          03 PT-HMN-PHONE                     PIC X(14).
          03 PT-HMN-AGENCY-CODE               PIC X(6).
          03 PT-HMN-AGENT-NAME                PIC X(30).
