******************************************************************
*  COPYBOOK  : GHMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MO
******************************************************************
 01  EN-HMO-ENDORSEMENT.

          03 EN-HMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMO-FORM-NUMBER               PIC X(10).
          03 EN-HMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
