******************************************************************
*  COPYBOOK  : GHMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MO
******************************************************************
 01  PT-HMO-PARTY.

          03 PT-HMO-INSURED-NAME              PIC X(40).
          03 PT-HMO-TAX-ID                    PIC X(11).
          03 PT-HMO-ADDRESS-LINE1             PIC X(30).
          03 PT-HMO-ADDRESS-LINE2             PIC X(30).
          03 PT-HMO-CITY                      PIC X(20).
          03 PT-HMO-STATE-CODE                PIC X(2).
          03 PT-HMO-ZIP-CODE                  PIC X(9).
          03 PT-HMO-PHONE                     PIC X(14).
          03 PT-HMO-AGENCY-CODE               PIC X(6).
          03 PT-HMO-AGENT-NAME                PIC X(30).
