******************************************************************
*  COPYBOOK  : GHMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MS
******************************************************************
 01  PT-HMS-PARTY.

          03 PT-HMS-INSURED-NAME              PIC X(40).
          03 PT-HMS-TAX-ID                    PIC X(11).
          03 PT-HMS-ADDRESS-LINE1             PIC X(30).
          03 PT-HMS-ADDRESS-LINE2             PIC X(30).
          03 PT-HMS-CITY                      PIC X(20).
          03 PT-HMS-STATE-CODE                PIC X(2).
          03 PT-HMS-ZIP-CODE                  PIC X(9).
          03 PT-HMS-PHONE                     PIC X(14).
          03 PT-HMS-AGENCY-CODE               PIC X(6).
          03 PT-HMS-AGENT-NAME                PIC X(30).
