******************************************************************
*  COPYBOOK  : GHMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MS
******************************************************************
 01  EN-HMS-ENDORSEMENT.

          03 EN-HMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMS-FORM-NUMBER               PIC X(10).
          03 EN-HMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
