******************************************************************
*  COPYBOOK  : GHMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MT
******************************************************************
 01  EN-HMT-ENDORSEMENT.

          03 EN-HMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HMT-FORM-NUMBER               PIC X(10).
          03 EN-HMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-HMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
