******************************************************************
*  COPYBOOK  : GHMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : MT
******************************************************************
 01  PT-HMT-PARTY.

          03 PT-HMT-INSURED-NAME              PIC X(40).
          03 PT-HMT-TAX-ID                    PIC X(11).
          03 PT-HMT-ADDRESS-LINE1             PIC X(30).
          03 PT-HMT-ADDRESS-LINE2             PIC X(30).
          03 PT-HMT-CITY                      PIC X(20).
          03 PT-HMT-STATE-CODE                PIC X(2).
          03 PT-HMT-ZIP-CODE                  PIC X(9).
          03 PT-HMT-PHONE                     PIC X(14).
          03 PT-HMT-AGENCY-CODE               PIC X(6).
          03 PT-HMT-AGENT-NAME                PIC X(30).
