******************************************************************
*  COPYBOOK  : GHNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NC
******************************************************************
 01  EN-HNC-ENDORSEMENT.

          03 EN-HNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNC-FORM-NUMBER               PIC X(10).
          03 EN-HNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
