******************************************************************
*  COPYBOOK  : GHNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : ND
******************************************************************
 01  EN-HND-ENDORSEMENT.

          03 EN-HND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HND-FORM-NUMBER               PIC X(10).
          03 EN-HND-EFFECTIVE-DATE            PIC X(10).
          03 EN-HND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
