******************************************************************
*  COPYBOOK  : GHNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NE
******************************************************************
 01  EN-HNE-ENDORSEMENT.

          03 EN-HNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNE-FORM-NUMBER               PIC X(10).
          03 EN-HNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
