******************************************************************
*  COPYBOOK  : GHNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NH
******************************************************************
 01  PT-HNH-PARTY.

          03 PT-HNH-INSURED-NAME              PIC X(40).
          03 PT-HNH-TAX-ID                    PIC X(11).
          03 PT-HNH-ADDRESS-LINE1             PIC X(30).
          03 PT-HNH-ADDRESS-LINE2             PIC X(30).
          03 PT-HNH-CITY                      PIC X(20).
          03 PT-HNH-STATE-CODE                PIC X(2).
          03 PT-HNH-ZIP-CODE                  PIC X(9).
          03 PT-HNH-PHONE                     PIC X(14).
          03 PT-HNH-AGENCY-CODE               PIC X(6).
          03 PT-HNH-AGENT-NAME                PIC X(30).
