******************************************************************
*  COPYBOOK  : GHNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NH
******************************************************************
 01  EN-HNH-ENDORSEMENT.

          03 EN-HNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNH-FORM-NUMBER               PIC X(10).
          03 EN-HNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
