******************************************************************
*  COPYBOOK  : GHNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NJ
******************************************************************
 01  PT-HNJ-PARTY.

          03 PT-HNJ-INSURED-NAME              PIC X(40).
          03 PT-HNJ-TAX-ID                    PIC X(11).
          03 PT-HNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-HNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-HNJ-CITY                      PIC X(20).
          03 PT-HNJ-STATE-CODE                PIC X(2).
          03 PT-HNJ-ZIP-CODE                  PIC X(9).
          03 PT-HNJ-PHONE                     PIC X(14).
          03 PT-HNJ-AGENCY-CODE               PIC X(6).
          03 PT-HNJ-AGENT-NAME                PIC X(30).
