******************************************************************
*  COPYBOOK  : GHNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NJ
******************************************************************
 01  EN-HNJ-ENDORSEMENT.

          03 EN-HNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNJ-FORM-NUMBER               PIC X(10).
          03 EN-HNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
