******************************************************************
*  COPYBOOK  : GHNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NM
******************************************************************
 01  EN-HNM-ENDORSEMENT.

          03 EN-HNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNM-FORM-NUMBER               PIC X(10).
          03 EN-HNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
