******************************************************************
*  COPYBOOK  : GHNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NM
******************************************************************
 01  PT-HNM-PARTY.

          03 PT-HNM-INSURED-NAME              PIC X(40).
          03 PT-HNM-TAX-ID                    PIC X(11).
          03 PT-HNM-ADDRESS-LINE1             PIC X(30).
          03 PT-HNM-ADDRESS-LINE2             PIC X(30).
          03 PT-HNM-CITY                      PIC X(20).
          03 PT-HNM-STATE-CODE                PIC X(2).
          03 PT-HNM-ZIP-CODE                  PIC X(9).
          03 PT-HNM-PHONE                     PIC X(14).
          03 PT-HNM-AGENCY-CODE               PIC X(6).
          03 PT-HNM-AGENT-NAME                PIC X(30).
