******************************************************************
*  COPYBOOK  : GHNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NV
******************************************************************
 01  EN-HNV-ENDORSEMENT.

          03 EN-HNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNV-FORM-NUMBER               PIC X(10).
          03 EN-HNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
