******************************************************************
*  COPYBOOK  : GHNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NY
******************************************************************
 01  EN-HNY-ENDORSEMENT.

          03 EN-HNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HNY-FORM-NUMBER               PIC X(10).
          03 EN-HNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-HNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
