******************************************************************
*  COPYBOOK  : GHNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : NY
******************************************************************
 01  PT-HNY-PARTY.

          03 PT-HNY-INSURED-NAME              PIC X(40).
          03 PT-HNY-TAX-ID                    PIC X(11).
          03 PT-HNY-ADDRESS-LINE1             PIC X(30).
          03 PT-HNY-ADDRESS-LINE2             PIC X(30).
          03 PT-HNY-CITY                      PIC X(20).
          03 PT-HNY-STATE-CODE                PIC X(2).
          03 PT-HNY-ZIP-CODE                  PIC X(9).
          03 PT-HNY-PHONE                     PIC X(14).
          03 PT-HNY-AGENCY-CODE               PIC X(6).
          03 PT-HNY-AGENT-NAME                PIC X(30).
