******************************************************************
*  COPYBOOK  : GHOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OH
******************************************************************
 01  PT-HOH-PARTY.

          03 PT-HOH-INSURED-NAME              PIC X(40).
          03 PT-HOH-TAX-ID                    PIC X(11).
          03 PT-HOH-ADDRESS-LINE1             PIC X(30).
          03 PT-HOH-ADDRESS-LINE2             PIC X(30).
          03 PT-HOH-CITY                      PIC X(20).
          03 PT-HOH-STATE-CODE                PIC X(2).
          03 PT-HOH-ZIP-CODE                  PIC X(9).
          03 PT-HOH-PHONE                     PIC X(14).
          03 PT-HOH-AGENCY-CODE               PIC X(6).
          03 PT-HOH-AGENT-NAME                PIC X(30).
