******************************************************************
*  COPYBOOK  : GHOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OH
******************************************************************
 01  EN-HOH-ENDORSEMENT.

          03 EN-HOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HOH-FORM-NUMBER               PIC X(10).
          03 EN-HOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-HOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
