******************************************************************
*  COPYBOOK  : GHOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OK
******************************************************************
 01  PT-HOK-PARTY.

          03 PT-HOK-INSURED-NAME              PIC X(40).
          03 PT-HOK-TAX-ID                    PIC X(11).
          03 PT-HOK-ADDRESS-LINE1             PIC X(30).
          03 PT-HOK-ADDRESS-LINE2             PIC X(30).
          03 PT-HOK-CITY                      PIC X(20).
          03 PT-HOK-STATE-CODE                PIC X(2).
          03 PT-HOK-ZIP-CODE                  PIC X(9).
          03 PT-HOK-PHONE                     PIC X(14).
          03 PT-HOK-AGENCY-CODE               PIC X(6).
          03 PT-HOK-AGENT-NAME                PIC X(30).
