******************************************************************
*  COPYBOOK  : GHOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OK
******************************************************************
 01  EN-HOK-ENDORSEMENT.

          03 EN-HOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HOK-FORM-NUMBER               PIC X(10).
          03 EN-HOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-HOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
