******************************************************************
*  COPYBOOK  : GHORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OR
******************************************************************
 01  EN-HOR-ENDORSEMENT.

          03 EN-HOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HOR-FORM-NUMBER               PIC X(10).
          03 EN-HOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-HOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
