******************************************************************
*  COPYBOOK  : GHORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : OR
******************************************************************
 01  PT-HOR-PARTY.

          03 PT-HOR-INSURED-NAME              PIC X(40).
          03 PT-HOR-TAX-ID                    PIC X(11).
          03 PT-HOR-ADDRESS-LINE1             PIC X(30).
          03 PT-HOR-ADDRESS-LINE2             PIC X(30).
          03 PT-HOR-CITY                      PIC X(20).
          03 PT-HOR-STATE-CODE                PIC X(2).
          03 PT-HOR-ZIP-CODE                  PIC X(9).
          03 PT-HOR-PHONE                     PIC X(14).
          03 PT-HOR-AGENCY-CODE               PIC X(6).
          03 PT-HOR-AGENT-NAME                PIC X(30).
