******************************************************************
*  COPYBOOK  : GHPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : PA
******************************************************************
 01  EN-HPA-ENDORSEMENT.

          03 EN-HPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HPA-FORM-NUMBER               PIC X(10).
          03 EN-HPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
