******************************************************************
*  COPYBOOK  : GHRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : RI
******************************************************************
 01  EN-HRI-ENDORSEMENT.

          03 EN-HRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HRI-FORM-NUMBER               PIC X(10).
          03 EN-HRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-HRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
