******************************************************************
*  COPYBOOK  : GHRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : RI
******************************************************************
 01  PT-HRI-PARTY.

          03 PT-HRI-INSURED-NAME              PIC X(40).
          03 PT-HRI-TAX-ID                    PIC X(11).
          03 PT-HRI-ADDRESS-LINE1             PIC X(30).
          03 PT-HRI-ADDRESS-LINE2             PIC X(30).
          03 PT-HRI-CITY                      PIC X(20).
          03 PT-HRI-STATE-CODE                PIC X(2).
          03 PT-HRI-ZIP-CODE                  PIC X(9).
          03 PT-HRI-PHONE                     PIC X(14).
          03 PT-HRI-AGENCY-CODE               PIC X(6).
          03 PT-HRI-AGENT-NAME                PIC X(30).
