******************************************************************
*  COPYBOOK  : GHSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : SC
******************************************************************
 01  EN-HSC-ENDORSEMENT.

          03 EN-HSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HSC-FORM-NUMBER               PIC X(10).
          03 EN-HSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-HSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
