******************************************************************
*  COPYBOOK  : GHSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : SC
******************************************************************
 01  PT-HSC-PARTY.

          03 PT-HSC-INSURED-NAME              PIC X(40).
          03 PT-HSC-TAX-ID                    PIC X(11).
          03 PT-HSC-ADDRESS-LINE1             PIC X(30).
          03 PT-HSC-ADDRESS-LINE2             PIC X(30).
          03 PT-HSC-CITY                      PIC X(20).
          03 PT-HSC-STATE-CODE                PIC X(2).
          03 PT-HSC-ZIP-CODE                  PIC X(9).
          03 PT-HSC-PHONE                     PIC X(14).
          03 PT-HSC-AGENCY-CODE               PIC X(6).
          03 PT-HSC-AGENT-NAME                PIC X(30).
