******************************************************************
*  COPYBOOK  : GHTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : TN
******************************************************************
 01  PT-HTN-PARTY.

          03 PT-HTN-INSURED-NAME              PIC X(40).
          03 PT-HTN-TAX-ID                    PIC X(11).
          03 PT-HTN-ADDRESS-LINE1             PIC X(30).
          03 PT-HTN-ADDRESS-LINE2             PIC X(30).
          03 PT-HTN-CITY                      PIC X(20).
          03 PT-HTN-STATE-CODE                PIC X(2).
          03 PT-HTN-ZIP-CODE                  PIC X(9).
          03 PT-HTN-PHONE                     PIC X(14).
          03 PT-HTN-AGENCY-CODE               PIC X(6).
          03 PT-HTN-AGENT-NAME                PIC X(30).
