******************************************************************
*  COPYBOOK  : GHTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : TN
******************************************************************
 01  EN-HTN-ENDORSEMENT.

          03 EN-HTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HTN-FORM-NUMBER               PIC X(10).
          03 EN-HTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-HTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
