******************************************************************
*  COPYBOOK  : GHTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : TX
******************************************************************
 01  EN-HTX-ENDORSEMENT.

          03 EN-HTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HTX-FORM-NUMBER               PIC X(10).
          03 EN-HTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-HTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
