******************************************************************
*  COPYBOOK  : GHTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : TX
******************************************************************
 01  PT-HTX-PARTY.

          03 PT-HTX-INSURED-NAME              PIC X(40).
          03 PT-HTX-TAX-ID                    PIC X(11).
          03 PT-HTX-ADDRESS-LINE1             PIC X(30).
          03 PT-HTX-ADDRESS-LINE2             PIC X(30).
          03 PT-HTX-CITY                      PIC X(20).
          03 PT-HTX-STATE-CODE                PIC X(2).
          03 PT-HTX-ZIP-CODE                  PIC X(9).
          03 PT-HTX-PHONE                     PIC X(14).
          03 PT-HTX-AGENCY-CODE               PIC X(6).
          03 PT-HTX-AGENT-NAME                PIC X(30).
