******************************************************************
*  COPYBOOK  : GHUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : UT
******************************************************************
 01  EN-HUT-ENDORSEMENT.

          03 EN-HUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HUT-FORM-NUMBER               PIC X(10).
          03 EN-HUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-HUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
