******************************************************************
*  COPYBOOK  : GHVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : VA
******************************************************************
 01  PT-HVA-PARTY.

          03 PT-HVA-INSURED-NAME              PIC X(40).
          03 PT-HVA-TAX-ID                    PIC X(11).
          03 PT-HVA-ADDRESS-LINE1             PIC X(30).
          03 PT-HVA-ADDRESS-LINE2             PIC X(30).
          03 PT-HVA-CITY                      PIC X(20).
          03 PT-HVA-STATE-CODE                PIC X(2).
          03 PT-HVA-ZIP-CODE                  PIC X(9).
          03 PT-HVA-PHONE                     PIC X(14).
          03 PT-HVA-AGENCY-CODE               PIC X(6).
          03 PT-HVA-AGENT-NAME                PIC X(30).
