******************************************************************
*  COPYBOOK  : GHVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : VA
******************************************************************
 01  EN-HVA-ENDORSEMENT.

          03 EN-HVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HVA-FORM-NUMBER               PIC X(10).
          03 EN-HVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
