******************************************************************
*  COPYBOOK  : GHVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : VT
******************************************************************
 01  EN-HVT-ENDORSEMENT.

          03 EN-HVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HVT-FORM-NUMBER               PIC X(10).
          03 EN-HVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-HVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
