******************************************************************
*  COPYBOOK  : GHVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : VT
******************************************************************
 01  PT-HVT-PARTY.

          03 PT-HVT-INSURED-NAME              PIC X(40).
          03 PT-HVT-TAX-ID                    PIC X(11).
          03 PT-HVT-ADDRESS-LINE1             PIC X(30).
          03 PT-HVT-ADDRESS-LINE2             PIC X(30).
          03 PT-HVT-CITY                      PIC X(20).
          03 PT-HVT-STATE-CODE                PIC X(2).
          03 PT-HVT-ZIP-CODE                  PIC X(9).
          03 PT-HVT-PHONE                     PIC X(14).
          03 PT-HVT-AGENCY-CODE               PIC X(6).
          03 PT-HVT-AGENT-NAME                PIC X(30).
