******************************************************************
*  COPYBOOK  : GHWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WA
******************************************************************
 01  PT-HWA-PARTY.

          03 PT-HWA-INSURED-NAME              PIC X(40).
          03 PT-HWA-TAX-ID                    PIC X(11).
          03 PT-HWA-ADDRESS-LINE1             PIC X(30).
          03 PT-HWA-ADDRESS-LINE2             PIC X(30).
          03 PT-HWA-CITY                      PIC X(20).
          03 PT-HWA-STATE-CODE                PIC X(2).
          03 PT-HWA-ZIP-CODE                  PIC X(9).
          03 PT-HWA-PHONE                     PIC X(14).
          03 PT-HWA-AGENCY-CODE               PIC X(6).
          03 PT-HWA-AGENT-NAME                PIC X(30).
