******************************************************************
*  COPYBOOK  : GHWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WA
******************************************************************
 01  EN-HWA-ENDORSEMENT.

          03 EN-HWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HWA-FORM-NUMBER               PIC X(10).
          03 EN-HWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-HWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
