******************************************************************
*  COPYBOOK  : GHWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WI
******************************************************************
 01  EN-HWI-ENDORSEMENT.

          03 EN-HWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HWI-FORM-NUMBER               PIC X(10).
          03 EN-HWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-HWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
