******************************************************************
*  COPYBOOK  : GHWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WI
******************************************************************
 01  PT-HWI-PARTY.

          03 PT-HWI-INSURED-NAME              PIC X(40).
          03 PT-HWI-TAX-ID                    PIC X(11).
          03 PT-HWI-ADDRESS-LINE1             PIC X(30).
          03 PT-HWI-ADDRESS-LINE2             PIC X(30).
          03 PT-HWI-CITY                      PIC X(20).
          03 PT-HWI-STATE-CODE                PIC X(2).
          03 PT-HWI-ZIP-CODE                  PIC X(9).
          03 PT-HWI-PHONE                     PIC X(14).
          03 PT-HWI-AGENCY-CODE               PIC X(6).
          03 PT-HWI-AGENT-NAME                PIC X(30).
