******************************************************************
*  COPYBOOK  : GHWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WV
******************************************************************
 01  PT-HWV-PARTY.

          03 PT-HWV-INSURED-NAME              PIC X(40).
          03 PT-HWV-TAX-ID                    PIC X(11).
          03 PT-HWV-ADDRESS-LINE1             PIC X(30).
          03 PT-HWV-ADDRESS-LINE2             PIC X(30).
          03 PT-HWV-CITY                      PIC X(20).
          03 PT-HWV-STATE-CODE                PIC X(2).
          03 PT-HWV-ZIP-CODE                  PIC X(9).
          03 PT-HWV-PHONE                     PIC X(14).
          03 PT-HWV-AGENCY-CODE               PIC X(6).
          03 PT-HWV-AGENT-NAME                PIC X(30).
