******************************************************************
*  COPYBOOK  : GHWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WV
******************************************************************
 01  EN-HWV-ENDORSEMENT.

          03 EN-HWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HWV-FORM-NUMBER               PIC X(10).
          03 EN-HWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-HWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
