******************************************************************
*  COPYBOOK  : GHWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WY
******************************************************************
 01  EN-HWY-ENDORSEMENT.

          03 EN-HWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-HWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-HWY-FORM-NUMBER               PIC X(10).
          03 EN-HWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-HWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
