******************************************************************
*  COPYBOOK  : GHWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Hired and Non-Owned Auto Liability (HN)
*  STATE     : WY
******************************************************************
 01  PT-HWY-PARTY.

          03 PT-HWY-INSURED-NAME              PIC X(40).
          03 PT-HWY-TAX-ID                    PIC X(11).
          03 PT-HWY-ADDRESS-LINE1             PIC X(30).
          03 PT-HWY-ADDRESS-LINE2             PIC X(30).
          03 PT-HWY-CITY                      PIC X(20).
          03 PT-HWY-STATE-CODE                PIC X(2).
          03 PT-HWY-ZIP-CODE                  PIC X(9).
          03 PT-HWY-PHONE                     PIC X(14).
          03 PT-HWY-AGENCY-CODE               PIC X(6).
          03 PT-HWY-AGENT-NAME                PIC X(30).
