******************************************************************
*  COPYBOOK  : GFAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AK
******************************************************************
 01  PT-FAK-PARTY.

          03 PT-FAK-INSURED-NAME              PIC X(40).
          03 PT-FAK-TAX-ID                    PIC X(11).
          03 PT-FAK-ADDRESS-LINE1             PIC X(30).
          03 PT-FAK-ADDRESS-LINE2             PIC X(30).
          03 PT-FAK-CITY                      PIC X(20).
          03 PT-FAK-STATE-CODE                PIC X(2).
          03 PT-FAK-ZIP-CODE                  PIC X(9).
          03 PT-FAK-PHONE                     PIC X(14).
          03 PT-FAK-AGENCY-CODE               PIC X(6).
          03 PT-FAK-AGENT-NAME                PIC X(30).
