******************************************************************
*  COPYBOOK  : GFAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AK
******************************************************************
 01  EN-FAK-ENDORSEMENT.

          03 EN-FAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FAK-FORM-NUMBER               PIC X(10).
          03 EN-FAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-FAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
