******************************************************************
*  COPYBOOK  : GFALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AL
******************************************************************
 01  PT-FAL-PARTY.

          03 PT-FAL-INSURED-NAME              PIC X(40).
          03 PT-FAL-TAX-ID                    PIC X(11).
          03 PT-FAL-ADDRESS-LINE1             PIC X(30).
          03 PT-FAL-ADDRESS-LINE2             PIC X(30).
          03 PT-FAL-CITY                      PIC X(20).
          03 PT-FAL-STATE-CODE                PIC X(2).
          03 PT-FAL-ZIP-CODE                  PIC X(9).
          03 PT-FAL-PHONE                     PIC X(14).
          03 PT-FAL-AGENCY-CODE               PIC X(6).
          03 PT-FAL-AGENT-NAME                PIC X(30).
