******************************************************************
*  COPYBOOK  : GFARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AR
******************************************************************
 01  PT-FAR-PARTY.

          03 PT-FAR-INSURED-NAME              PIC X(40).
          03 PT-FAR-TAX-ID                    PIC X(11).
          03 PT-FAR-ADDRESS-LINE1             PIC X(30).
          03 PT-FAR-ADDRESS-LINE2             PIC X(30).
          03 PT-FAR-CITY                      PIC X(20).
          03 PT-FAR-STATE-CODE                PIC X(2).
          03 PT-FAR-ZIP-CODE                  PIC X(9).
          03 PT-FAR-PHONE                     PIC X(14).
          03 PT-FAR-AGENCY-CODE               PIC X(6).
          03 PT-FAR-AGENT-NAME                PIC X(30).
