******************************************************************
*  COPYBOOK  : GFARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AR
******************************************************************
 01  EN-FAR-ENDORSEMENT.

          03 EN-FAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FAR-FORM-NUMBER               PIC X(10).
          03 EN-FAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-FAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
