******************************************************************
*  COPYBOOK  : GFAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AZ
******************************************************************
 01  EN-FAZ-ENDORSEMENT.

          03 EN-FAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FAZ-FORM-NUMBER               PIC X(10).
          03 EN-FAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-FAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
