******************************************************************
*  COPYBOOK  : GFAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : AZ
******************************************************************
 01  PT-FAZ-PARTY.

          03 PT-FAZ-INSURED-NAME              PIC X(40).
          03 PT-FAZ-TAX-ID                    PIC X(11).
          03 PT-FAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-FAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-FAZ-CITY                      PIC X(20).
          03 PT-FAZ-STATE-CODE                PIC X(2).
          03 PT-FAZ-ZIP-CODE                  PIC X(9).
          03 PT-FAZ-PHONE                     PIC X(14).
          03 PT-FAZ-AGENCY-CODE               PIC X(6).
          03 PT-FAZ-AGENT-NAME                PIC X(30).
