******************************************************************
*  COPYBOOK  : GFCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CA
******************************************************************
 01  EN-FCA-ENDORSEMENT.

          03 EN-FCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FCA-FORM-NUMBER               PIC X(10).
          03 EN-FCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
