******************************************************************
*  COPYBOOK  : GFCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CA
******************************************************************
 01  PT-FCA-PARTY.

          03 PT-FCA-INSURED-NAME              PIC X(40).
          03 PT-FCA-TAX-ID                    PIC X(11).
          03 PT-FCA-ADDRESS-LINE1             PIC X(30).
          03 PT-FCA-ADDRESS-LINE2             PIC X(30).
          03 PT-FCA-CITY                      PIC X(20).
          03 PT-FCA-STATE-CODE                PIC X(2).
          03 PT-FCA-ZIP-CODE                  PIC X(9).
          03 PT-FCA-PHONE                     PIC X(14).
          03 PT-FCA-AGENCY-CODE               PIC X(6).
          03 PT-FCA-AGENT-NAME                PIC X(30).
