******************************************************************
*  COPYBOOK  : GFCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CO
******************************************************************
 01  PT-FCO-PARTY.

          03 PT-FCO-INSURED-NAME              PIC X(40).
          03 PT-FCO-TAX-ID                    PIC X(11).
          03 PT-FCO-ADDRESS-LINE1             PIC X(30).
          03 PT-FCO-ADDRESS-LINE2             PIC X(30).
          03 PT-FCO-CITY                      PIC X(20).
          03 PT-FCO-STATE-CODE                PIC X(2).
          03 PT-FCO-ZIP-CODE                  PIC X(9).
          03 PT-FCO-PHONE                     PIC X(14).
          03 PT-FCO-AGENCY-CODE               PIC X(6).
          03 PT-FCO-AGENT-NAME                PIC X(30).
