******************************************************************
*  COPYBOOK  : GFCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CO
******************************************************************
 01  EN-FCO-ENDORSEMENT.

          03 EN-FCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FCO-FORM-NUMBER               PIC X(10).
          03 EN-FCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-FCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
