******************************************************************
*  COPYBOOK  : GFCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CT
******************************************************************
 01  EN-FCT-ENDORSEMENT.

          03 EN-FCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FCT-FORM-NUMBER               PIC X(10).
          03 EN-FCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-FCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
