******************************************************************
*  COPYBOOK  : GFCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : CT
******************************************************************
 01  PT-FCT-PARTY.

          03 PT-FCT-INSURED-NAME              PIC X(40).
          03 PT-FCT-TAX-ID                    PIC X(11).
          03 PT-FCT-ADDRESS-LINE1             PIC X(30).
          03 PT-FCT-ADDRESS-LINE2             PIC X(30).
          03 PT-FCT-CITY                      PIC X(20).
          03 PT-FCT-STATE-CODE                PIC X(2).
          03 PT-FCT-ZIP-CODE                  PIC X(9).
          03 PT-FCT-PHONE                     PIC X(14).
          03 PT-FCT-AGENCY-CODE               PIC X(6).
          03 PT-FCT-AGENT-NAME                PIC X(30).
