******************************************************************
*  COPYBOOK  : GFDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : DC
******************************************************************
 01  EN-FDC-ENDORSEMENT.

          03 EN-FDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FDC-FORM-NUMBER               PIC X(10).
          03 EN-FDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-FDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
