******************************************************************
*  COPYBOOK  : GFDCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : DC
******************************************************************
 01  PT-FDC-PARTY.

          03 PT-FDC-INSURED-NAME              PIC X(40).
          03 PT-FDC-TAX-ID                    PIC X(11).
          03 PT-FDC-ADDRESS-LINE1             PIC X(30).
          03 PT-FDC-ADDRESS-LINE2             PIC X(30).
          03 PT-FDC-CITY                      PIC X(20).
          03 PT-FDC-STATE-CODE                PIC X(2).
          03 PT-FDC-ZIP-CODE                  PIC X(9).
          03 PT-FDC-PHONE                     PIC X(14).
          03 PT-FDC-AGENCY-CODE               PIC X(6).
          03 PT-FDC-AGENT-NAME                PIC X(30).
