******************************************************************
*  COPYBOOK  : GFDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : DE
******************************************************************
 01  PT-FDE-PARTY.

          03 PT-FDE-INSURED-NAME              PIC X(40).
          03 PT-FDE-TAX-ID                    PIC X(11).
          03 PT-FDE-ADDRESS-LINE1             PIC X(30).
          03 PT-FDE-ADDRESS-LINE2             PIC X(30).
          03 PT-FDE-CITY                      PIC X(20).
          03 PT-FDE-STATE-CODE                PIC X(2).
          03 PT-FDE-ZIP-CODE                  PIC X(9).
          03 PT-FDE-PHONE                     PIC X(14).
          03 PT-FDE-AGENCY-CODE               PIC X(6).
          03 PT-FDE-AGENT-NAME                PIC X(30).
