******************************************************************
*  COPYBOOK  : GFDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : DE
******************************************************************
 01  EN-FDE-ENDORSEMENT.

          03 EN-FDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FDE-FORM-NUMBER               PIC X(10).
          03 EN-FDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-FDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
