******************************************************************
*  COPYBOOK  : GFFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : FL
******************************************************************
 01  EN-FFL-ENDORSEMENT.

          03 EN-FFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FFL-FORM-NUMBER               PIC X(10).
          03 EN-FFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-FFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
