******************************************************************
*  COPYBOOK  : GFFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : FL
******************************************************************
 01  PT-FFL-PARTY.

          03 PT-FFL-INSURED-NAME              PIC X(40).
          03 PT-FFL-TAX-ID                    PIC X(11).
          03 PT-FFL-ADDRESS-LINE1             PIC X(30).
          03 PT-FFL-ADDRESS-LINE2             PIC X(30).
          03 PT-FFL-CITY                      PIC X(20).
          03 PT-FFL-STATE-CODE                PIC X(2).
          03 PT-FFL-ZIP-CODE                  PIC X(9).
          03 PT-FFL-PHONE                     PIC X(14).
          03 PT-FFL-AGENCY-CODE               PIC X(6).
          03 PT-FFL-AGENT-NAME                PIC X(30).
