******************************************************************
*  COPYBOOK  : GFGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : GA
******************************************************************
 01  EN-FGA-ENDORSEMENT.

          03 EN-FGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FGA-FORM-NUMBER               PIC X(10).
          03 EN-FGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
