******************************************************************
*  COPYBOOK  : GFGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : GA
******************************************************************
 01  PT-FGA-PARTY.

          03 PT-FGA-INSURED-NAME              PIC X(40).
          03 PT-FGA-TAX-ID                    PIC X(11).
          03 PT-FGA-ADDRESS-LINE1             PIC X(30).
          03 PT-FGA-ADDRESS-LINE2             PIC X(30).
          03 PT-FGA-CITY                      PIC X(20).
          03 PT-FGA-STATE-CODE                PIC X(2).
          03 PT-FGA-ZIP-CODE                  PIC X(9).
          03 PT-FGA-PHONE                     PIC X(14).
          03 PT-FGA-AGENCY-CODE               PIC X(6).
          03 PT-FGA-AGENT-NAME                PIC X(30).
