******************************************************************
*  COPYBOOK  : GFHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : HI
******************************************************************
 01  EN-FHI-ENDORSEMENT.

          03 EN-FHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FHI-FORM-NUMBER               PIC X(10).
          03 EN-FHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-FHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
