******************************************************************
*  COPYBOOK  : GFHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : HI
******************************************************************
 01  PT-FHI-PARTY.

          03 PT-FHI-INSURED-NAME              PIC X(40).
          03 PT-FHI-TAX-ID                    PIC X(11).
          03 PT-FHI-ADDRESS-LINE1             PIC X(30).
          03 PT-FHI-ADDRESS-LINE2             PIC X(30).
          03 PT-FHI-CITY                      PIC X(20).
          03 PT-FHI-STATE-CODE                PIC X(2).
          03 PT-FHI-ZIP-CODE                  PIC X(9).
          03 PT-FHI-PHONE                     PIC X(14).
          03 PT-FHI-AGENCY-CODE               PIC X(6).
          03 PT-FHI-AGENT-NAME                PIC X(30).
