******************************************************************
*  COPYBOOK  : GFIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IA
******************************************************************
 01  PT-FIA-PARTY.

          03 PT-FIA-INSURED-NAME              PIC X(40).
          03 PT-FIA-TAX-ID                    PIC X(11).
          03 PT-FIA-ADDRESS-LINE1             PIC X(30).
          03 PT-FIA-ADDRESS-LINE2             PIC X(30).
          03 PT-FIA-CITY                      PIC X(20).
          03 PT-FIA-STATE-CODE                PIC X(2).
          03 PT-FIA-ZIP-CODE                  PIC X(9).
          03 PT-FIA-PHONE                     PIC X(14).
          03 PT-FIA-AGENCY-CODE               PIC X(6).
          03 PT-FIA-AGENT-NAME                PIC X(30).
