******************************************************************
*  COPYBOOK  : GFIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IA
******************************************************************
 01  EN-FIA-ENDORSEMENT.

          03 EN-FIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FIA-FORM-NUMBER               PIC X(10).
          03 EN-FIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
