******************************************************************
*  COPYBOOK  : GFIDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ID
******************************************************************
 01  PT-FID-PARTY.

          03 PT-FID-INSURED-NAME              PIC X(40).
          03 PT-FID-TAX-ID                    PIC X(11).
          03 PT-FID-ADDRESS-LINE1             PIC X(30).
          03 PT-FID-ADDRESS-LINE2             PIC X(30).
          03 PT-FID-CITY                      PIC X(20).
          03 PT-FID-STATE-CODE                PIC X(2).
          03 PT-FID-ZIP-CODE                  PIC X(9).
          03 PT-FID-PHONE                     PIC X(14).
          03 PT-FID-AGENCY-CODE               PIC X(6).
          03 PT-FID-AGENT-NAME                PIC X(30).
