******************************************************************
*  COPYBOOK  : GFIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ID
******************************************************************
 01  EN-FID-ENDORSEMENT.

          03 EN-FID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FID-FORM-NUMBER               PIC X(10).
          03 EN-FID-EFFECTIVE-DATE            PIC X(10).
          03 EN-FID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
