******************************************************************
*  COPYBOOK  : GFILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IL
******************************************************************
 01  PT-FIL-PARTY.

          03 PT-FIL-INSURED-NAME              PIC X(40).
          03 PT-FIL-TAX-ID                    PIC X(11).
          03 PT-FIL-ADDRESS-LINE1             PIC X(30).
          03 PT-FIL-ADDRESS-LINE2             PIC X(30).
          03 PT-FIL-CITY                      PIC X(20).
          03 PT-FIL-STATE-CODE                PIC X(2).
          03 PT-FIL-ZIP-CODE                  PIC X(9).
          03 PT-FIL-PHONE                     PIC X(14).
          03 PT-FIL-AGENCY-CODE               PIC X(6).
          03 PT-FIL-AGENT-NAME                PIC X(30).
