******************************************************************
*  COPYBOOK  : GFILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IL
******************************************************************
 01  EN-FIL-ENDORSEMENT.

          03 EN-FIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FIL-FORM-NUMBER               PIC X(10).
          03 EN-FIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-FIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
