******************************************************************
*  COPYBOOK  : GFINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IN
******************************************************************
 01  PT-FIN-PARTY.

          03 PT-FIN-INSURED-NAME              PIC X(40).
          03 PT-FIN-TAX-ID                    PIC X(11).
          03 PT-FIN-ADDRESS-LINE1             PIC X(30).
          03 PT-FIN-ADDRESS-LINE2             PIC X(30).
          03 PT-FIN-CITY                      PIC X(20).
          03 PT-FIN-STATE-CODE                PIC X(2).
          03 PT-FIN-ZIP-CODE                  PIC X(9).
          03 PT-FIN-PHONE                     PIC X(14).
          03 PT-FIN-AGENCY-CODE               PIC X(6).
          03 PT-FIN-AGENT-NAME                PIC X(30).
