******************************************************************
*  COPYBOOK  : GFINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : IN
******************************************************************
 01  EN-FIN-ENDORSEMENT.

          03 EN-FIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FIN-FORM-NUMBER               PIC X(10).
          03 EN-FIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-FIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
