******************************************************************
*  COPYBOOK  : GFKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : KS
******************************************************************
 01  EN-FKS-ENDORSEMENT.

          03 EN-FKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FKS-FORM-NUMBER               PIC X(10).
          03 EN-FKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-FKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
