******************************************************************
*  COPYBOOK  : GFKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : KS
******************************************************************
 01  PT-FKS-PARTY.

          03 PT-FKS-INSURED-NAME              PIC X(40).
          03 PT-FKS-TAX-ID                    PIC X(11).
          03 PT-FKS-ADDRESS-LINE1             PIC X(30).
          03 PT-FKS-ADDRESS-LINE2             PIC X(30).
          03 PT-FKS-CITY                      PIC X(20).
          03 PT-FKS-STATE-CODE                PIC X(2).
          03 PT-FKS-ZIP-CODE                  PIC X(9).
          03 PT-FKS-PHONE                     PIC X(14).
          03 PT-FKS-AGENCY-CODE               PIC X(6).
          03 PT-FKS-AGENT-NAME                PIC X(30).
