******************************************************************
*  COPYBOOK  : GFKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : KY
******************************************************************
 01  PT-FKY-PARTY.

          03 PT-FKY-INSURED-NAME              PIC X(40).
          03 PT-FKY-TAX-ID                    PIC X(11).
          03 PT-FKY-ADDRESS-LINE1             PIC X(30).
          03 PT-FKY-ADDRESS-LINE2             PIC X(30).
          03 PT-FKY-CITY                      PIC X(20).
          03 PT-FKY-STATE-CODE                PIC X(2).
          03 PT-FKY-ZIP-CODE                  PIC X(9).
          03 PT-FKY-PHONE                     PIC X(14).
          03 PT-FKY-AGENCY-CODE               PIC X(6).
          03 PT-FKY-AGENT-NAME                PIC X(30).
