******************************************************************
*  COPYBOOK  : GFKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : KY
******************************************************************
 01  EN-FKY-ENDORSEMENT.

          03 EN-FKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FKY-FORM-NUMBER               PIC X(10).
          03 EN-FKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-FKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
