******************************************************************
*  COPYBOOK  : GFLAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : LA
******************************************************************
 01  PT-FLA-PARTY.

          03 PT-FLA-INSURED-NAME              PIC X(40).
          03 PT-FLA-TAX-ID                    PIC X(11).
          03 PT-FLA-ADDRESS-LINE1             PIC X(30).
          03 PT-FLA-ADDRESS-LINE2             PIC X(30).
          03 PT-FLA-CITY                      PIC X(20).
          03 PT-FLA-STATE-CODE                PIC X(2).
          03 PT-FLA-ZIP-CODE                  PIC X(9).
          03 PT-FLA-PHONE                     PIC X(14).
          03 PT-FLA-AGENCY-CODE               PIC X(6).
          03 PT-FLA-AGENT-NAME                PIC X(30).
