******************************************************************
*  COPYBOOK  : GFLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : LA
******************************************************************
 01  EN-FLA-ENDORSEMENT.

          03 EN-FLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FLA-FORM-NUMBER               PIC X(10).
          03 EN-FLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
