******************************************************************
*  COPYBOOK  : GFMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MA
******************************************************************
 01  EN-FMA-ENDORSEMENT.

          03 EN-FMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMA-FORM-NUMBER               PIC X(10).
          03 EN-FMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
