******************************************************************
*  COPYBOOK  : GFMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MA
******************************************************************
 01  PT-FMA-PARTY.

          03 PT-FMA-INSURED-NAME              PIC X(40).
          03 PT-FMA-TAX-ID                    PIC X(11).
          03 PT-FMA-ADDRESS-LINE1             PIC X(30).
          03 PT-FMA-ADDRESS-LINE2             PIC X(30).
          03 PT-FMA-CITY                      PIC X(20).
          03 PT-FMA-STATE-CODE                PIC X(2).
          03 PT-FMA-ZIP-CODE                  PIC X(9).
          03 PT-FMA-PHONE                     PIC X(14).
          03 PT-FMA-AGENCY-CODE               PIC X(6).
          03 PT-FMA-AGENT-NAME                PIC X(30).
