******************************************************************
*  COPYBOOK  : GFMDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MD
******************************************************************
 01  PT-FMD-PARTY.

          03 PT-FMD-INSURED-NAME              PIC X(40).
          03 PT-FMD-TAX-ID                    PIC X(11).
          03 PT-FMD-ADDRESS-LINE1             PIC X(30).
          03 PT-FMD-ADDRESS-LINE2             PIC X(30).
          03 PT-FMD-CITY                      PIC X(20).
          03 PT-FMD-STATE-CODE                PIC X(2).
          03 PT-FMD-ZIP-CODE                  PIC X(9).
          03 PT-FMD-PHONE                     PIC X(14).
          03 PT-FMD-AGENCY-CODE               PIC X(6).
          03 PT-FMD-AGENT-NAME                PIC X(30).
