******************************************************************
*  COPYBOOK  : GFMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MD
******************************************************************
 01  EN-FMD-ENDORSEMENT.

          03 EN-FMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMD-FORM-NUMBER               PIC X(10).
          03 EN-FMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
