******************************************************************
*  COPYBOOK  : GFMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ME
******************************************************************
 01  EN-FME-ENDORSEMENT.

          03 EN-FME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FME-FORM-NUMBER               PIC X(10).
          03 EN-FME-EFFECTIVE-DATE            PIC X(10).
          03 EN-FME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
