******************************************************************
*  COPYBOOK  : GFMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ME
******************************************************************
 01  PT-FME-PARTY.

          03 PT-FME-INSURED-NAME              PIC X(40).
          03 PT-FME-TAX-ID                    PIC X(11).
          03 PT-FME-ADDRESS-LINE1             PIC X(30).
          03 PT-FME-ADDRESS-LINE2             PIC X(30).
          03 PT-FME-CITY                      PIC X(20).
          03 PT-FME-STATE-CODE                PIC X(2).
          03 PT-FME-ZIP-CODE                  PIC X(9).
          03 PT-FME-PHONE                     PIC X(14).
          03 PT-FME-AGENCY-CODE               PIC X(6).
          03 PT-FME-AGENT-NAME                PIC X(30).
