******************************************************************
*  COPYBOOK  : GFMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MI
******************************************************************
 01  EN-FMI-ENDORSEMENT.

          03 EN-FMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMI-FORM-NUMBER               PIC X(10).
          03 EN-FMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
