******************************************************************
*  COPYBOOK  : GFMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MI
******************************************************************
 01  PT-FMI-PARTY.

          03 PT-FMI-INSURED-NAME              PIC X(40).
          03 PT-FMI-TAX-ID                    PIC X(11).
          03 PT-FMI-ADDRESS-LINE1             PIC X(30).
          03 PT-FMI-ADDRESS-LINE2             PIC X(30).
          03 PT-FMI-CITY                      PIC X(20).
          03 PT-FMI-STATE-CODE                PIC X(2).
          03 PT-FMI-ZIP-CODE                  PIC X(9).
          03 PT-FMI-PHONE                     PIC X(14).
          03 PT-FMI-AGENCY-CODE               PIC X(6).
          03 PT-FMI-AGENT-NAME                PIC X(30).
