******************************************************************
*  COPYBOOK  : GFMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MN
******************************************************************
 01  PT-FMN-PARTY.

          03 PT-FMN-INSURED-NAME              PIC X(40).
          03 PT-FMN-TAX-ID                    PIC X(11).
          03 PT-FMN-ADDRESS-LINE1             PIC X(30).
          03 PT-FMN-ADDRESS-LINE2             PIC X(30).
          03 PT-FMN-CITY                      PIC X(20).
          03 PT-FMN-STATE-CODE                PIC X(2).
          03 PT-FMN-ZIP-CODE                  PIC X(9).
          03 PT-FMN-PHONE                     PIC X(14).
          03 PT-FMN-AGENCY-CODE               PIC X(6).
          03 PT-FMN-AGENT-NAME                PIC X(30).
