******************************************************************
*  COPYBOOK  : GFMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MN
******************************************************************
 01  EN-FMN-ENDORSEMENT.

          03 EN-FMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMN-FORM-NUMBER               PIC X(10).
          03 EN-FMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
