******************************************************************
*  COPYBOOK  : GFMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MO
******************************************************************
 01  EN-FMO-ENDORSEMENT.

          03 EN-FMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMO-FORM-NUMBER               PIC X(10).
          03 EN-FMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
