******************************************************************
*  COPYBOOK  : GFMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MS
******************************************************************
 01  PT-FMS-PARTY.

          03 PT-FMS-INSURED-NAME              PIC X(40).
          03 PT-FMS-TAX-ID                    PIC X(11).
          03 PT-FMS-ADDRESS-LINE1             PIC X(30).
          03 PT-FMS-ADDRESS-LINE2             PIC X(30).
          03 PT-FMS-CITY                      PIC X(20).
          03 PT-FMS-STATE-CODE                PIC X(2).
          03 PT-FMS-ZIP-CODE                  PIC X(9).
          03 PT-FMS-PHONE                     PIC X(14).
          03 PT-FMS-AGENCY-CODE               PIC X(6).
          03 PT-FMS-AGENT-NAME                PIC X(30).
