******************************************************************
*  COPYBOOK  : GFMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MT
******************************************************************
 01  EN-FMT-ENDORSEMENT.

          03 EN-FMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FMT-FORM-NUMBER               PIC X(10).
          03 EN-FMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-FMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
