******************************************************************
*  COPYBOOK  : GFMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : MT
******************************************************************
 01  PT-FMT-PARTY.

          03 PT-FMT-INSURED-NAME              PIC X(40).
          03 PT-FMT-TAX-ID                    PIC X(11).
          03 PT-FMT-ADDRESS-LINE1             PIC X(30).
          03 PT-FMT-ADDRESS-LINE2             PIC X(30).
          03 PT-FMT-CITY                      PIC X(20).
          03 PT-FMT-STATE-CODE                PIC X(2).
          03 PT-FMT-ZIP-CODE                  PIC X(9).
          03 PT-FMT-PHONE                     PIC X(14).
          03 PT-FMT-AGENCY-CODE               PIC X(6).
          03 PT-FMT-AGENT-NAME                PIC X(30).
