******************************************************************
*  COPYBOOK  : GFNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NC
******************************************************************
 01  EN-FNC-ENDORSEMENT.

          03 EN-FNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNC-FORM-NUMBER               PIC X(10).
          03 EN-FNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
