******************************************************************
*  COPYBOOK  : GFNCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NC
******************************************************************
 01  PT-FNC-PARTY.

          03 PT-FNC-INSURED-NAME              PIC X(40).
          03 PT-FNC-TAX-ID                    PIC X(11).
          03 PT-FNC-ADDRESS-LINE1             PIC X(30).
          03 PT-FNC-ADDRESS-LINE2             PIC X(30).
          03 PT-FNC-CITY                      PIC X(20).
          03 PT-FNC-STATE-CODE                PIC X(2).
          03 PT-FNC-ZIP-CODE                  PIC X(9).
          03 PT-FNC-PHONE                     PIC X(14).
          03 PT-FNC-AGENCY-CODE               PIC X(6).
          03 PT-FNC-AGENT-NAME                PIC X(30).
