******************************************************************
*  COPYBOOK  : GFNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ND
******************************************************************
 01  EN-FND-ENDORSEMENT.

          03 EN-FND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FND-FORM-NUMBER               PIC X(10).
          03 EN-FND-EFFECTIVE-DATE            PIC X(10).
          03 EN-FND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
