******************************************************************
*  COPYBOOK  : GFNDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : ND
******************************************************************
 01  PT-FND-PARTY.

          03 PT-FND-INSURED-NAME              PIC X(40).
          03 PT-FND-TAX-ID                    PIC X(11).
          03 PT-FND-ADDRESS-LINE1             PIC X(30).
          03 PT-FND-ADDRESS-LINE2             PIC X(30).
          03 PT-FND-CITY                      PIC X(20).
          03 PT-FND-STATE-CODE                PIC X(2).
          03 PT-FND-ZIP-CODE                  PIC X(9).
          03 PT-FND-PHONE                     PIC X(14).
          03 PT-FND-AGENCY-CODE               PIC X(6).
          03 PT-FND-AGENT-NAME                PIC X(30).
