******************************************************************
*  COPYBOOK  : GFNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NE
******************************************************************
 01  EN-FNE-ENDORSEMENT.

          03 EN-FNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNE-FORM-NUMBER               PIC X(10).
          03 EN-FNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
