******************************************************************
*  COPYBOOK  : GFNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NE
******************************************************************
 01  PT-FNE-PARTY.

          03 PT-FNE-INSURED-NAME              PIC X(40).
          03 PT-FNE-TAX-ID                    PIC X(11).
          03 PT-FNE-ADDRESS-LINE1             PIC X(30).
          03 PT-FNE-ADDRESS-LINE2             PIC X(30).
          03 PT-FNE-CITY                      PIC X(20).
          03 PT-FNE-STATE-CODE                PIC X(2).
          03 PT-FNE-ZIP-CODE                  PIC X(9).
          03 PT-FNE-PHONE                     PIC X(14).
          03 PT-FNE-AGENCY-CODE               PIC X(6).
          03 PT-FNE-AGENT-NAME                PIC X(30).
