******************************************************************
*  COPYBOOK  : GFNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NH
******************************************************************
 01  PT-FNH-PARTY.

          03 PT-FNH-INSURED-NAME              PIC X(40).
          03 PT-FNH-TAX-ID                    PIC X(11).
          03 PT-FNH-ADDRESS-LINE1             PIC X(30).
          03 PT-FNH-ADDRESS-LINE2             PIC X(30).
          03 PT-FNH-CITY                      PIC X(20).
          03 PT-FNH-STATE-CODE                PIC X(2).
          03 PT-FNH-ZIP-CODE                  PIC X(9).
          03 PT-FNH-PHONE                     PIC X(14).
          03 PT-FNH-AGENCY-CODE               PIC X(6).
          03 PT-FNH-AGENT-NAME                PIC X(30).
