******************************************************************
*  COPYBOOK  : GFNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NH
******************************************************************
 01  EN-FNH-ENDORSEMENT.

          03 EN-FNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNH-FORM-NUMBER               PIC X(10).
          03 EN-FNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
