******************************************************************
*  COPYBOOK  : GFNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NJ
******************************************************************
 01  EN-FNJ-ENDORSEMENT.

          03 EN-FNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNJ-FORM-NUMBER               PIC X(10).
          03 EN-FNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
