******************************************************************
*  COPYBOOK  : GFNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NJ
******************************************************************
 01  PT-FNJ-PARTY.

          03 PT-FNJ-INSURED-NAME              PIC X(40).
          03 PT-FNJ-TAX-ID                    PIC X(11).
          03 PT-FNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-FNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-FNJ-CITY                      PIC X(20).
          03 PT-FNJ-STATE-CODE                PIC X(2).
          03 PT-FNJ-ZIP-CODE                  PIC X(9).
          03 PT-FNJ-PHONE                     PIC X(14).
          03 PT-FNJ-AGENCY-CODE               PIC X(6).
          03 PT-FNJ-AGENT-NAME                PIC X(30).
