******************************************************************
*  COPYBOOK  : GFNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NM
******************************************************************
 01  PT-FNM-PARTY.

          03 PT-FNM-INSURED-NAME              PIC X(40).
          03 PT-FNM-TAX-ID                    PIC X(11).
          03 PT-FNM-ADDRESS-LINE1             PIC X(30).
          03 PT-FNM-ADDRESS-LINE2             PIC X(30).
          03 PT-FNM-CITY                      PIC X(20).
          03 PT-FNM-STATE-CODE                PIC X(2).
          03 PT-FNM-ZIP-CODE                  PIC X(9).
          03 PT-FNM-PHONE                     PIC X(14).
          03 PT-FNM-AGENCY-CODE               PIC X(6).
          03 PT-FNM-AGENT-NAME                PIC X(30).
