******************************************************************
*  COPYBOOK  : GFNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NM
******************************************************************
 01  EN-FNM-ENDORSEMENT.

          03 EN-FNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNM-FORM-NUMBER               PIC X(10).
          03 EN-FNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
