******************************************************************
*  COPYBOOK  : GFNVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NV
******************************************************************
 01  PT-FNV-PARTY.

          03 PT-FNV-INSURED-NAME              PIC X(40).
          03 PT-FNV-TAX-ID                    PIC X(11).
          03 PT-FNV-ADDRESS-LINE1             PIC X(30).
          03 PT-FNV-ADDRESS-LINE2             PIC X(30).
          03 PT-FNV-CITY                      PIC X(20).
          03 PT-FNV-STATE-CODE                PIC X(2).
          03 PT-FNV-ZIP-CODE                  PIC X(9).
          03 PT-FNV-PHONE                     PIC X(14).
          03 PT-FNV-AGENCY-CODE               PIC X(6).
          03 PT-FNV-AGENT-NAME                PIC X(30).
