******************************************************************
*  COPYBOOK  : GFNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NV
******************************************************************
 01  EN-FNV-ENDORSEMENT.

          03 EN-FNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNV-FORM-NUMBER               PIC X(10).
          03 EN-FNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
