******************************************************************
*  COPYBOOK  : GFNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NY
******************************************************************
 01  PT-FNY-PARTY.

          03 PT-FNY-INSURED-NAME              PIC X(40).
          03 PT-FNY-TAX-ID                    PIC X(11).
          03 PT-FNY-ADDRESS-LINE1             PIC X(30).
          03 PT-FNY-ADDRESS-LINE2             PIC X(30).
          03 PT-FNY-CITY                      PIC X(20).
          03 PT-FNY-STATE-CODE                PIC X(2).
          03 PT-FNY-ZIP-CODE                  PIC X(9).
          03 PT-FNY-PHONE                     PIC X(14).
          03 PT-FNY-AGENCY-CODE               PIC X(6).
          03 PT-FNY-AGENT-NAME                PIC X(30).
