******************************************************************
*  COPYBOOK  : GFNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : NY
******************************************************************
 01  EN-FNY-ENDORSEMENT.

          03 EN-FNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FNY-FORM-NUMBER               PIC X(10).
          03 EN-FNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-FNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
