******************************************************************
*  COPYBOOK  : GFOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OH
******************************************************************
 01  EN-FOH-ENDORSEMENT.

          03 EN-FOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FOH-FORM-NUMBER               PIC X(10).
          03 EN-FOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-FOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
