******************************************************************
*  COPYBOOK  : GFOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OH
******************************************************************
 01  PT-FOH-PARTY.

          03 PT-FOH-INSURED-NAME              PIC X(40).
          03 PT-FOH-TAX-ID                    PIC X(11).
          03 PT-FOH-ADDRESS-LINE1             PIC X(30).
          03 PT-FOH-ADDRESS-LINE2             PIC X(30).
          03 PT-FOH-CITY                      PIC X(20).
          03 PT-FOH-STATE-CODE                PIC X(2).
          03 PT-FOH-ZIP-CODE                  PIC X(9).
          03 PT-FOH-PHONE                     PIC X(14).
          03 PT-FOH-AGENCY-CODE               PIC X(6).
          03 PT-FOH-AGENT-NAME                PIC X(30).
