******************************************************************
*  COPYBOOK  : GFOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OK
******************************************************************
 01  PT-FOK-PARTY.

          03 PT-FOK-INSURED-NAME              PIC X(40).
          03 PT-FOK-TAX-ID                    PIC X(11).
          03 PT-FOK-ADDRESS-LINE1             PIC X(30).
          03 PT-FOK-ADDRESS-LINE2             PIC X(30).
          03 PT-FOK-CITY                      PIC X(20).
          03 PT-FOK-STATE-CODE                PIC X(2).
          03 PT-FOK-ZIP-CODE                  PIC X(9).
          03 PT-FOK-PHONE                     PIC X(14).
          03 PT-FOK-AGENCY-CODE               PIC X(6).
          03 PT-FOK-AGENT-NAME                PIC X(30).
