******************************************************************
*  COPYBOOK  : GFOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OK
******************************************************************
 01  EN-FOK-ENDORSEMENT.

          03 EN-FOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FOK-FORM-NUMBER               PIC X(10).
          03 EN-FOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-FOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
