******************************************************************
*  COPYBOOK  : GFORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OR
******************************************************************
 01  PT-FOR-PARTY.

          03 PT-FOR-INSURED-NAME              PIC X(40).
          03 PT-FOR-TAX-ID                    PIC X(11).
          03 PT-FOR-ADDRESS-LINE1             PIC X(30).
          03 PT-FOR-ADDRESS-LINE2             PIC X(30).
          03 PT-FOR-CITY                      PIC X(20).
          03 PT-FOR-STATE-CODE                PIC X(2).
          03 PT-FOR-ZIP-CODE                  PIC X(9).
          03 PT-FOR-PHONE                     PIC X(14).
          03 PT-FOR-AGENCY-CODE               PIC X(6).
          03 PT-FOR-AGENT-NAME                PIC X(30).
