******************************************************************
*  COPYBOOK  : GFORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : OR
******************************************************************
 01  EN-FOR-ENDORSEMENT.

          03 EN-FOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FOR-FORM-NUMBER               PIC X(10).
          03 EN-FOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-FOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
