******************************************************************
*  COPYBOOK  : GFPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : PA
******************************************************************
 01  EN-FPA-ENDORSEMENT.

          03 EN-FPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FPA-FORM-NUMBER               PIC X(10).
          03 EN-FPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
