******************************************************************
*  COPYBOOK  : GFRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : RI
******************************************************************
 01  PT-FRI-PARTY.

          03 PT-FRI-INSURED-NAME              PIC X(40).
          03 PT-FRI-TAX-ID                    PIC X(11).
          03 PT-FRI-ADDRESS-LINE1             PIC X(30).
          03 PT-FRI-ADDRESS-LINE2             PIC X(30).
          03 PT-FRI-CITY                      PIC X(20).
          03 PT-FRI-STATE-CODE                PIC X(2).
          03 PT-FRI-ZIP-CODE                  PIC X(9).
          03 PT-FRI-PHONE                     PIC X(14).
          03 PT-FRI-AGENCY-CODE               PIC X(6).
          03 PT-FRI-AGENT-NAME                PIC X(30).
