******************************************************************
*  COPYBOOK  : GFRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : RI
******************************************************************
 01  EN-FRI-ENDORSEMENT.

          03 EN-FRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FRI-FORM-NUMBER               PIC X(10).
          03 EN-FRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-FRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
