******************************************************************
*  COPYBOOK  : GFSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : SC
******************************************************************
 01  PT-FSC-PARTY.

          03 PT-FSC-INSURED-NAME              PIC X(40).
          03 PT-FSC-TAX-ID                    PIC X(11).
          03 PT-FSC-ADDRESS-LINE1             PIC X(30).
          03 PT-FSC-ADDRESS-LINE2             PIC X(30).
          03 PT-FSC-CITY                      PIC X(20).
          03 PT-FSC-STATE-CODE                PIC X(2).
          03 PT-FSC-ZIP-CODE                  PIC X(9).
          03 PT-FSC-PHONE                     PIC X(14).
          03 PT-FSC-AGENCY-CODE               PIC X(6).
          03 PT-FSC-AGENT-NAME                PIC X(30).
