******************************************************************
*  COPYBOOK  : GFSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : SC
******************************************************************
 01  EN-FSC-ENDORSEMENT.

          03 EN-FSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FSC-FORM-NUMBER               PIC X(10).
          03 EN-FSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-FSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
