******************************************************************
*  COPYBOOK  : GFSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : SD
******************************************************************
 01  EN-FSD-ENDORSEMENT.

          03 EN-FSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FSD-FORM-NUMBER               PIC X(10).
          03 EN-FSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-FSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
