******************************************************************
*  COPYBOOK  : GFSDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : SD
******************************************************************
 01  PT-FSD-PARTY.

          03 PT-FSD-INSURED-NAME              PIC X(40).
          03 PT-FSD-TAX-ID                    PIC X(11).
          03 PT-FSD-ADDRESS-LINE1             PIC X(30).
          03 PT-FSD-ADDRESS-LINE2             PIC X(30).
          03 PT-FSD-CITY                      PIC X(20).
          03 PT-FSD-STATE-CODE                PIC X(2).
          03 PT-FSD-ZIP-CODE                  PIC X(9).
          03 PT-FSD-PHONE                     PIC X(14).
          03 PT-FSD-AGENCY-CODE               PIC X(6).
          03 PT-FSD-AGENT-NAME                PIC X(30).
