******************************************************************
*  COPYBOOK  : GFTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : TN
******************************************************************
 01  PT-FTN-PARTY.

          03 PT-FTN-INSURED-NAME              PIC X(40).
          03 PT-FTN-TAX-ID                    PIC X(11).
          03 PT-FTN-ADDRESS-LINE1             PIC X(30).
          03 PT-FTN-ADDRESS-LINE2             PIC X(30).
          03 PT-FTN-CITY                      PIC X(20).
          03 PT-FTN-STATE-CODE                PIC X(2).
          03 PT-FTN-ZIP-CODE                  PIC X(9).
          03 PT-FTN-PHONE                     PIC X(14).
          03 PT-FTN-AGENCY-CODE               PIC X(6).
          03 PT-FTN-AGENT-NAME                PIC X(30).
