******************************************************************
*  COPYBOOK  : GFTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : TN
******************************************************************
 01  EN-FTN-ENDORSEMENT.

          03 EN-FTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FTN-FORM-NUMBER               PIC X(10).
          03 EN-FTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-FTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
