******************************************************************
*  COPYBOOK  : GFTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : TX
******************************************************************
 01  EN-FTX-ENDORSEMENT.

          03 EN-FTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FTX-FORM-NUMBER               PIC X(10).
          03 EN-FTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-FTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
