******************************************************************
*  COPYBOOK  : GFTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : TX
******************************************************************
 01  PT-FTX-PARTY.

          03 PT-FTX-INSURED-NAME              PIC X(40).
          03 PT-FTX-TAX-ID                    PIC X(11).
          03 PT-FTX-ADDRESS-LINE1             PIC X(30).
          03 PT-FTX-ADDRESS-LINE2             PIC X(30).
          03 PT-FTX-CITY                      PIC X(20).
          03 PT-FTX-STATE-CODE                PIC X(2).
          03 PT-FTX-ZIP-CODE                  PIC X(9).
          03 PT-FTX-PHONE                     PIC X(14).
          03 PT-FTX-AGENCY-CODE               PIC X(6).
          03 PT-FTX-AGENT-NAME                PIC X(30).
