******************************************************************
*  COPYBOOK  : GFUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : UT
******************************************************************
 01  PT-FUT-PARTY.

          03 PT-FUT-INSURED-NAME              PIC X(40).
          03 PT-FUT-TAX-ID                    PIC X(11).
          03 PT-FUT-ADDRESS-LINE1             PIC X(30).
          03 PT-FUT-ADDRESS-LINE2             PIC X(30).
          03 PT-FUT-CITY                      PIC X(20).
          03 PT-FUT-STATE-CODE                PIC X(2).
          03 PT-FUT-ZIP-CODE                  PIC X(9).
          03 PT-FUT-PHONE                     PIC X(14).
          03 PT-FUT-AGENCY-CODE               PIC X(6).
          03 PT-FUT-AGENT-NAME                PIC X(30).
