******************************************************************
*  COPYBOOK  : GFUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : UT
******************************************************************
 01  EN-FUT-ENDORSEMENT.

          03 EN-FUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FUT-FORM-NUMBER               PIC X(10).
          03 EN-FUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-FUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
