******************************************************************
*  COPYBOOK  : GFVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : VA
******************************************************************
 01  PT-FVA-PARTY.

          03 PT-FVA-INSURED-NAME              PIC X(40).
          03 PT-FVA-TAX-ID                    PIC X(11).
          03 PT-FVA-ADDRESS-LINE1             PIC X(30).
          03 PT-FVA-ADDRESS-LINE2             PIC X(30).
          03 PT-FVA-CITY                      PIC X(20).
          03 PT-FVA-STATE-CODE                PIC X(2).
          03 PT-FVA-ZIP-CODE                  PIC X(9).
          03 PT-FVA-PHONE                     PIC X(14).
          03 PT-FVA-AGENCY-CODE               PIC X(6).
          03 PT-FVA-AGENT-NAME                PIC X(30).
