******************************************************************
*  COPYBOOK  : GFVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : VA
******************************************************************
 01  EN-FVA-ENDORSEMENT.

          03 EN-FVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FVA-FORM-NUMBER               PIC X(10).
          03 EN-FVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
