******************************************************************
*  COPYBOOK  : GFVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : VT
******************************************************************
 01  PT-FVT-PARTY.

          03 PT-FVT-INSURED-NAME              PIC X(40).
          03 PT-FVT-TAX-ID                    PIC X(11).
          03 PT-FVT-ADDRESS-LINE1             PIC X(30).
          03 PT-FVT-ADDRESS-LINE2             PIC X(30).
          03 PT-FVT-CITY                      PIC X(20).
          03 PT-FVT-STATE-CODE                PIC X(2).
          03 PT-FVT-ZIP-CODE                  PIC X(9).
          03 PT-FVT-PHONE                     PIC X(14).
          03 PT-FVT-AGENCY-CODE               PIC X(6).
          03 PT-FVT-AGENT-NAME                PIC X(30).
