******************************************************************
*  COPYBOOK  : GFVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : VT
******************************************************************
 01  EN-FVT-ENDORSEMENT.

          03 EN-FVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FVT-FORM-NUMBER               PIC X(10).
          03 EN-FVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-FVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
