******************************************************************
*  COPYBOOK  : GFWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WA
******************************************************************
 01  PT-FWA-PARTY.

          03 PT-FWA-INSURED-NAME              PIC X(40).
          03 PT-FWA-TAX-ID                    PIC X(11).
          03 PT-FWA-ADDRESS-LINE1             PIC X(30).
          03 PT-FWA-ADDRESS-LINE2             PIC X(30).
          03 PT-FWA-CITY                      PIC X(20).
          03 PT-FWA-STATE-CODE                PIC X(2).
          03 PT-FWA-ZIP-CODE                  PIC X(9).
          03 PT-FWA-PHONE                     PIC X(14).
          03 PT-FWA-AGENCY-CODE               PIC X(6).
          03 PT-FWA-AGENT-NAME                PIC X(30).
