******************************************************************
*  COPYBOOK  : GFWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WA
******************************************************************
 01  EN-FWA-ENDORSEMENT.

          03 EN-FWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FWA-FORM-NUMBER               PIC X(10).
          03 EN-FWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-FWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
