******************************************************************
*  COPYBOOK  : GFWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WI
******************************************************************
 01  EN-FWI-ENDORSEMENT.

          03 EN-FWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FWI-FORM-NUMBER               PIC X(10).
          03 EN-FWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-FWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
