******************************************************************
*  COPYBOOK  : GFWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WV
******************************************************************
 01  PT-FWV-PARTY.

          03 PT-FWV-INSURED-NAME              PIC X(40).
          03 PT-FWV-TAX-ID                    PIC X(11).
          03 PT-FWV-ADDRESS-LINE1             PIC X(30).
          03 PT-FWV-ADDRESS-LINE2             PIC X(30).
          03 PT-FWV-CITY                      PIC X(20).
          03 PT-FWV-STATE-CODE                PIC X(2).
          03 PT-FWV-ZIP-CODE                  PIC X(9).
          03 PT-FWV-PHONE                     PIC X(14).
          03 PT-FWV-AGENCY-CODE               PIC X(6).
          03 PT-FWV-AGENT-NAME                PIC X(30).
