******************************************************************
*  COPYBOOK  : GFWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WV
******************************************************************
 01  EN-FWV-ENDORSEMENT.

          03 EN-FWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FWV-FORM-NUMBER               PIC X(10).
          03 EN-FWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-FWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
