******************************************************************
*  COPYBOOK  : GFWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WY
******************************************************************
 01  PT-FWY-PARTY.

          03 PT-FWY-INSURED-NAME              PIC X(40).
          03 PT-FWY-TAX-ID                    PIC X(11).
          03 PT-FWY-ADDRESS-LINE1             PIC X(30).
          03 PT-FWY-ADDRESS-LINE2             PIC X(30).
          03 PT-FWY-CITY                      PIC X(20).
          03 PT-FWY-STATE-CODE                PIC X(2).
          03 PT-FWY-ZIP-CODE                  PIC X(9).
          03 PT-FWY-PHONE                     PIC X(14).
          03 PT-FWY-AGENCY-CODE               PIC X(6).
          03 PT-FWY-AGENT-NAME                PIC X(30).
