******************************************************************
*  COPYBOOK  : GFWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Damage to Premises Rented to You (Fire Legal Liability) (FL)
*  STATE     : WY
******************************************************************
 01  EN-FWY-ENDORSEMENT.

          03 EN-FWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-FWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-FWY-FORM-NUMBER               PIC X(10).
          03 EN-FWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-FWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
