******************************************************************
*  COPYBOOK  : GMAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : AK
******************************************************************
 01  EN-MAK-ENDORSEMENT.

          03 EN-MAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MAK-FORM-NUMBER               PIC X(10).
          03 EN-MAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-MAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
