******************************************************************
*  COPYBOOK  : GMALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : AL
******************************************************************
 01  EN-MAL-ENDORSEMENT.

          03 EN-MAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MAL-FORM-NUMBER               PIC X(10).
          03 EN-MAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-MAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
