******************************************************************
*  COPYBOOK  : GMARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : AR
******************************************************************
 01  EN-MAR-ENDORSEMENT.

          03 EN-MAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MAR-FORM-NUMBER               PIC X(10).
          03 EN-MAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-MAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
