******************************************************************
*  COPYBOOK  : GMAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : AZ
******************************************************************
 01  EN-MAZ-ENDORSEMENT.

          03 EN-MAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MAZ-FORM-NUMBER               PIC X(10).
          03 EN-MAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-MAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
