******************************************************************
*  COPYBOOK  : GMCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : CA
******************************************************************
 01  EN-MCA-ENDORSEMENT.

          03 EN-MCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MCA-FORM-NUMBER               PIC X(10).
          03 EN-MCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
