******************************************************************
*  COPYBOOK  : GMCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : CO
******************************************************************
 01  EN-MCO-ENDORSEMENT.

          03 EN-MCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MCO-FORM-NUMBER               PIC X(10).
          03 EN-MCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-MCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
