******************************************************************
*  COPYBOOK  : GMCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : CT
******************************************************************
 01  EN-MCT-ENDORSEMENT.

          03 EN-MCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MCT-FORM-NUMBER               PIC X(10).
          03 EN-MCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-MCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
