******************************************************************
*  COPYBOOK  : GMDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : DC
******************************************************************
 01  EN-MDC-ENDORSEMENT.

          03 EN-MDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MDC-FORM-NUMBER               PIC X(10).
          03 EN-MDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-MDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
