******************************************************************
*  COPYBOOK  : GMDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : DE
******************************************************************
 01  EN-MDE-ENDORSEMENT.

          03 EN-MDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MDE-FORM-NUMBER               PIC X(10).
          03 EN-MDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-MDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
