******************************************************************
*  COPYBOOK  : GMFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : FL
******************************************************************
 01  EN-MFL-ENDORSEMENT.

          03 EN-MFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MFL-FORM-NUMBER               PIC X(10).
          03 EN-MFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-MFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
