******************************************************************
*  COPYBOOK  : GMGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : GA
******************************************************************
 01  EN-MGA-ENDORSEMENT.

          03 EN-MGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MGA-FORM-NUMBER               PIC X(10).
          03 EN-MGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
