******************************************************************
*  COPYBOOK  : GMHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : HI
******************************************************************
 01  EN-MHI-ENDORSEMENT.

          03 EN-MHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MHI-FORM-NUMBER               PIC X(10).
          03 EN-MHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-MHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
