******************************************************************
*  COPYBOOK  : GMIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : IA
******************************************************************
 01  EN-MIA-ENDORSEMENT.

          03 EN-MIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MIA-FORM-NUMBER               PIC X(10).
          03 EN-MIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
