******************************************************************
*  COPYBOOK  : GMIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : ID
******************************************************************
 01  EN-MID-ENDORSEMENT.

          03 EN-MID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MID-FORM-NUMBER               PIC X(10).
          03 EN-MID-EFFECTIVE-DATE            PIC X(10).
          03 EN-MID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
