******************************************************************
*  COPYBOOK  : GMILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : IL
******************************************************************
 01  EN-MIL-ENDORSEMENT.

          03 EN-MIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MIL-FORM-NUMBER               PIC X(10).
          03 EN-MIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-MIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
