******************************************************************
*  COPYBOOK  : GMINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : IN
******************************************************************
 01  EN-MIN-ENDORSEMENT.

          03 EN-MIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MIN-FORM-NUMBER               PIC X(10).
          03 EN-MIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-MIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
