******************************************************************
*  COPYBOOK  : GMKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : KS
******************************************************************
 01  EN-MKS-ENDORSEMENT.

          03 EN-MKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MKS-FORM-NUMBER               PIC X(10).
          03 EN-MKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-MKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
