******************************************************************
*  COPYBOOK  : GMKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : KY
******************************************************************
 01  EN-MKY-ENDORSEMENT.

          03 EN-MKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MKY-FORM-NUMBER               PIC X(10).
          03 EN-MKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-MKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
