******************************************************************
*  COPYBOOK  : GMLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : LA
******************************************************************
 01  EN-MLA-ENDORSEMENT.

          03 EN-MLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MLA-FORM-NUMBER               PIC X(10).
          03 EN-MLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
