******************************************************************
*  COPYBOOK  : GMMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MA
******************************************************************
 01  EN-MMA-ENDORSEMENT.

          03 EN-MMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMA-FORM-NUMBER               PIC X(10).
          03 EN-MMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
