******************************************************************
*  COPYBOOK  : GMMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MD
******************************************************************
 01  EN-MMD-ENDORSEMENT.

          03 EN-MMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMD-FORM-NUMBER               PIC X(10).
          03 EN-MMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
