******************************************************************
*  COPYBOOK  : GMMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : ME
******************************************************************
 01  EN-MME-ENDORSEMENT.

          03 EN-MME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MME-FORM-NUMBER               PIC X(10).
          03 EN-MME-EFFECTIVE-DATE            PIC X(10).
          03 EN-MME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
