******************************************************************
*  COPYBOOK  : GMMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MI
******************************************************************
 01  EN-MMI-ENDORSEMENT.

          03 EN-MMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMI-FORM-NUMBER               PIC X(10).
          03 EN-MMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
