******************************************************************
*  COPYBOOK  : GMMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MN
******************************************************************
 01  EN-MMN-ENDORSEMENT.

          03 EN-MMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMN-FORM-NUMBER               PIC X(10).
          03 EN-MMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
