******************************************************************
*  COPYBOOK  : GMMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MO
******************************************************************
 01  EN-MMO-ENDORSEMENT.

          03 EN-MMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMO-FORM-NUMBER               PIC X(10).
          03 EN-MMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
