******************************************************************
*  COPYBOOK  : GMMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MS
******************************************************************
 01  EN-MMS-ENDORSEMENT.

          03 EN-MMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMS-FORM-NUMBER               PIC X(10).
          03 EN-MMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
