******************************************************************
*  COPYBOOK  : GMMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : MT
******************************************************************
 01  EN-MMT-ENDORSEMENT.

          03 EN-MMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MMT-FORM-NUMBER               PIC X(10).
          03 EN-MMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-MMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
