******************************************************************
*  COPYBOOK  : GMNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NC
******************************************************************
 01  EN-MNC-ENDORSEMENT.

          03 EN-MNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNC-FORM-NUMBER               PIC X(10).
          03 EN-MNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
