******************************************************************
*  COPYBOOK  : GMNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : ND
******************************************************************
 01  EN-MND-ENDORSEMENT.

          03 EN-MND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MND-FORM-NUMBER               PIC X(10).
          03 EN-MND-EFFECTIVE-DATE            PIC X(10).
          03 EN-MND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
