******************************************************************
*  COPYBOOK  : GMNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NE
******************************************************************
 01  EN-MNE-ENDORSEMENT.

          03 EN-MNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNE-FORM-NUMBER               PIC X(10).
          03 EN-MNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
