******************************************************************
*  COPYBOOK  : GMNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NH
******************************************************************
 01  EN-MNH-ENDORSEMENT.

          03 EN-MNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNH-FORM-NUMBER               PIC X(10).
          03 EN-MNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
