******************************************************************
*  COPYBOOK  : GMNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NM
******************************************************************
 01  EN-MNM-ENDORSEMENT.

          03 EN-MNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNM-FORM-NUMBER               PIC X(10).
          03 EN-MNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
