******************************************************************
*  COPYBOOK  : GMNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NV
******************************************************************
 01  EN-MNV-ENDORSEMENT.

          03 EN-MNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNV-FORM-NUMBER               PIC X(10).
          03 EN-MNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
