******************************************************************
*  COPYBOOK  : GMNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : NY
******************************************************************
 01  EN-MNY-ENDORSEMENT.

          03 EN-MNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MNY-FORM-NUMBER               PIC X(10).
          03 EN-MNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-MNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
