******************************************************************
*  COPYBOOK  : GMORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : OR
******************************************************************
 01  EN-MOR-ENDORSEMENT.

          03 EN-MOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MOR-FORM-NUMBER               PIC X(10).
          03 EN-MOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-MOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
