******************************************************************
*  COPYBOOK  : GMPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : PA
******************************************************************
 01  EN-MPA-ENDORSEMENT.

          03 EN-MPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MPA-FORM-NUMBER               PIC X(10).
          03 EN-MPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
