******************************************************************
*  COPYBOOK  : GMRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : RI
******************************************************************
 01  EN-MRI-ENDORSEMENT.

          03 EN-MRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MRI-FORM-NUMBER               PIC X(10).
          03 EN-MRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-MRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
