******************************************************************
*  COPYBOOK  : GMSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : SC
******************************************************************
 01  EN-MSC-ENDORSEMENT.

          03 EN-MSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MSC-FORM-NUMBER               PIC X(10).
          03 EN-MSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-MSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
