******************************************************************
*  COPYBOOK  : GMSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : SD
******************************************************************
 01  EN-MSD-ENDORSEMENT.

          03 EN-MSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MSD-FORM-NUMBER               PIC X(10).
          03 EN-MSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-MSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
