******************************************************************
*  COPYBOOK  : GMTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : TN
******************************************************************
 01  EN-MTN-ENDORSEMENT.

          03 EN-MTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MTN-FORM-NUMBER               PIC X(10).
          03 EN-MTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-MTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
