******************************************************************
*  COPYBOOK  : GMTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : TX
******************************************************************
 01  EN-MTX-ENDORSEMENT.

          03 EN-MTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MTX-FORM-NUMBER               PIC X(10).
          03 EN-MTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-MTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
