******************************************************************
*  COPYBOOK  : GMUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : UT
******************************************************************
 01  EN-MUT-ENDORSEMENT.

          03 EN-MUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MUT-FORM-NUMBER               PIC X(10).
          03 EN-MUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-MUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
