******************************************************************
*  COPYBOOK  : GMVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : VT
******************************************************************
 01  EN-MVT-ENDORSEMENT.

          03 EN-MVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MVT-FORM-NUMBER               PIC X(10).
          03 EN-MVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-MVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
