******************************************************************
*  COPYBOOK  : GMWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : WA
******************************************************************
 01  EN-MWA-ENDORSEMENT.

          03 EN-MWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MWA-FORM-NUMBER               PIC X(10).
          03 EN-MWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-MWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
