******************************************************************
*  COPYBOOK  : GMWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : WI
******************************************************************
 01  EN-MWI-ENDORSEMENT.

          03 EN-MWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MWI-FORM-NUMBER               PIC X(10).
          03 EN-MWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-MWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
