******************************************************************
*  COPYBOOK  : GMWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : WV
******************************************************************
 01  EN-MWV-ENDORSEMENT.

          03 EN-MWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MWV-FORM-NUMBER               PIC X(10).
          03 EN-MWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-MWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
