******************************************************************
*  COPYBOOK  : GMWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Medical Payments (MP)
*  STATE     : WY
******************************************************************
 01  EN-MWY-ENDORSEMENT.

          03 EN-MWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-MWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-MWY-FORM-NUMBER               PIC X(10).
          03 EN-MWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-MWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
