******************************************************************
*  COPYBOOK  : GAAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AK
******************************************************************
 01  EN-AAK-ENDORSEMENT.

          03 EN-AAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AAK-FORM-NUMBER               PIC X(10).
          03 EN-AAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-AAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
