******************************************************************
*  COPYBOOK  : GAAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AK
******************************************************************
 01  PT-AAK-PARTY.

          03 PT-AAK-INSURED-NAME              PIC X(40).
          03 PT-AAK-TAX-ID                    PIC X(11).
          03 PT-AAK-ADDRESS-LINE1             PIC X(30).
          03 PT-AAK-ADDRESS-LINE2             PIC X(30).
          03 PT-AAK-CITY                      PIC X(20).
          03 PT-AAK-STATE-CODE                PIC X(2).
          03 PT-AAK-ZIP-CODE                  PIC X(9).
          03 PT-AAK-PHONE                     PIC X(14).
          03 PT-AAK-AGENCY-CODE               PIC X(6).
          03 PT-AAK-AGENT-NAME                PIC X(30).
