******************************************************************
*  COPYBOOK  : GAALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AL
******************************************************************
 01  PT-AAL-PARTY.

          03 PT-AAL-INSURED-NAME              PIC X(40).
          03 PT-AAL-TAX-ID                    PIC X(11).
          03 PT-AAL-ADDRESS-LINE1             PIC X(30).
          03 PT-AAL-ADDRESS-LINE2             PIC X(30).
          03 PT-AAL-CITY                      PIC X(20).
          03 PT-AAL-STATE-CODE                PIC X(2).
          03 PT-AAL-ZIP-CODE                  PIC X(9).
          03 PT-AAL-PHONE                     PIC X(14).
          03 PT-AAL-AGENCY-CODE               PIC X(6).
          03 PT-AAL-AGENT-NAME                PIC X(30).
