******************************************************************
*  COPYBOOK  : GAALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AL
******************************************************************
 01  EN-AAL-ENDORSEMENT.

          03 EN-AAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AAL-FORM-NUMBER               PIC X(10).
          03 EN-AAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-AAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
