******************************************************************
*  COPYBOOK  : GAARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AR
******************************************************************
 01  PT-AAR-PARTY.

          03 PT-AAR-INSURED-NAME              PIC X(40).
          03 PT-AAR-TAX-ID                    PIC X(11).
          03 PT-AAR-ADDRESS-LINE1             PIC X(30).
          03 PT-AAR-ADDRESS-LINE2             PIC X(30).
          03 PT-AAR-CITY                      PIC X(20).
          03 PT-AAR-STATE-CODE                PIC X(2).
          03 PT-AAR-ZIP-CODE                  PIC X(9).
          03 PT-AAR-PHONE                     PIC X(14).
          03 PT-AAR-AGENCY-CODE               PIC X(6).
          03 PT-AAR-AGENT-NAME                PIC X(30).
