******************************************************************
*  COPYBOOK  : GAARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AR
******************************************************************
 01  EN-AAR-ENDORSEMENT.

          03 EN-AAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AAR-FORM-NUMBER               PIC X(10).
          03 EN-AAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-AAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
