******************************************************************
*  COPYBOOK  : GAAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AZ
******************************************************************
 01  PT-AAZ-PARTY.

          03 PT-AAZ-INSURED-NAME              PIC X(40).
          03 PT-AAZ-TAX-ID                    PIC X(11).
          03 PT-AAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-AAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-AAZ-CITY                      PIC X(20).
          03 PT-AAZ-STATE-CODE                PIC X(2).
          03 PT-AAZ-ZIP-CODE                  PIC X(9).
          03 PT-AAZ-PHONE                     PIC X(14).
          03 PT-AAZ-AGENCY-CODE               PIC X(6).
          03 PT-AAZ-AGENT-NAME                PIC X(30).
