******************************************************************
*  COPYBOOK  : GAAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : AZ
******************************************************************
 01  EN-AAZ-ENDORSEMENT.

          03 EN-AAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AAZ-FORM-NUMBER               PIC X(10).
          03 EN-AAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-AAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
