******************************************************************
*  COPYBOOK  : GACAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : CA
******************************************************************
 01  EN-ACA-ENDORSEMENT.

          03 EN-ACA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ACA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ACA-FORM-NUMBER               PIC X(10).
          03 EN-ACA-EFFECTIVE-DATE            PIC X(10).
          03 EN-ACA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
