******************************************************************
*  COPYBOOK  : GACOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : CO
******************************************************************
 01  EN-ACO-ENDORSEMENT.

          03 EN-ACO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ACO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ACO-FORM-NUMBER               PIC X(10).
          03 EN-ACO-EFFECTIVE-DATE            PIC X(10).
          03 EN-ACO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
