******************************************************************
*  COPYBOOK  : GACOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : CO
******************************************************************
 01  PT-ACO-PARTY.

          03 PT-ACO-INSURED-NAME              PIC X(40).
          03 PT-ACO-TAX-ID                    PIC X(11).
          03 PT-ACO-ADDRESS-LINE1             PIC X(30).
          03 PT-ACO-ADDRESS-LINE2             PIC X(30).
          03 PT-ACO-CITY                      PIC X(20).
          03 PT-ACO-STATE-CODE                PIC X(2).
          03 PT-ACO-ZIP-CODE                  PIC X(9).
          03 PT-ACO-PHONE                     PIC X(14).
          03 PT-ACO-AGENCY-CODE               PIC X(6).
          03 PT-ACO-AGENT-NAME                PIC X(30).
