******************************************************************
*  COPYBOOK  : GACTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : CT
******************************************************************
 01  EN-ACT-ENDORSEMENT.

          03 EN-ACT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ACT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ACT-FORM-NUMBER               PIC X(10).
          03 EN-ACT-EFFECTIVE-DATE            PIC X(10).
          03 EN-ACT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
