******************************************************************
*  COPYBOOK  : GACTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : CT
******************************************************************
 01  PT-ACT-PARTY.

          03 PT-ACT-INSURED-NAME              PIC X(40).
          03 PT-ACT-TAX-ID                    PIC X(11).
          03 PT-ACT-ADDRESS-LINE1             PIC X(30).
          03 PT-ACT-ADDRESS-LINE2             PIC X(30).
          03 PT-ACT-CITY                      PIC X(20).
          03 PT-ACT-STATE-CODE                PIC X(2).
          03 PT-ACT-ZIP-CODE                  PIC X(9).
          03 PT-ACT-PHONE                     PIC X(14).
          03 PT-ACT-AGENCY-CODE               PIC X(6).
          03 PT-ACT-AGENT-NAME                PIC X(30).
