******************************************************************
*  COPYBOOK  : GADCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : DC
******************************************************************
 01  EN-ADC-ENDORSEMENT.

          03 EN-ADC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ADC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ADC-FORM-NUMBER               PIC X(10).
          03 EN-ADC-EFFECTIVE-DATE            PIC X(10).
          03 EN-ADC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
