******************************************************************
*  COPYBOOK  : GADEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : DE
******************************************************************
 01  PT-ADE-PARTY.

          03 PT-ADE-INSURED-NAME              PIC X(40).
          03 PT-ADE-TAX-ID                    PIC X(11).
          03 PT-ADE-ADDRESS-LINE1             PIC X(30).
          03 PT-ADE-ADDRESS-LINE2             PIC X(30).
          03 PT-ADE-CITY                      PIC X(20).
          03 PT-ADE-STATE-CODE                PIC X(2).
          03 PT-ADE-ZIP-CODE                  PIC X(9).
          03 PT-ADE-PHONE                     PIC X(14).
          03 PT-ADE-AGENCY-CODE               PIC X(6).
          03 PT-ADE-AGENT-NAME                PIC X(30).
