******************************************************************
*  COPYBOOK  : GADEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : DE
******************************************************************
 01  EN-ADE-ENDORSEMENT.

          03 EN-ADE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ADE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ADE-FORM-NUMBER               PIC X(10).
          03 EN-ADE-EFFECTIVE-DATE            PIC X(10).
          03 EN-ADE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
