******************************************************************
*  COPYBOOK  : GAFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : FL
******************************************************************
 01  PT-AFL-PARTY.

          03 PT-AFL-INSURED-NAME              PIC X(40).
          03 PT-AFL-TAX-ID                    PIC X(11).
          03 PT-AFL-ADDRESS-LINE1             PIC X(30).
          03 PT-AFL-ADDRESS-LINE2             PIC X(30).
          03 PT-AFL-CITY                      PIC X(20).
          03 PT-AFL-STATE-CODE                PIC X(2).
          03 PT-AFL-ZIP-CODE                  PIC X(9).
          03 PT-AFL-PHONE                     PIC X(14).
          03 PT-AFL-AGENCY-CODE               PIC X(6).
          03 PT-AFL-AGENT-NAME                PIC X(30).
