******************************************************************
*  COPYBOOK  : GAFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : FL
******************************************************************
 01  EN-AFL-ENDORSEMENT.

          03 EN-AFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AFL-FORM-NUMBER               PIC X(10).
          03 EN-AFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-AFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
