******************************************************************
*  COPYBOOK  : GAGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : GA
******************************************************************
 01  PT-AGA-PARTY.

          03 PT-AGA-INSURED-NAME              PIC X(40).
          03 PT-AGA-TAX-ID                    PIC X(11).
          03 PT-AGA-ADDRESS-LINE1             PIC X(30).
          03 PT-AGA-ADDRESS-LINE2             PIC X(30).
          03 PT-AGA-CITY                      PIC X(20).
          03 PT-AGA-STATE-CODE                PIC X(2).
          03 PT-AGA-ZIP-CODE                  PIC X(9).
          03 PT-AGA-PHONE                     PIC X(14).
          03 PT-AGA-AGENCY-CODE               PIC X(6).
          03 PT-AGA-AGENT-NAME                PIC X(30).
