******************************************************************
*  COPYBOOK  : GAGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : GA
******************************************************************
 01  EN-AGA-ENDORSEMENT.

          03 EN-AGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AGA-FORM-NUMBER               PIC X(10).
          03 EN-AGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-AGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
