******************************************************************
*  COPYBOOK  : GAHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : HI
******************************************************************
 01  EN-AHI-ENDORSEMENT.

          03 EN-AHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AHI-FORM-NUMBER               PIC X(10).
          03 EN-AHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-AHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
