******************************************************************
*  COPYBOOK  : GAHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : HI
******************************************************************
 01  PT-AHI-PARTY.

          03 PT-AHI-INSURED-NAME              PIC X(40).
          03 PT-AHI-TAX-ID                    PIC X(11).
          03 PT-AHI-ADDRESS-LINE1             PIC X(30).
          03 PT-AHI-ADDRESS-LINE2             PIC X(30).
          03 PT-AHI-CITY                      PIC X(20).
          03 PT-AHI-STATE-CODE                PIC X(2).
          03 PT-AHI-ZIP-CODE                  PIC X(9).
          03 PT-AHI-PHONE                     PIC X(14).
          03 PT-AHI-AGENCY-CODE               PIC X(6).
          03 PT-AHI-AGENT-NAME                PIC X(30).
