******************************************************************
*  COPYBOOK  : GAIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : IA
******************************************************************
 01  EN-AIA-ENDORSEMENT.

          03 EN-AIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AIA-FORM-NUMBER               PIC X(10).
          03 EN-AIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-AIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
