******************************************************************
*  COPYBOOK  : GAIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : IA
******************************************************************
 01  PT-AIA-PARTY.

          03 PT-AIA-INSURED-NAME              PIC X(40).
          03 PT-AIA-TAX-ID                    PIC X(11).
          03 PT-AIA-ADDRESS-LINE1             PIC X(30).
          03 PT-AIA-ADDRESS-LINE2             PIC X(30).
          03 PT-AIA-CITY                      PIC X(20).
          03 PT-AIA-STATE-CODE                PIC X(2).
          03 PT-AIA-ZIP-CODE                  PIC X(9).
          03 PT-AIA-PHONE                     PIC X(14).
          03 PT-AIA-AGENCY-CODE               PIC X(6).
          03 PT-AIA-AGENT-NAME                PIC X(30).
