******************************************************************
*  COPYBOOK  : GAIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : ID
******************************************************************
 01  EN-AID-ENDORSEMENT.

          03 EN-AID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AID-FORM-NUMBER               PIC X(10).
          03 EN-AID-EFFECTIVE-DATE            PIC X(10).
          03 EN-AID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
