******************************************************************
*  COPYBOOK  : GAILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : IL
******************************************************************
 01  EN-AIL-ENDORSEMENT.

          03 EN-AIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AIL-FORM-NUMBER               PIC X(10).
          03 EN-AIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-AIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
