******************************************************************
*  COPYBOOK  : GAILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : IL
******************************************************************
 01  PT-AIL-PARTY.

          03 PT-AIL-INSURED-NAME              PIC X(40).
          03 PT-AIL-TAX-ID                    PIC X(11).
          03 PT-AIL-ADDRESS-LINE1             PIC X(30).
          03 PT-AIL-ADDRESS-LINE2             PIC X(30).
          03 PT-AIL-CITY                      PIC X(20).
          03 PT-AIL-STATE-CODE                PIC X(2).
          03 PT-AIL-ZIP-CODE                  PIC X(9).
          03 PT-AIL-PHONE                     PIC X(14).
          03 PT-AIL-AGENCY-CODE               PIC X(6).
          03 PT-AIL-AGENT-NAME                PIC X(30).
