******************************************************************
*  COPYBOOK  : GAINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : IN
******************************************************************
 01  EN-AIN-ENDORSEMENT.

          03 EN-AIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AIN-FORM-NUMBER               PIC X(10).
          03 EN-AIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-AIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
