******************************************************************
*  COPYBOOK  : GAKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : KS
******************************************************************
 01  EN-AKS-ENDORSEMENT.

          03 EN-AKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AKS-FORM-NUMBER               PIC X(10).
          03 EN-AKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-AKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
