******************************************************************
*  COPYBOOK  : GAKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : KS
******************************************************************
 01  PT-AKS-PARTY.

          03 PT-AKS-INSURED-NAME              PIC X(40).
          03 PT-AKS-TAX-ID                    PIC X(11).
          03 PT-AKS-ADDRESS-LINE1             PIC X(30).
          03 PT-AKS-ADDRESS-LINE2             PIC X(30).
          03 PT-AKS-CITY                      PIC X(20).
          03 PT-AKS-STATE-CODE                PIC X(2).
          03 PT-AKS-ZIP-CODE                  PIC X(9).
          03 PT-AKS-PHONE                     PIC X(14).
          03 PT-AKS-AGENCY-CODE               PIC X(6).
          03 PT-AKS-AGENT-NAME                PIC X(30).
