******************************************************************
*  COPYBOOK  : GAKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : KY
******************************************************************
 01  EN-AKY-ENDORSEMENT.

          03 EN-AKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AKY-FORM-NUMBER               PIC X(10).
          03 EN-AKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-AKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
