******************************************************************
*  COPYBOOK  : GAKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : KY
******************************************************************
 01  PT-AKY-PARTY.

          03 PT-AKY-INSURED-NAME              PIC X(40).
          03 PT-AKY-TAX-ID                    PIC X(11).
          03 PT-AKY-ADDRESS-LINE1             PIC X(30).
          03 PT-AKY-ADDRESS-LINE2             PIC X(30).
          03 PT-AKY-CITY                      PIC X(20).
          03 PT-AKY-STATE-CODE                PIC X(2).
          03 PT-AKY-ZIP-CODE                  PIC X(9).
          03 PT-AKY-PHONE                     PIC X(14).
          03 PT-AKY-AGENCY-CODE               PIC X(6).
          03 PT-AKY-AGENT-NAME                PIC X(30).
