******************************************************************
*  COPYBOOK  : GALAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : LA
******************************************************************
 01  PT-ALA-PARTY.

          03 PT-ALA-INSURED-NAME              PIC X(40).
          03 PT-ALA-TAX-ID                    PIC X(11).
          03 PT-ALA-ADDRESS-LINE1             PIC X(30).
          03 PT-ALA-ADDRESS-LINE2             PIC X(30).
          03 PT-ALA-CITY                      PIC X(20).
          03 PT-ALA-STATE-CODE                PIC X(2).
          03 PT-ALA-ZIP-CODE                  PIC X(9).
          03 PT-ALA-PHONE                     PIC X(14).
          03 PT-ALA-AGENCY-CODE               PIC X(6).
          03 PT-ALA-AGENT-NAME                PIC X(30).
