******************************************************************
*  COPYBOOK  : GALAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : LA
******************************************************************
 01  EN-ALA-ENDORSEMENT.

          03 EN-ALA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ALA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ALA-FORM-NUMBER               PIC X(10).
          03 EN-ALA-EFFECTIVE-DATE            PIC X(10).
          03 EN-ALA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
