******************************************************************
*  COPYBOOK  : GAMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MA
******************************************************************
 01  PT-AMA-PARTY.

          03 PT-AMA-INSURED-NAME              PIC X(40).
          03 PT-AMA-TAX-ID                    PIC X(11).
          03 PT-AMA-ADDRESS-LINE1             PIC X(30).
          03 PT-AMA-ADDRESS-LINE2             PIC X(30).
          03 PT-AMA-CITY                      PIC X(20).
          03 PT-AMA-STATE-CODE                PIC X(2).
          03 PT-AMA-ZIP-CODE                  PIC X(9).
          03 PT-AMA-PHONE                     PIC X(14).
          03 PT-AMA-AGENCY-CODE               PIC X(6).
          03 PT-AMA-AGENT-NAME                PIC X(30).
