******************************************************************
*  COPYBOOK  : GAMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MA
******************************************************************
 01  EN-AMA-ENDORSEMENT.

          03 EN-AMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMA-FORM-NUMBER               PIC X(10).
          03 EN-AMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
