******************************************************************
*  COPYBOOK  : GAMDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MD
******************************************************************
 01  PT-AMD-PARTY.

          03 PT-AMD-INSURED-NAME              PIC X(40).
          03 PT-AMD-TAX-ID                    PIC X(11).
          03 PT-AMD-ADDRESS-LINE1             PIC X(30).
          03 PT-AMD-ADDRESS-LINE2             PIC X(30).
          03 PT-AMD-CITY                      PIC X(20).
          03 PT-AMD-STATE-CODE                PIC X(2).
          03 PT-AMD-ZIP-CODE                  PIC X(9).
          03 PT-AMD-PHONE                     PIC X(14).
          03 PT-AMD-AGENCY-CODE               PIC X(6).
          03 PT-AMD-AGENT-NAME                PIC X(30).
