******************************************************************
*  COPYBOOK  : GAMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MD
******************************************************************
 01  EN-AMD-ENDORSEMENT.

          03 EN-AMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMD-FORM-NUMBER               PIC X(10).
          03 EN-AMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
