******************************************************************
*  COPYBOOK  : GAMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : ME
******************************************************************
 01  EN-AME-ENDORSEMENT.

          03 EN-AME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AME-FORM-NUMBER               PIC X(10).
          03 EN-AME-EFFECTIVE-DATE            PIC X(10).
          03 EN-AME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
