******************************************************************
*  COPYBOOK  : GAMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : ME
******************************************************************
 01  PT-AME-PARTY.

          03 PT-AME-INSURED-NAME              PIC X(40).
          03 PT-AME-TAX-ID                    PIC X(11).
          03 PT-AME-ADDRESS-LINE1             PIC X(30).
          03 PT-AME-ADDRESS-LINE2             PIC X(30).
          03 PT-AME-CITY                      PIC X(20).
          03 PT-AME-STATE-CODE                PIC X(2).
          03 PT-AME-ZIP-CODE                  PIC X(9).
          03 PT-AME-PHONE                     PIC X(14).
          03 PT-AME-AGENCY-CODE               PIC X(6).
          03 PT-AME-AGENT-NAME                PIC X(30).
