******************************************************************
*  COPYBOOK  : GAMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MI
******************************************************************
 01  EN-AMI-ENDORSEMENT.

          03 EN-AMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMI-FORM-NUMBER               PIC X(10).
          03 EN-AMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
