******************************************************************
*  COPYBOOK  : GAMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MI
******************************************************************
 01  PT-AMI-PARTY.

          03 PT-AMI-INSURED-NAME              PIC X(40).
          03 PT-AMI-TAX-ID                    PIC X(11).
          03 PT-AMI-ADDRESS-LINE1             PIC X(30).
          03 PT-AMI-ADDRESS-LINE2             PIC X(30).
          03 PT-AMI-CITY                      PIC X(20).
          03 PT-AMI-STATE-CODE                PIC X(2).
          03 PT-AMI-ZIP-CODE                  PIC X(9).
          03 PT-AMI-PHONE                     PIC X(14).
          03 PT-AMI-AGENCY-CODE               PIC X(6).
          03 PT-AMI-AGENT-NAME                PIC X(30).
