******************************************************************
*  COPYBOOK  : GAMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MN
******************************************************************
 01  PT-AMN-PARTY.

          03 PT-AMN-INSURED-NAME              PIC X(40).
          03 PT-AMN-TAX-ID                    PIC X(11).
          03 PT-AMN-ADDRESS-LINE1             PIC X(30).
          03 PT-AMN-ADDRESS-LINE2             PIC X(30).
          03 PT-AMN-CITY                      PIC X(20).
          03 PT-AMN-STATE-CODE                PIC X(2).
          03 PT-AMN-ZIP-CODE                  PIC X(9).
          03 PT-AMN-PHONE                     PIC X(14).
          03 PT-AMN-AGENCY-CODE               PIC X(6).
          03 PT-AMN-AGENT-NAME                PIC X(30).
