******************************************************************
*  COPYBOOK  : GAMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MN
******************************************************************
 01  EN-AMN-ENDORSEMENT.

          03 EN-AMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMN-FORM-NUMBER               PIC X(10).
          03 EN-AMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
