******************************************************************
*  COPYBOOK  : GAMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MO
******************************************************************
 01  PT-AMO-PARTY.

          03 PT-AMO-INSURED-NAME              PIC X(40).
          03 PT-AMO-TAX-ID                    PIC X(11).
          03 PT-AMO-ADDRESS-LINE1             PIC X(30).
          03 PT-AMO-ADDRESS-LINE2             PIC X(30).
          03 PT-AMO-CITY                      PIC X(20).
          03 PT-AMO-STATE-CODE                PIC X(2).
          03 PT-AMO-ZIP-CODE                  PIC X(9).
          03 PT-AMO-PHONE                     PIC X(14).
          03 PT-AMO-AGENCY-CODE               PIC X(6).
          03 PT-AMO-AGENT-NAME                PIC X(30).
