******************************************************************
*  COPYBOOK  : GAMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MO
******************************************************************
 01  EN-AMO-ENDORSEMENT.

          03 EN-AMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMO-FORM-NUMBER               PIC X(10).
          03 EN-AMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
