******************************************************************
*  COPYBOOK  : GAMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MS
******************************************************************
 01  PT-AMS-PARTY.

          03 PT-AMS-INSURED-NAME              PIC X(40).
          03 PT-AMS-TAX-ID                    PIC X(11).
          03 PT-AMS-ADDRESS-LINE1             PIC X(30).
          03 PT-AMS-ADDRESS-LINE2             PIC X(30).
          03 PT-AMS-CITY                      PIC X(20).
          03 PT-AMS-STATE-CODE                PIC X(2).
          03 PT-AMS-ZIP-CODE                  PIC X(9).
          03 PT-AMS-PHONE                     PIC X(14).
          03 PT-AMS-AGENCY-CODE               PIC X(6).
          03 PT-AMS-AGENT-NAME                PIC X(30).
