******************************************************************
*  COPYBOOK  : GAMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MS
******************************************************************
 01  EN-AMS-ENDORSEMENT.

          03 EN-AMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMS-FORM-NUMBER               PIC X(10).
          03 EN-AMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
