******************************************************************
*  COPYBOOK  : GAMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MT
******************************************************************
 01  EN-AMT-ENDORSEMENT.

          03 EN-AMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AMT-FORM-NUMBER               PIC X(10).
          03 EN-AMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-AMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
