******************************************************************
*  COPYBOOK  : GAMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : MT
******************************************************************
 01  PT-AMT-PARTY.

          03 PT-AMT-INSURED-NAME              PIC X(40).
          03 PT-AMT-TAX-ID                    PIC X(11).
          03 PT-AMT-ADDRESS-LINE1             PIC X(30).
          03 PT-AMT-ADDRESS-LINE2             PIC X(30).
          03 PT-AMT-CITY                      PIC X(20).
          03 PT-AMT-STATE-CODE                PIC X(2).
          03 PT-AMT-ZIP-CODE                  PIC X(9).
          03 PT-AMT-PHONE                     PIC X(14).
          03 PT-AMT-AGENCY-CODE               PIC X(6).
          03 PT-AMT-AGENT-NAME                PIC X(30).
