******************************************************************
*  COPYBOOK  : GANCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NC
******************************************************************
 01  PT-ANC-PARTY.

          03 PT-ANC-INSURED-NAME              PIC X(40).
          03 PT-ANC-TAX-ID                    PIC X(11).
          03 PT-ANC-ADDRESS-LINE1             PIC X(30).
          03 PT-ANC-ADDRESS-LINE2             PIC X(30).
          03 PT-ANC-CITY                      PIC X(20).
          03 PT-ANC-STATE-CODE                PIC X(2).
          03 PT-ANC-ZIP-CODE                  PIC X(9).
          03 PT-ANC-PHONE                     PIC X(14).
          03 PT-ANC-AGENCY-CODE               PIC X(6).
          03 PT-ANC-AGENT-NAME                PIC X(30).
