******************************************************************
*  COPYBOOK  : GANCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NC
******************************************************************
 01  EN-ANC-ENDORSEMENT.

          03 EN-ANC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANC-FORM-NUMBER               PIC X(10).
          03 EN-ANC-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
