******************************************************************
*  COPYBOOK  : GANDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : ND
******************************************************************
 01  EN-AND-ENDORSEMENT.

          03 EN-AND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AND-FORM-NUMBER               PIC X(10).
          03 EN-AND-EFFECTIVE-DATE            PIC X(10).
          03 EN-AND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
