******************************************************************
*  COPYBOOK  : GANDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : ND
******************************************************************
 01  PT-AND-PARTY.

          03 PT-AND-INSURED-NAME              PIC X(40).
          03 PT-AND-TAX-ID                    PIC X(11).
          03 PT-AND-ADDRESS-LINE1             PIC X(30).
          03 PT-AND-ADDRESS-LINE2             PIC X(30).
          03 PT-AND-CITY                      PIC X(20).
          03 PT-AND-STATE-CODE                PIC X(2).
          03 PT-AND-ZIP-CODE                  PIC X(9).
          03 PT-AND-PHONE                     PIC X(14).
          03 PT-AND-AGENCY-CODE               PIC X(6).
          03 PT-AND-AGENT-NAME                PIC X(30).
