******************************************************************
*  COPYBOOK  : GANEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NE
******************************************************************
 01  PT-ANE-PARTY.

          03 PT-ANE-INSURED-NAME              PIC X(40).
          03 PT-ANE-TAX-ID                    PIC X(11).
          03 PT-ANE-ADDRESS-LINE1             PIC X(30).
          03 PT-ANE-ADDRESS-LINE2             PIC X(30).
          03 PT-ANE-CITY                      PIC X(20).
          03 PT-ANE-STATE-CODE                PIC X(2).
          03 PT-ANE-ZIP-CODE                  PIC X(9).
          03 PT-ANE-PHONE                     PIC X(14).
          03 PT-ANE-AGENCY-CODE               PIC X(6).
          03 PT-ANE-AGENT-NAME                PIC X(30).
