******************************************************************
*  COPYBOOK  : GANEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NE
******************************************************************
 01  EN-ANE-ENDORSEMENT.

          03 EN-ANE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANE-FORM-NUMBER               PIC X(10).
          03 EN-ANE-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
