******************************************************************
*  COPYBOOK  : GANHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NH
******************************************************************
 01  EN-ANH-ENDORSEMENT.

          03 EN-ANH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANH-FORM-NUMBER               PIC X(10).
          03 EN-ANH-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
