******************************************************************
*  COPYBOOK  : GANJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NJ
******************************************************************
 01  PT-ANJ-PARTY.

          03 PT-ANJ-INSURED-NAME              PIC X(40).
          03 PT-ANJ-TAX-ID                    PIC X(11).
          03 PT-ANJ-ADDRESS-LINE1             PIC X(30).
          03 PT-ANJ-ADDRESS-LINE2             PIC X(30).
          03 PT-ANJ-CITY                      PIC X(20).
          03 PT-ANJ-STATE-CODE                PIC X(2).
          03 PT-ANJ-ZIP-CODE                  PIC X(9).
          03 PT-ANJ-PHONE                     PIC X(14).
          03 PT-ANJ-AGENCY-CODE               PIC X(6).
          03 PT-ANJ-AGENT-NAME                PIC X(30).
