******************************************************************
*  COPYBOOK  : GANJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NJ
******************************************************************
 01  EN-ANJ-ENDORSEMENT.

          03 EN-ANJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANJ-FORM-NUMBER               PIC X(10).
          03 EN-ANJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
