******************************************************************
*  COPYBOOK  : GANME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NM
******************************************************************
 01  EN-ANM-ENDORSEMENT.

          03 EN-ANM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANM-FORM-NUMBER               PIC X(10).
          03 EN-ANM-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
