******************************************************************
*  COPYBOOK  : GANVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NV
******************************************************************
 01  EN-ANV-ENDORSEMENT.

          03 EN-ANV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANV-FORM-NUMBER               PIC X(10).
          03 EN-ANV-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
