******************************************************************
*  COPYBOOK  : GANVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NV
******************************************************************
 01  PT-ANV-PARTY.

          03 PT-ANV-INSURED-NAME              PIC X(40).
          03 PT-ANV-TAX-ID                    PIC X(11).
          03 PT-ANV-ADDRESS-LINE1             PIC X(30).
          03 PT-ANV-ADDRESS-LINE2             PIC X(30).
          03 PT-ANV-CITY                      PIC X(20).
          03 PT-ANV-STATE-CODE                PIC X(2).
          03 PT-ANV-ZIP-CODE                  PIC X(9).
          03 PT-ANV-PHONE                     PIC X(14).
          03 PT-ANV-AGENCY-CODE               PIC X(6).
          03 PT-ANV-AGENT-NAME                PIC X(30).
