******************************************************************
*  COPYBOOK  : GANYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NY
******************************************************************
 01  EN-ANY-ENDORSEMENT.

          03 EN-ANY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ANY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ANY-FORM-NUMBER               PIC X(10).
          03 EN-ANY-EFFECTIVE-DATE            PIC X(10).
          03 EN-ANY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
