******************************************************************
*  COPYBOOK  : GANYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : NY
******************************************************************
 01  PT-ANY-PARTY.

          03 PT-ANY-INSURED-NAME              PIC X(40).
          03 PT-ANY-TAX-ID                    PIC X(11).
          03 PT-ANY-ADDRESS-LINE1             PIC X(30).
          03 PT-ANY-ADDRESS-LINE2             PIC X(30).
          03 PT-ANY-CITY                      PIC X(20).
          03 PT-ANY-STATE-CODE                PIC X(2).
          03 PT-ANY-ZIP-CODE                  PIC X(9).
          03 PT-ANY-PHONE                     PIC X(14).
          03 PT-ANY-AGENCY-CODE               PIC X(6).
          03 PT-ANY-AGENT-NAME                PIC X(30).
