******************************************************************
*  COPYBOOK  : GAOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : OH
******************************************************************
 01  EN-AOH-ENDORSEMENT.

          03 EN-AOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AOH-FORM-NUMBER               PIC X(10).
          03 EN-AOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-AOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
