******************************************************************
*  COPYBOOK  : GAOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : OH
******************************************************************
 01  PT-AOH-PARTY.

          03 PT-AOH-INSURED-NAME              PIC X(40).
          03 PT-AOH-TAX-ID                    PIC X(11).
          03 PT-AOH-ADDRESS-LINE1             PIC X(30).
          03 PT-AOH-ADDRESS-LINE2             PIC X(30).
          03 PT-AOH-CITY                      PIC X(20).
          03 PT-AOH-STATE-CODE                PIC X(2).
          03 PT-AOH-ZIP-CODE                  PIC X(9).
          03 PT-AOH-PHONE                     PIC X(14).
          03 PT-AOH-AGENCY-CODE               PIC X(6).
          03 PT-AOH-AGENT-NAME                PIC X(30).
