******************************************************************
*  COPYBOOK  : GAOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : OK
******************************************************************
 01  EN-AOK-ENDORSEMENT.

          03 EN-AOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AOK-FORM-NUMBER               PIC X(10).
          03 EN-AOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-AOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
