******************************************************************
*  COPYBOOK  : GAORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : OR
******************************************************************
 01  EN-AOR-ENDORSEMENT.

          03 EN-AOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AOR-FORM-NUMBER               PIC X(10).
          03 EN-AOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-AOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
