******************************************************************
*  COPYBOOK  : GAORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : OR
******************************************************************
 01  PT-AOR-PARTY.

          03 PT-AOR-INSURED-NAME              PIC X(40).
          03 PT-AOR-TAX-ID                    PIC X(11).
          03 PT-AOR-ADDRESS-LINE1             PIC X(30).
          03 PT-AOR-ADDRESS-LINE2             PIC X(30).
          03 PT-AOR-CITY                      PIC X(20).
          03 PT-AOR-STATE-CODE                PIC X(2).
          03 PT-AOR-ZIP-CODE                  PIC X(9).
          03 PT-AOR-PHONE                     PIC X(14).
          03 PT-AOR-AGENCY-CODE               PIC X(6).
          03 PT-AOR-AGENT-NAME                PIC X(30).
