******************************************************************
*  COPYBOOK  : GAPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : PA
******************************************************************
 01  EN-APA-ENDORSEMENT.

          03 EN-APA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-APA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-APA-FORM-NUMBER               PIC X(10).
          03 EN-APA-EFFECTIVE-DATE            PIC X(10).
          03 EN-APA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
