******************************************************************
*  COPYBOOK  : GARIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : RI
******************************************************************
 01  EN-ARI-ENDORSEMENT.

          03 EN-ARI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ARI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ARI-FORM-NUMBER               PIC X(10).
          03 EN-ARI-EFFECTIVE-DATE            PIC X(10).
          03 EN-ARI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
