******************************************************************
*  COPYBOOK  : GASCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : SC
******************************************************************
 01  PT-ASC-PARTY.

          03 PT-ASC-INSURED-NAME              PIC X(40).
          03 PT-ASC-TAX-ID                    PIC X(11).
          03 PT-ASC-ADDRESS-LINE1             PIC X(30).
          03 PT-ASC-ADDRESS-LINE2             PIC X(30).
          03 PT-ASC-CITY                      PIC X(20).
          03 PT-ASC-STATE-CODE                PIC X(2).
          03 PT-ASC-ZIP-CODE                  PIC X(9).
          03 PT-ASC-PHONE                     PIC X(14).
          03 PT-ASC-AGENCY-CODE               PIC X(6).
          03 PT-ASC-AGENT-NAME                PIC X(30).
