******************************************************************
*  COPYBOOK  : GASCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : SC
******************************************************************
 01  EN-ASC-ENDORSEMENT.

          03 EN-ASC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ASC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ASC-FORM-NUMBER               PIC X(10).
          03 EN-ASC-EFFECTIVE-DATE            PIC X(10).
          03 EN-ASC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
