******************************************************************
*  COPYBOOK  : GASDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : SD
******************************************************************
 01  EN-ASD-ENDORSEMENT.

          03 EN-ASD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ASD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ASD-FORM-NUMBER               PIC X(10).
          03 EN-ASD-EFFECTIVE-DATE            PIC X(10).
          03 EN-ASD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
