******************************************************************
*  COPYBOOK  : GATNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : TN
******************************************************************
 01  EN-ATN-ENDORSEMENT.

          03 EN-ATN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ATN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ATN-FORM-NUMBER               PIC X(10).
          03 EN-ATN-EFFECTIVE-DATE            PIC X(10).
          03 EN-ATN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
