******************************************************************
*  COPYBOOK  : GATNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : TN
******************************************************************
 01  PT-ATN-PARTY.

          03 PT-ATN-INSURED-NAME              PIC X(40).
          03 PT-ATN-TAX-ID                    PIC X(11).
          03 PT-ATN-ADDRESS-LINE1             PIC X(30).
          03 PT-ATN-ADDRESS-LINE2             PIC X(30).
          03 PT-ATN-CITY                      PIC X(20).
          03 PT-ATN-STATE-CODE                PIC X(2).
          03 PT-ATN-ZIP-CODE                  PIC X(9).
          03 PT-ATN-PHONE                     PIC X(14).
          03 PT-ATN-AGENCY-CODE               PIC X(6).
          03 PT-ATN-AGENT-NAME                PIC X(30).
