******************************************************************
*  COPYBOOK  : GATXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : TX
******************************************************************
 01  EN-ATX-ENDORSEMENT.

          03 EN-ATX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ATX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ATX-FORM-NUMBER               PIC X(10).
          03 EN-ATX-EFFECTIVE-DATE            PIC X(10).
          03 EN-ATX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
