******************************************************************
*  COPYBOOK  : GATXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : TX
******************************************************************
 01  PT-ATX-PARTY.

          03 PT-ATX-INSURED-NAME              PIC X(40).
          03 PT-ATX-TAX-ID                    PIC X(11).
          03 PT-ATX-ADDRESS-LINE1             PIC X(30).
          03 PT-ATX-ADDRESS-LINE2             PIC X(30).
          03 PT-ATX-CITY                      PIC X(20).
          03 PT-ATX-STATE-CODE                PIC X(2).
          03 PT-ATX-ZIP-CODE                  PIC X(9).
          03 PT-ATX-PHONE                     PIC X(14).
          03 PT-ATX-AGENCY-CODE               PIC X(6).
          03 PT-ATX-AGENT-NAME                PIC X(30).
