******************************************************************
*  COPYBOOK  : GAUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : UT
******************************************************************
 01  EN-AUT-ENDORSEMENT.

          03 EN-AUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AUT-FORM-NUMBER               PIC X(10).
          03 EN-AUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-AUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
