******************************************************************
*  COPYBOOK  : GAUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : UT
******************************************************************
 01  PT-AUT-PARTY.

          03 PT-AUT-INSURED-NAME              PIC X(40).
          03 PT-AUT-TAX-ID                    PIC X(11).
          03 PT-AUT-ADDRESS-LINE1             PIC X(30).
          03 PT-AUT-ADDRESS-LINE2             PIC X(30).
          03 PT-AUT-CITY                      PIC X(20).
          03 PT-AUT-STATE-CODE                PIC X(2).
          03 PT-AUT-ZIP-CODE                  PIC X(9).
          03 PT-AUT-PHONE                     PIC X(14).
          03 PT-AUT-AGENCY-CODE               PIC X(6).
          03 PT-AUT-AGENT-NAME                PIC X(30).
