******************************************************************
*  COPYBOOK  : GAVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : VA
******************************************************************
 01  PT-AVA-PARTY.

          03 PT-AVA-INSURED-NAME              PIC X(40).
          03 PT-AVA-TAX-ID                    PIC X(11).
          03 PT-AVA-ADDRESS-LINE1             PIC X(30).
          03 PT-AVA-ADDRESS-LINE2             PIC X(30).
          03 PT-AVA-CITY                      PIC X(20).
          03 PT-AVA-STATE-CODE                PIC X(2).
          03 PT-AVA-ZIP-CODE                  PIC X(9).
          03 PT-AVA-PHONE                     PIC X(14).
          03 PT-AVA-AGENCY-CODE               PIC X(6).
          03 PT-AVA-AGENT-NAME                PIC X(30).
