******************************************************************
*  COPYBOOK  : GAVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : VA
******************************************************************
 01  EN-AVA-ENDORSEMENT.

          03 EN-AVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AVA-FORM-NUMBER               PIC X(10).
          03 EN-AVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-AVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
