******************************************************************
*  COPYBOOK  : GAVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : VT
******************************************************************
 01  EN-AVT-ENDORSEMENT.

          03 EN-AVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AVT-FORM-NUMBER               PIC X(10).
          03 EN-AVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-AVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
