******************************************************************
*  COPYBOOK  : GAVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : VT
******************************************************************
 01  PT-AVT-PARTY.

          03 PT-AVT-INSURED-NAME              PIC X(40).
          03 PT-AVT-TAX-ID                    PIC X(11).
          03 PT-AVT-ADDRESS-LINE1             PIC X(30).
          03 PT-AVT-ADDRESS-LINE2             PIC X(30).
          03 PT-AVT-CITY                      PIC X(20).
          03 PT-AVT-STATE-CODE                PIC X(2).
          03 PT-AVT-ZIP-CODE                  PIC X(9).
          03 PT-AVT-PHONE                     PIC X(14).
          03 PT-AVT-AGENCY-CODE               PIC X(6).
          03 PT-AVT-AGENT-NAME                PIC X(30).
