******************************************************************
*  COPYBOOK  : GAWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WA
******************************************************************
 01  EN-AWA-ENDORSEMENT.

          03 EN-AWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AWA-FORM-NUMBER               PIC X(10).
          03 EN-AWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-AWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
