******************************************************************
*  COPYBOOK  : GAWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WA
******************************************************************
 01  PT-AWA-PARTY.

          03 PT-AWA-INSURED-NAME              PIC X(40).
          03 PT-AWA-TAX-ID                    PIC X(11).
          03 PT-AWA-ADDRESS-LINE1             PIC X(30).
          03 PT-AWA-ADDRESS-LINE2             PIC X(30).
          03 PT-AWA-CITY                      PIC X(20).
          03 PT-AWA-STATE-CODE                PIC X(2).
          03 PT-AWA-ZIP-CODE                  PIC X(9).
          03 PT-AWA-PHONE                     PIC X(14).
          03 PT-AWA-AGENCY-CODE               PIC X(6).
          03 PT-AWA-AGENT-NAME                PIC X(30).
