******************************************************************
*  COPYBOOK  : GAWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WI
******************************************************************
 01  PT-AWI-PARTY.

          03 PT-AWI-INSURED-NAME              PIC X(40).
          03 PT-AWI-TAX-ID                    PIC X(11).
          03 PT-AWI-ADDRESS-LINE1             PIC X(30).
          03 PT-AWI-ADDRESS-LINE2             PIC X(30).
          03 PT-AWI-CITY                      PIC X(20).
          03 PT-AWI-STATE-CODE                PIC X(2).
          03 PT-AWI-ZIP-CODE                  PIC X(9).
          03 PT-AWI-PHONE                     PIC X(14).
          03 PT-AWI-AGENCY-CODE               PIC X(6).
          03 PT-AWI-AGENT-NAME                PIC X(30).
