******************************************************************
*  COPYBOOK  : GAWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WI
******************************************************************
 01  EN-AWI-ENDORSEMENT.

          03 EN-AWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AWI-FORM-NUMBER               PIC X(10).
          03 EN-AWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-AWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
