******************************************************************
*  COPYBOOK  : GAWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WV
******************************************************************
 01  PT-AWV-PARTY.

          03 PT-AWV-INSURED-NAME              PIC X(40).
          03 PT-AWV-TAX-ID                    PIC X(11).
          03 PT-AWV-ADDRESS-LINE1             PIC X(30).
          03 PT-AWV-ADDRESS-LINE2             PIC X(30).
          03 PT-AWV-CITY                      PIC X(20).
          03 PT-AWV-STATE-CODE                PIC X(2).
          03 PT-AWV-ZIP-CODE                  PIC X(9).
          03 PT-AWV-PHONE                     PIC X(14).
          03 PT-AWV-AGENCY-CODE               PIC X(6).
          03 PT-AWV-AGENT-NAME                PIC X(30).
