******************************************************************
*  COPYBOOK  : GAWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WV
******************************************************************
 01  EN-AWV-ENDORSEMENT.

          03 EN-AWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AWV-FORM-NUMBER               PIC X(10).
          03 EN-AWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-AWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
