******************************************************************
*  COPYBOOK  : GAWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WY
******************************************************************
 01  PT-AWY-PARTY.

          03 PT-AWY-INSURED-NAME              PIC X(40).
          03 PT-AWY-TAX-ID                    PIC X(11).
          03 PT-AWY-ADDRESS-LINE1             PIC X(30).
          03 PT-AWY-ADDRESS-LINE2             PIC X(30).
          03 PT-AWY-CITY                      PIC X(20).
          03 PT-AWY-STATE-CODE                PIC X(2).
          03 PT-AWY-ZIP-CODE                  PIC X(9).
          03 PT-AWY-PHONE                     PIC X(14).
          03 PT-AWY-AGENCY-CODE               PIC X(6).
          03 PT-AWY-AGENT-NAME                PIC X(30).
