******************************************************************
*  COPYBOOK  : GAWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Personal and Advertising Injury Liability (PA)
*  STATE     : WY
******************************************************************
 01  EN-AWY-ENDORSEMENT.

          03 EN-AWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-AWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-AWY-FORM-NUMBER               PIC X(10).
          03 EN-AWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-AWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
