******************************************************************
*  COPYBOOK  : GUAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AK
******************************************************************
 01  EN-UAK-ENDORSEMENT.

          03 EN-UAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UAK-FORM-NUMBER               PIC X(10).
          03 EN-UAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-UAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
