******************************************************************
*  COPYBOOK  : GUAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AK
******************************************************************
 01  PT-UAK-PARTY.

          03 PT-UAK-INSURED-NAME              PIC X(40).
          03 PT-UAK-TAX-ID                    PIC X(11).
          03 PT-UAK-ADDRESS-LINE1             PIC X(30).
          03 PT-UAK-ADDRESS-LINE2             PIC X(30).
          03 PT-UAK-CITY                      PIC X(20).
          03 PT-UAK-STATE-CODE                PIC X(2).
          03 PT-UAK-ZIP-CODE                  PIC X(9).
          03 PT-UAK-PHONE                     PIC X(14).
          03 PT-UAK-AGENCY-CODE               PIC X(6).
          03 PT-UAK-AGENT-NAME                PIC X(30).
