******************************************************************
*  COPYBOOK  : GUALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AL
******************************************************************
 01  EN-UAL-ENDORSEMENT.

          03 EN-UAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UAL-FORM-NUMBER               PIC X(10).
          03 EN-UAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-UAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
