******************************************************************
*  COPYBOOK  : GUARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AR
******************************************************************
 01  EN-UAR-ENDORSEMENT.

          03 EN-UAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UAR-FORM-NUMBER               PIC X(10).
          03 EN-UAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-UAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
