******************************************************************
*  COPYBOOK  : GUARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AR
******************************************************************
 01  PT-UAR-PARTY.

          03 PT-UAR-INSURED-NAME              PIC X(40).
          03 PT-UAR-TAX-ID                    PIC X(11).
          03 PT-UAR-ADDRESS-LINE1             PIC X(30).
          03 PT-UAR-ADDRESS-LINE2             PIC X(30).
          03 PT-UAR-CITY                      PIC X(20).
          03 PT-UAR-STATE-CODE                PIC X(2).
          03 PT-UAR-ZIP-CODE                  PIC X(9).
          03 PT-UAR-PHONE                     PIC X(14).
          03 PT-UAR-AGENCY-CODE               PIC X(6).
          03 PT-UAR-AGENT-NAME                PIC X(30).
