******************************************************************
*  COPYBOOK  : GUAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AZ
******************************************************************
 01  EN-UAZ-ENDORSEMENT.

          03 EN-UAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UAZ-FORM-NUMBER               PIC X(10).
          03 EN-UAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-UAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
