******************************************************************
*  COPYBOOK  : GUAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : AZ
******************************************************************
 01  PT-UAZ-PARTY.

          03 PT-UAZ-INSURED-NAME              PIC X(40).
          03 PT-UAZ-TAX-ID                    PIC X(11).
          03 PT-UAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-UAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-UAZ-CITY                      PIC X(20).
          03 PT-UAZ-STATE-CODE                PIC X(2).
          03 PT-UAZ-ZIP-CODE                  PIC X(9).
          03 PT-UAZ-PHONE                     PIC X(14).
          03 PT-UAZ-AGENCY-CODE               PIC X(6).
          03 PT-UAZ-AGENT-NAME                PIC X(30).
