******************************************************************
*  COPYBOOK  : GUCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : CA
******************************************************************
 01  EN-UCA-ENDORSEMENT.

          03 EN-UCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UCA-FORM-NUMBER               PIC X(10).
          03 EN-UCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
