******************************************************************
*  COPYBOOK  : GUCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : CO
******************************************************************
 01  EN-UCO-ENDORSEMENT.

          03 EN-UCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UCO-FORM-NUMBER               PIC X(10).
          03 EN-UCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-UCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
