******************************************************************
*  COPYBOOK  : GUCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : CT
******************************************************************
 01  EN-UCT-ENDORSEMENT.

          03 EN-UCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UCT-FORM-NUMBER               PIC X(10).
          03 EN-UCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-UCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
