******************************************************************
*  COPYBOOK  : GUDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : DC
******************************************************************
 01  EN-UDC-ENDORSEMENT.

          03 EN-UDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UDC-FORM-NUMBER               PIC X(10).
          03 EN-UDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-UDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
