******************************************************************
*  COPYBOOK  : GUDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : DE
******************************************************************
 01  EN-UDE-ENDORSEMENT.

          03 EN-UDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UDE-FORM-NUMBER               PIC X(10).
          03 EN-UDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-UDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
