******************************************************************
*  COPYBOOK  : GUFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : FL
******************************************************************
 01  EN-UFL-ENDORSEMENT.

          03 EN-UFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UFL-FORM-NUMBER               PIC X(10).
          03 EN-UFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-UFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
