******************************************************************
*  COPYBOOK  : GUGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : GA
******************************************************************
 01  EN-UGA-ENDORSEMENT.

          03 EN-UGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UGA-FORM-NUMBER               PIC X(10).
          03 EN-UGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
