******************************************************************
*  COPYBOOK  : GUGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : GA
******************************************************************
 01  PT-UGA-PARTY.

          03 PT-UGA-INSURED-NAME              PIC X(40).
          03 PT-UGA-TAX-ID                    PIC X(11).
          03 PT-UGA-ADDRESS-LINE1             PIC X(30).
          03 PT-UGA-ADDRESS-LINE2             PIC X(30).
          03 PT-UGA-CITY                      PIC X(20).
          03 PT-UGA-STATE-CODE                PIC X(2).
          03 PT-UGA-ZIP-CODE                  PIC X(9).
          03 PT-UGA-PHONE                     PIC X(14).
          03 PT-UGA-AGENCY-CODE               PIC X(6).
          03 PT-UGA-AGENT-NAME                PIC X(30).
