******************************************************************
*  COPYBOOK  : GUHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : HI
******************************************************************
 01  PT-UHI-PARTY.

          03 PT-UHI-INSURED-NAME              PIC X(40).
          03 PT-UHI-TAX-ID                    PIC X(11).
          03 PT-UHI-ADDRESS-LINE1             PIC X(30).
          03 PT-UHI-ADDRESS-LINE2             PIC X(30).
          03 PT-UHI-CITY                      PIC X(20).
          03 PT-UHI-STATE-CODE                PIC X(2).
          03 PT-UHI-ZIP-CODE                  PIC X(9).
          03 PT-UHI-PHONE                     PIC X(14).
          03 PT-UHI-AGENCY-CODE               PIC X(6).
          03 PT-UHI-AGENT-NAME                PIC X(30).
