******************************************************************
*  COPYBOOK  : GUHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : HI
******************************************************************
 01  EN-UHI-ENDORSEMENT.

          03 EN-UHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UHI-FORM-NUMBER               PIC X(10).
          03 EN-UHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-UHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
