******************************************************************
*  COPYBOOK  : GUIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IA
******************************************************************
 01  EN-UIA-ENDORSEMENT.

          03 EN-UIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UIA-FORM-NUMBER               PIC X(10).
          03 EN-UIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
