******************************************************************
*  COPYBOOK  : GUIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IA
******************************************************************
 01  PT-UIA-PARTY.

          03 PT-UIA-INSURED-NAME              PIC X(40).
          03 PT-UIA-TAX-ID                    PIC X(11).
          03 PT-UIA-ADDRESS-LINE1             PIC X(30).
          03 PT-UIA-ADDRESS-LINE2             PIC X(30).
          03 PT-UIA-CITY                      PIC X(20).
          03 PT-UIA-STATE-CODE                PIC X(2).
          03 PT-UIA-ZIP-CODE                  PIC X(9).
          03 PT-UIA-PHONE                     PIC X(14).
          03 PT-UIA-AGENCY-CODE               PIC X(6).
          03 PT-UIA-AGENT-NAME                PIC X(30).
