******************************************************************
*  COPYBOOK  : GUIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : ID
******************************************************************
 01  EN-UID-ENDORSEMENT.

          03 EN-UID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UID-FORM-NUMBER               PIC X(10).
          03 EN-UID-EFFECTIVE-DATE            PIC X(10).
          03 EN-UID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
