******************************************************************
*  COPYBOOK  : GUILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IL
******************************************************************
 01  PT-UIL-PARTY.

          03 PT-UIL-INSURED-NAME              PIC X(40).
          03 PT-UIL-TAX-ID                    PIC X(11).
          03 PT-UIL-ADDRESS-LINE1             PIC X(30).
          03 PT-UIL-ADDRESS-LINE2             PIC X(30).
          03 PT-UIL-CITY                      PIC X(20).
          03 PT-UIL-STATE-CODE                PIC X(2).
          03 PT-UIL-ZIP-CODE                  PIC X(9).
          03 PT-UIL-PHONE                     PIC X(14).
          03 PT-UIL-AGENCY-CODE               PIC X(6).
          03 PT-UIL-AGENT-NAME                PIC X(30).
