******************************************************************
*  COPYBOOK  : GUILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IL
******************************************************************
 01  EN-UIL-ENDORSEMENT.

          03 EN-UIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UIL-FORM-NUMBER               PIC X(10).
          03 EN-UIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-UIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
