******************************************************************
*  COPYBOOK  : GUINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IN
******************************************************************
 01  EN-UIN-ENDORSEMENT.

          03 EN-UIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UIN-FORM-NUMBER               PIC X(10).
          03 EN-UIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-UIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
