******************************************************************
*  COPYBOOK  : GUINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : IN
******************************************************************
 01  PT-UIN-PARTY.

          03 PT-UIN-INSURED-NAME              PIC X(40).
          03 PT-UIN-TAX-ID                    PIC X(11).
          03 PT-UIN-ADDRESS-LINE1             PIC X(30).
          03 PT-UIN-ADDRESS-LINE2             PIC X(30).
          03 PT-UIN-CITY                      PIC X(20).
          03 PT-UIN-STATE-CODE                PIC X(2).
          03 PT-UIN-ZIP-CODE                  PIC X(9).
          03 PT-UIN-PHONE                     PIC X(14).
          03 PT-UIN-AGENCY-CODE               PIC X(6).
          03 PT-UIN-AGENT-NAME                PIC X(30).
