******************************************************************
*  COPYBOOK  : GUKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : KS
******************************************************************
 01  EN-UKS-ENDORSEMENT.

          03 EN-UKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UKS-FORM-NUMBER               PIC X(10).
          03 EN-UKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-UKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
