******************************************************************
*  COPYBOOK  : GUKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : KS
******************************************************************
 01  PT-UKS-PARTY.

          03 PT-UKS-INSURED-NAME              PIC X(40).
          03 PT-UKS-TAX-ID                    PIC X(11).
          03 PT-UKS-ADDRESS-LINE1             PIC X(30).
          03 PT-UKS-ADDRESS-LINE2             PIC X(30).
          03 PT-UKS-CITY                      PIC X(20).
          03 PT-UKS-STATE-CODE                PIC X(2).
          03 PT-UKS-ZIP-CODE                  PIC X(9).
          03 PT-UKS-PHONE                     PIC X(14).
          03 PT-UKS-AGENCY-CODE               PIC X(6).
          03 PT-UKS-AGENT-NAME                PIC X(30).
