******************************************************************
*  COPYBOOK  : GUKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : KY
******************************************************************
 01  EN-UKY-ENDORSEMENT.

          03 EN-UKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UKY-FORM-NUMBER               PIC X(10).
          03 EN-UKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-UKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
