******************************************************************
*  COPYBOOK  : GULAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : LA
******************************************************************
 01  PT-ULA-PARTY.

          03 PT-ULA-INSURED-NAME              PIC X(40).
          03 PT-ULA-TAX-ID                    PIC X(11).
          03 PT-ULA-ADDRESS-LINE1             PIC X(30).
          03 PT-ULA-ADDRESS-LINE2             PIC X(30).
          03 PT-ULA-CITY                      PIC X(20).
          03 PT-ULA-STATE-CODE                PIC X(2).
          03 PT-ULA-ZIP-CODE                  PIC X(9).
          03 PT-ULA-PHONE                     PIC X(14).
          03 PT-ULA-AGENCY-CODE               PIC X(6).
          03 PT-ULA-AGENT-NAME                PIC X(30).
