******************************************************************
*  COPYBOOK  : GULAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : LA
******************************************************************
 01  EN-ULA-ENDORSEMENT.

          03 EN-ULA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ULA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ULA-FORM-NUMBER               PIC X(10).
          03 EN-ULA-EFFECTIVE-DATE            PIC X(10).
          03 EN-ULA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
