******************************************************************
*  COPYBOOK  : GUMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MA
******************************************************************
 01  EN-UMA-ENDORSEMENT.

          03 EN-UMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMA-FORM-NUMBER               PIC X(10).
          03 EN-UMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
