******************************************************************
*  COPYBOOK  : GUMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MD
******************************************************************
 01  EN-UMD-ENDORSEMENT.

          03 EN-UMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMD-FORM-NUMBER               PIC X(10).
          03 EN-UMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
