******************************************************************
*  COPYBOOK  : GUMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : ME
******************************************************************
 01  EN-UME-ENDORSEMENT.

          03 EN-UME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UME-FORM-NUMBER               PIC X(10).
          03 EN-UME-EFFECTIVE-DATE            PIC X(10).
          03 EN-UME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
