******************************************************************
*  COPYBOOK  : GUMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MI
******************************************************************
 01  EN-UMI-ENDORSEMENT.

          03 EN-UMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMI-FORM-NUMBER               PIC X(10).
          03 EN-UMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
