******************************************************************
*  COPYBOOK  : GUMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MN
******************************************************************
 01  PT-UMN-PARTY.

          03 PT-UMN-INSURED-NAME              PIC X(40).
          03 PT-UMN-TAX-ID                    PIC X(11).
          03 PT-UMN-ADDRESS-LINE1             PIC X(30).
          03 PT-UMN-ADDRESS-LINE2             PIC X(30).
          03 PT-UMN-CITY                      PIC X(20).
          03 PT-UMN-STATE-CODE                PIC X(2).
          03 PT-UMN-ZIP-CODE                  PIC X(9).
          03 PT-UMN-PHONE                     PIC X(14).
          03 PT-UMN-AGENCY-CODE               PIC X(6).
          03 PT-UMN-AGENT-NAME                PIC X(30).
