******************************************************************
*  COPYBOOK  : GUMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MN
******************************************************************
 01  EN-UMN-ENDORSEMENT.

          03 EN-UMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMN-FORM-NUMBER               PIC X(10).
          03 EN-UMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
