******************************************************************
*  COPYBOOK  : GUMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MO
******************************************************************
 01  EN-UMO-ENDORSEMENT.

          03 EN-UMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMO-FORM-NUMBER               PIC X(10).
          03 EN-UMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
