******************************************************************
*  COPYBOOK  : GUMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MS
******************************************************************
 01  EN-UMS-ENDORSEMENT.

          03 EN-UMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMS-FORM-NUMBER               PIC X(10).
          03 EN-UMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
