******************************************************************
*  COPYBOOK  : GUMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : MT
******************************************************************
 01  EN-UMT-ENDORSEMENT.

          03 EN-UMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UMT-FORM-NUMBER               PIC X(10).
          03 EN-UMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-UMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
