******************************************************************
*  COPYBOOK  : GUNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NC
******************************************************************
 01  EN-UNC-ENDORSEMENT.

          03 EN-UNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNC-FORM-NUMBER               PIC X(10).
          03 EN-UNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
