******************************************************************
*  COPYBOOK  : GUNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : ND
******************************************************************
 01  EN-UND-ENDORSEMENT.

          03 EN-UND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UND-FORM-NUMBER               PIC X(10).
          03 EN-UND-EFFECTIVE-DATE            PIC X(10).
          03 EN-UND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
