******************************************************************
*  COPYBOOK  : GUNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NE
******************************************************************
 01  PT-UNE-PARTY.

          03 PT-UNE-INSURED-NAME              PIC X(40).
          03 PT-UNE-TAX-ID                    PIC X(11).
          03 PT-UNE-ADDRESS-LINE1             PIC X(30).
          03 PT-UNE-ADDRESS-LINE2             PIC X(30).
          03 PT-UNE-CITY                      PIC X(20).
          03 PT-UNE-STATE-CODE                PIC X(2).
          03 PT-UNE-ZIP-CODE                  PIC X(9).
          03 PT-UNE-PHONE                     PIC X(14).
          03 PT-UNE-AGENCY-CODE               PIC X(6).
          03 PT-UNE-AGENT-NAME                PIC X(30).
