******************************************************************
*  COPYBOOK  : GUNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NE
******************************************************************
 01  EN-UNE-ENDORSEMENT.

          03 EN-UNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNE-FORM-NUMBER               PIC X(10).
          03 EN-UNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
