******************************************************************
*  COPYBOOK  : GUNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NH
******************************************************************
 01  PT-UNH-PARTY.

          03 PT-UNH-INSURED-NAME              PIC X(40).
          03 PT-UNH-TAX-ID                    PIC X(11).
          03 PT-UNH-ADDRESS-LINE1             PIC X(30).
          03 PT-UNH-ADDRESS-LINE2             PIC X(30).
          03 PT-UNH-CITY                      PIC X(20).
          03 PT-UNH-STATE-CODE                PIC X(2).
          03 PT-UNH-ZIP-CODE                  PIC X(9).
          03 PT-UNH-PHONE                     PIC X(14).
          03 PT-UNH-AGENCY-CODE               PIC X(6).
          03 PT-UNH-AGENT-NAME                PIC X(30).
