******************************************************************
*  COPYBOOK  : GUNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NH
******************************************************************
 01  EN-UNH-ENDORSEMENT.

          03 EN-UNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNH-FORM-NUMBER               PIC X(10).
          03 EN-UNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
