******************************************************************
*  COPYBOOK  : GUNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NJ
******************************************************************
 01  PT-UNJ-PARTY.

          03 PT-UNJ-INSURED-NAME              PIC X(40).
          03 PT-UNJ-TAX-ID                    PIC X(11).
          03 PT-UNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-UNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-UNJ-CITY                      PIC X(20).
          03 PT-UNJ-STATE-CODE                PIC X(2).
          03 PT-UNJ-ZIP-CODE                  PIC X(9).
          03 PT-UNJ-PHONE                     PIC X(14).
          03 PT-UNJ-AGENCY-CODE               PIC X(6).
          03 PT-UNJ-AGENT-NAME                PIC X(30).
