******************************************************************
*  COPYBOOK  : GUNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NJ
******************************************************************
 01  EN-UNJ-ENDORSEMENT.

          03 EN-UNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNJ-FORM-NUMBER               PIC X(10).
          03 EN-UNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
