******************************************************************
*  COPYBOOK  : GUNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NM
******************************************************************
 01  EN-UNM-ENDORSEMENT.

          03 EN-UNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNM-FORM-NUMBER               PIC X(10).
          03 EN-UNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
