******************************************************************
*  COPYBOOK  : GUNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NM
******************************************************************
 01  PT-UNM-PARTY.

          03 PT-UNM-INSURED-NAME              PIC X(40).
          03 PT-UNM-TAX-ID                    PIC X(11).
          03 PT-UNM-ADDRESS-LINE1             PIC X(30).
          03 PT-UNM-ADDRESS-LINE2             PIC X(30).
          03 PT-UNM-CITY                      PIC X(20).
          03 PT-UNM-STATE-CODE                PIC X(2).
          03 PT-UNM-ZIP-CODE                  PIC X(9).
          03 PT-UNM-PHONE                     PIC X(14).
          03 PT-UNM-AGENCY-CODE               PIC X(6).
          03 PT-UNM-AGENT-NAME                PIC X(30).
