******************************************************************
*  COPYBOOK  : GUNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NV
******************************************************************
 01  EN-UNV-ENDORSEMENT.

          03 EN-UNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNV-FORM-NUMBER               PIC X(10).
          03 EN-UNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
