******************************************************************
*  COPYBOOK  : GUNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NY
******************************************************************
 01  EN-UNY-ENDORSEMENT.

          03 EN-UNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UNY-FORM-NUMBER               PIC X(10).
          03 EN-UNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-UNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
