******************************************************************
*  COPYBOOK  : GUNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : NY
******************************************************************
 01  PT-UNY-PARTY.

          03 PT-UNY-INSURED-NAME              PIC X(40).
          03 PT-UNY-TAX-ID                    PIC X(11).
          03 PT-UNY-ADDRESS-LINE1             PIC X(30).
          03 PT-UNY-ADDRESS-LINE2             PIC X(30).
          03 PT-UNY-CITY                      PIC X(20).
          03 PT-UNY-STATE-CODE                PIC X(2).
          03 PT-UNY-ZIP-CODE                  PIC X(9).
          03 PT-UNY-PHONE                     PIC X(14).
          03 PT-UNY-AGENCY-CODE               PIC X(6).
          03 PT-UNY-AGENT-NAME                PIC X(30).
