******************************************************************
*  COPYBOOK  : GUOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : OH
******************************************************************
 01  EN-UOH-ENDORSEMENT.

          03 EN-UOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UOH-FORM-NUMBER               PIC X(10).
          03 EN-UOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-UOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
