******************************************************************
*  COPYBOOK  : GUOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : OH
******************************************************************
 01  PT-UOH-PARTY.

          03 PT-UOH-INSURED-NAME              PIC X(40).
          03 PT-UOH-TAX-ID                    PIC X(11).
          03 PT-UOH-ADDRESS-LINE1             PIC X(30).
          03 PT-UOH-ADDRESS-LINE2             PIC X(30).
          03 PT-UOH-CITY                      PIC X(20).
          03 PT-UOH-STATE-CODE                PIC X(2).
          03 PT-UOH-ZIP-CODE                  PIC X(9).
          03 PT-UOH-PHONE                     PIC X(14).
          03 PT-UOH-AGENCY-CODE               PIC X(6).
          03 PT-UOH-AGENT-NAME                PIC X(30).
