******************************************************************
*  COPYBOOK  : GUOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : OK
******************************************************************
 01  PT-UOK-PARTY.

          03 PT-UOK-INSURED-NAME              PIC X(40).
          03 PT-UOK-TAX-ID                    PIC X(11).
          03 PT-UOK-ADDRESS-LINE1             PIC X(30).
          03 PT-UOK-ADDRESS-LINE2             PIC X(30).
          03 PT-UOK-CITY                      PIC X(20).
          03 PT-UOK-STATE-CODE                PIC X(2).
          03 PT-UOK-ZIP-CODE                  PIC X(9).
          03 PT-UOK-PHONE                     PIC X(14).
          03 PT-UOK-AGENCY-CODE               PIC X(6).
          03 PT-UOK-AGENT-NAME                PIC X(30).
