******************************************************************
*  COPYBOOK  : GUOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : OK
******************************************************************
 01  EN-UOK-ENDORSEMENT.

          03 EN-UOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UOK-FORM-NUMBER               PIC X(10).
          03 EN-UOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-UOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
