******************************************************************
*  COPYBOOK  : GUORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : OR
******************************************************************
 01  EN-UOR-ENDORSEMENT.

          03 EN-UOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UOR-FORM-NUMBER               PIC X(10).
          03 EN-UOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-UOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
