******************************************************************
*  COPYBOOK  : GUPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : PA
******************************************************************
 01  EN-UPA-ENDORSEMENT.

          03 EN-UPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UPA-FORM-NUMBER               PIC X(10).
          03 EN-UPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
