******************************************************************
*  COPYBOOK  : GURIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : RI
******************************************************************
 01  EN-URI-ENDORSEMENT.

          03 EN-URI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-URI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-URI-FORM-NUMBER               PIC X(10).
          03 EN-URI-EFFECTIVE-DATE            PIC X(10).
          03 EN-URI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
