******************************************************************
*  COPYBOOK  : GUSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : SC
******************************************************************
 01  PT-USC-PARTY.

          03 PT-USC-INSURED-NAME              PIC X(40).
          03 PT-USC-TAX-ID                    PIC X(11).
          03 PT-USC-ADDRESS-LINE1             PIC X(30).
          03 PT-USC-ADDRESS-LINE2             PIC X(30).
          03 PT-USC-CITY                      PIC X(20).
          03 PT-USC-STATE-CODE                PIC X(2).
          03 PT-USC-ZIP-CODE                  PIC X(9).
          03 PT-USC-PHONE                     PIC X(14).
          03 PT-USC-AGENCY-CODE               PIC X(6).
          03 PT-USC-AGENT-NAME                PIC X(30).
