******************************************************************
*  COPYBOOK  : GUSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : SC
******************************************************************
 01  EN-USC-ENDORSEMENT.

          03 EN-USC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-USC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-USC-FORM-NUMBER               PIC X(10).
          03 EN-USC-EFFECTIVE-DATE            PIC X(10).
          03 EN-USC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
