******************************************************************
*  COPYBOOK  : GUSDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : SD
******************************************************************
 01  PT-USD-PARTY.

          03 PT-USD-INSURED-NAME              PIC X(40).
          03 PT-USD-TAX-ID                    PIC X(11).
          03 PT-USD-ADDRESS-LINE1             PIC X(30).
          03 PT-USD-ADDRESS-LINE2             PIC X(30).
          03 PT-USD-CITY                      PIC X(20).
          03 PT-USD-STATE-CODE                PIC X(2).
          03 PT-USD-ZIP-CODE                  PIC X(9).
          03 PT-USD-PHONE                     PIC X(14).
          03 PT-USD-AGENCY-CODE               PIC X(6).
          03 PT-USD-AGENT-NAME                PIC X(30).
