******************************************************************
*  COPYBOOK  : GUSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : SD
******************************************************************
 01  EN-USD-ENDORSEMENT.

          03 EN-USD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-USD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-USD-FORM-NUMBER               PIC X(10).
          03 EN-USD-EFFECTIVE-DATE            PIC X(10).
          03 EN-USD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
