******************************************************************
*  COPYBOOK  : GUTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : TN
******************************************************************
 01  PT-UTN-PARTY.

          03 PT-UTN-INSURED-NAME              PIC X(40).
          03 PT-UTN-TAX-ID                    PIC X(11).
          03 PT-UTN-ADDRESS-LINE1             PIC X(30).
          03 PT-UTN-ADDRESS-LINE2             PIC X(30).
          03 PT-UTN-CITY                      PIC X(20).
          03 PT-UTN-STATE-CODE                PIC X(2).
          03 PT-UTN-ZIP-CODE                  PIC X(9).
          03 PT-UTN-PHONE                     PIC X(14).
          03 PT-UTN-AGENCY-CODE               PIC X(6).
          03 PT-UTN-AGENT-NAME                PIC X(30).
