******************************************************************
*  COPYBOOK  : GUTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : TN
******************************************************************
 01  EN-UTN-ENDORSEMENT.

          03 EN-UTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UTN-FORM-NUMBER               PIC X(10).
          03 EN-UTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-UTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
