******************************************************************
*  COPYBOOK  : GUTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : TX
******************************************************************
 01  EN-UTX-ENDORSEMENT.

          03 EN-UTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UTX-FORM-NUMBER               PIC X(10).
          03 EN-UTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-UTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
