******************************************************************
*  COPYBOOK  : GUTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : TX
******************************************************************
 01  PT-UTX-PARTY.

          03 PT-UTX-INSURED-NAME              PIC X(40).
          03 PT-UTX-TAX-ID                    PIC X(11).
          03 PT-UTX-ADDRESS-LINE1             PIC X(30).
          03 PT-UTX-ADDRESS-LINE2             PIC X(30).
          03 PT-UTX-CITY                      PIC X(20).
          03 PT-UTX-STATE-CODE                PIC X(2).
          03 PT-UTX-ZIP-CODE                  PIC X(9).
          03 PT-UTX-PHONE                     PIC X(14).
          03 PT-UTX-AGENCY-CODE               PIC X(6).
          03 PT-UTX-AGENT-NAME                PIC X(30).
