******************************************************************
*  COPYBOOK  : GUUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : UT
******************************************************************
 01  PT-UUT-PARTY.

          03 PT-UUT-INSURED-NAME              PIC X(40).
          03 PT-UUT-TAX-ID                    PIC X(11).
          03 PT-UUT-ADDRESS-LINE1             PIC X(30).
          03 PT-UUT-ADDRESS-LINE2             PIC X(30).
          03 PT-UUT-CITY                      PIC X(20).
          03 PT-UUT-STATE-CODE                PIC X(2).
          03 PT-UUT-ZIP-CODE                  PIC X(9).
          03 PT-UUT-PHONE                     PIC X(14).
          03 PT-UUT-AGENCY-CODE               PIC X(6).
          03 PT-UUT-AGENT-NAME                PIC X(30).
