******************************************************************
*  COPYBOOK  : GUUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : UT
******************************************************************
 01  EN-UUT-ENDORSEMENT.

          03 EN-UUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UUT-FORM-NUMBER               PIC X(10).
          03 EN-UUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-UUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
