******************************************************************
*  COPYBOOK  : GUVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : VA
******************************************************************
 01  PT-UVA-PARTY.

          03 PT-UVA-INSURED-NAME              PIC X(40).
          03 PT-UVA-TAX-ID                    PIC X(11).
          03 PT-UVA-ADDRESS-LINE1             PIC X(30).
          03 PT-UVA-ADDRESS-LINE2             PIC X(30).
          03 PT-UVA-CITY                      PIC X(20).
          03 PT-UVA-STATE-CODE                PIC X(2).
          03 PT-UVA-ZIP-CODE                  PIC X(9).
          03 PT-UVA-PHONE                     PIC X(14).
          03 PT-UVA-AGENCY-CODE               PIC X(6).
          03 PT-UVA-AGENT-NAME                PIC X(30).
