******************************************************************
*  COPYBOOK  : GUVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : VA
******************************************************************
 01  EN-UVA-ENDORSEMENT.

          03 EN-UVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UVA-FORM-NUMBER               PIC X(10).
          03 EN-UVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
