******************************************************************
*  COPYBOOK  : GUVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : VT
******************************************************************
 01  EN-UVT-ENDORSEMENT.

          03 EN-UVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UVT-FORM-NUMBER               PIC X(10).
          03 EN-UVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-UVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
