******************************************************************
*  COPYBOOK  : GUWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WA
******************************************************************
 01  EN-UWA-ENDORSEMENT.

          03 EN-UWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UWA-FORM-NUMBER               PIC X(10).
          03 EN-UWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-UWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
