******************************************************************
*  COPYBOOK  : GUWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WA
******************************************************************
 01  PT-UWA-PARTY.

          03 PT-UWA-INSURED-NAME              PIC X(40).
          03 PT-UWA-TAX-ID                    PIC X(11).
          03 PT-UWA-ADDRESS-LINE1             PIC X(30).
          03 PT-UWA-ADDRESS-LINE2             PIC X(30).
          03 PT-UWA-CITY                      PIC X(20).
          03 PT-UWA-STATE-CODE                PIC X(2).
          03 PT-UWA-ZIP-CODE                  PIC X(9).
          03 PT-UWA-PHONE                     PIC X(14).
          03 PT-UWA-AGENCY-CODE               PIC X(6).
          03 PT-UWA-AGENT-NAME                PIC X(30).
