******************************************************************
*  COPYBOOK  : GUWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WI
******************************************************************
 01  EN-UWI-ENDORSEMENT.

          03 EN-UWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UWI-FORM-NUMBER               PIC X(10).
          03 EN-UWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-UWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
