******************************************************************
*  COPYBOOK  : GUWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WV
******************************************************************
 01  PT-UWV-PARTY.

          03 PT-UWV-INSURED-NAME              PIC X(40).
          03 PT-UWV-TAX-ID                    PIC X(11).
          03 PT-UWV-ADDRESS-LINE1             PIC X(30).
          03 PT-UWV-ADDRESS-LINE2             PIC X(30).
          03 PT-UWV-CITY                      PIC X(20).
          03 PT-UWV-STATE-CODE                PIC X(2).
          03 PT-UWV-ZIP-CODE                  PIC X(9).
          03 PT-UWV-PHONE                     PIC X(14).
          03 PT-UWV-AGENCY-CODE               PIC X(6).
          03 PT-UWV-AGENT-NAME                PIC X(30).
