******************************************************************
*  COPYBOOK  : GUWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WV
******************************************************************
 01  EN-UWV-ENDORSEMENT.

          03 EN-UWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UWV-FORM-NUMBER               PIC X(10).
          03 EN-UWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-UWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
