******************************************************************
*  COPYBOOK  : GUWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WY
******************************************************************
 01  PT-UWY-PARTY.

          03 PT-UWY-INSURED-NAME              PIC X(40).
          03 PT-UWY-TAX-ID                    PIC X(11).
          03 PT-UWY-ADDRESS-LINE1             PIC X(30).
          03 PT-UWY-ADDRESS-LINE2             PIC X(30).
          03 PT-UWY-CITY                      PIC X(20).
          03 PT-UWY-STATE-CODE                PIC X(2).
          03 PT-UWY-ZIP-CODE                  PIC X(9).
          03 PT-UWY-PHONE                     PIC X(14).
          03 PT-UWY-AGENCY-CODE               PIC X(6).
          03 PT-UWY-AGENT-NAME                PIC X(30).
