******************************************************************
*  COPYBOOK  : GUWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Umbrella and Excess Liability (UM)
*  STATE     : WY
******************************************************************
 01  EN-UWY-ENDORSEMENT.

          03 EN-UWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-UWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-UWY-FORM-NUMBER               PIC X(10).
          03 EN-UWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-UWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
