******************************************************************
*  COPYBOOK  : GRAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AK
******************************************************************
 01  PT-RAK-PARTY.

          03 PT-RAK-INSURED-NAME              PIC X(40).
          03 PT-RAK-TAX-ID                    PIC X(11).
          03 PT-RAK-ADDRESS-LINE1             PIC X(30).
          03 PT-RAK-ADDRESS-LINE2             PIC X(30).
          03 PT-RAK-CITY                      PIC X(20).
          03 PT-RAK-STATE-CODE                PIC X(2).
          03 PT-RAK-ZIP-CODE                  PIC X(9).
          03 PT-RAK-PHONE                     PIC X(14).
          03 PT-RAK-AGENCY-CODE               PIC X(6).
          03 PT-RAK-AGENT-NAME                PIC X(30).
