******************************************************************
*  COPYBOOK  : GRAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AK
******************************************************************
 01  EN-RAK-ENDORSEMENT.

          03 EN-RAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RAK-FORM-NUMBER               PIC X(10).
          03 EN-RAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-RAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
