******************************************************************
*  COPYBOOK  : GRALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AL
******************************************************************
 01  PT-RAL-PARTY.

          03 PT-RAL-INSURED-NAME              PIC X(40).
          03 PT-RAL-TAX-ID                    PIC X(11).
          03 PT-RAL-ADDRESS-LINE1             PIC X(30).
          03 PT-RAL-ADDRESS-LINE2             PIC X(30).
          03 PT-RAL-CITY                      PIC X(20).
          03 PT-RAL-STATE-CODE                PIC X(2).
          03 PT-RAL-ZIP-CODE                  PIC X(9).
          03 PT-RAL-PHONE                     PIC X(14).
          03 PT-RAL-AGENCY-CODE               PIC X(6).
          03 PT-RAL-AGENT-NAME                PIC X(30).
