******************************************************************
*  COPYBOOK  : GRALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AL
******************************************************************
 01  EN-RAL-ENDORSEMENT.

          03 EN-RAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RAL-FORM-NUMBER               PIC X(10).
          03 EN-RAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-RAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
