******************************************************************
*  COPYBOOK  : GRARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AR
******************************************************************
 01  EN-RAR-ENDORSEMENT.

          03 EN-RAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RAR-FORM-NUMBER               PIC X(10).
          03 EN-RAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-RAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
