******************************************************************
*  COPYBOOK  : GRARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AR
******************************************************************
 01  PT-RAR-PARTY.

          03 PT-RAR-INSURED-NAME              PIC X(40).
          03 PT-RAR-TAX-ID                    PIC X(11).
          03 PT-RAR-ADDRESS-LINE1             PIC X(30).
          03 PT-RAR-ADDRESS-LINE2             PIC X(30).
          03 PT-RAR-CITY                      PIC X(20).
          03 PT-RAR-STATE-CODE                PIC X(2).
          03 PT-RAR-ZIP-CODE                  PIC X(9).
          03 PT-RAR-PHONE                     PIC X(14).
          03 PT-RAR-AGENCY-CODE               PIC X(6).
          03 PT-RAR-AGENT-NAME                PIC X(30).
