******************************************************************
*  COPYBOOK  : GRAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AZ
******************************************************************
 01  EN-RAZ-ENDORSEMENT.

          03 EN-RAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RAZ-FORM-NUMBER               PIC X(10).
          03 EN-RAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-RAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
