******************************************************************
*  COPYBOOK  : GRAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : AZ
******************************************************************
 01  PT-RAZ-PARTY.

          03 PT-RAZ-INSURED-NAME              PIC X(40).
          03 PT-RAZ-TAX-ID                    PIC X(11).
          03 PT-RAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-RAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-RAZ-CITY                      PIC X(20).
          03 PT-RAZ-STATE-CODE                PIC X(2).
          03 PT-RAZ-ZIP-CODE                  PIC X(9).
          03 PT-RAZ-PHONE                     PIC X(14).
          03 PT-RAZ-AGENCY-CODE               PIC X(6).
          03 PT-RAZ-AGENT-NAME                PIC X(30).
