******************************************************************
*  COPYBOOK  : GRCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : CA
******************************************************************
 01  EN-RCA-ENDORSEMENT.

          03 EN-RCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RCA-FORM-NUMBER               PIC X(10).
          03 EN-RCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
