******************************************************************
*  COPYBOOK  : GRCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : CA
******************************************************************
 01  PT-RCA-PARTY.

          03 PT-RCA-INSURED-NAME              PIC X(40).
          03 PT-RCA-TAX-ID                    PIC X(11).
          03 PT-RCA-ADDRESS-LINE1             PIC X(30).
          03 PT-RCA-ADDRESS-LINE2             PIC X(30).
          03 PT-RCA-CITY                      PIC X(20).
          03 PT-RCA-STATE-CODE                PIC X(2).
          03 PT-RCA-ZIP-CODE                  PIC X(9).
          03 PT-RCA-PHONE                     PIC X(14).
          03 PT-RCA-AGENCY-CODE               PIC X(6).
          03 PT-RCA-AGENT-NAME                PIC X(30).
