******************************************************************
*  COPYBOOK  : GRCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : CO
******************************************************************
 01  EN-RCO-ENDORSEMENT.

          03 EN-RCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RCO-FORM-NUMBER               PIC X(10).
          03 EN-RCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-RCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
