******************************************************************
*  COPYBOOK  : GRCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : CT
******************************************************************
 01  EN-RCT-ENDORSEMENT.

          03 EN-RCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RCT-FORM-NUMBER               PIC X(10).
          03 EN-RCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-RCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
