******************************************************************
*  COPYBOOK  : GRDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : DC
******************************************************************
 01  EN-RDC-ENDORSEMENT.

          03 EN-RDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RDC-FORM-NUMBER               PIC X(10).
          03 EN-RDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-RDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
