******************************************************************
*  COPYBOOK  : GRDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : DE
******************************************************************
 01  EN-RDE-ENDORSEMENT.

          03 EN-RDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RDE-FORM-NUMBER               PIC X(10).
          03 EN-RDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-RDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
