******************************************************************
*  COPYBOOK  : GRFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : FL
******************************************************************
 01  PT-RFL-PARTY.

          03 PT-RFL-INSURED-NAME              PIC X(40).
          03 PT-RFL-TAX-ID                    PIC X(11).
          03 PT-RFL-ADDRESS-LINE1             PIC X(30).
          03 PT-RFL-ADDRESS-LINE2             PIC X(30).
          03 PT-RFL-CITY                      PIC X(20).
          03 PT-RFL-STATE-CODE                PIC X(2).
          03 PT-RFL-ZIP-CODE                  PIC X(9).
          03 PT-RFL-PHONE                     PIC X(14).
          03 PT-RFL-AGENCY-CODE               PIC X(6).
          03 PT-RFL-AGENT-NAME                PIC X(30).
