******************************************************************
*  COPYBOOK  : GRFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : FL
******************************************************************
 01  EN-RFL-ENDORSEMENT.

          03 EN-RFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RFL-FORM-NUMBER               PIC X(10).
          03 EN-RFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-RFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
