******************************************************************
*  COPYBOOK  : GRGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : GA
******************************************************************
 01  PT-RGA-PARTY.

          03 PT-RGA-INSURED-NAME              PIC X(40).
          03 PT-RGA-TAX-ID                    PIC X(11).
          03 PT-RGA-ADDRESS-LINE1             PIC X(30).
          03 PT-RGA-ADDRESS-LINE2             PIC X(30).
          03 PT-RGA-CITY                      PIC X(20).
          03 PT-RGA-STATE-CODE                PIC X(2).
          03 PT-RGA-ZIP-CODE                  PIC X(9).
          03 PT-RGA-PHONE                     PIC X(14).
          03 PT-RGA-AGENCY-CODE               PIC X(6).
          03 PT-RGA-AGENT-NAME                PIC X(30).
