******************************************************************
*  COPYBOOK  : GRGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : GA
******************************************************************
 01  EN-RGA-ENDORSEMENT.

          03 EN-RGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RGA-FORM-NUMBER               PIC X(10).
          03 EN-RGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
