******************************************************************
*  COPYBOOK  : GRHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : HI
******************************************************************
 01  EN-RHI-ENDORSEMENT.

          03 EN-RHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RHI-FORM-NUMBER               PIC X(10).
          03 EN-RHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-RHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
