******************************************************************
*  COPYBOOK  : GRHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : HI
******************************************************************
 01  PT-RHI-PARTY.

          03 PT-RHI-INSURED-NAME              PIC X(40).
          03 PT-RHI-TAX-ID                    PIC X(11).
          03 PT-RHI-ADDRESS-LINE1             PIC X(30).
          03 PT-RHI-ADDRESS-LINE2             PIC X(30).
          03 PT-RHI-CITY                      PIC X(20).
          03 PT-RHI-STATE-CODE                PIC X(2).
          03 PT-RHI-ZIP-CODE                  PIC X(9).
          03 PT-RHI-PHONE                     PIC X(14).
          03 PT-RHI-AGENCY-CODE               PIC X(6).
          03 PT-RHI-AGENT-NAME                PIC X(30).
