******************************************************************
*  COPYBOOK  : GRIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IA
******************************************************************
 01  EN-RIA-ENDORSEMENT.

          03 EN-RIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RIA-FORM-NUMBER               PIC X(10).
          03 EN-RIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
