******************************************************************
*  COPYBOOK  : GRIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IA
******************************************************************
 01  PT-RIA-PARTY.

          03 PT-RIA-INSURED-NAME              PIC X(40).
          03 PT-RIA-TAX-ID                    PIC X(11).
          03 PT-RIA-ADDRESS-LINE1             PIC X(30).
          03 PT-RIA-ADDRESS-LINE2             PIC X(30).
          03 PT-RIA-CITY                      PIC X(20).
          03 PT-RIA-STATE-CODE                PIC X(2).
          03 PT-RIA-ZIP-CODE                  PIC X(9).
          03 PT-RIA-PHONE                     PIC X(14).
          03 PT-RIA-AGENCY-CODE               PIC X(6).
          03 PT-RIA-AGENT-NAME                PIC X(30).
