******************************************************************
*  COPYBOOK  : GRIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : ID
******************************************************************
 01  EN-RID-ENDORSEMENT.

          03 EN-RID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RID-FORM-NUMBER               PIC X(10).
          03 EN-RID-EFFECTIVE-DATE            PIC X(10).
          03 EN-RID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
