******************************************************************
*  COPYBOOK  : GRILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IL
******************************************************************
 01  EN-RIL-ENDORSEMENT.

          03 EN-RIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RIL-FORM-NUMBER               PIC X(10).
          03 EN-RIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-RIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
