******************************************************************
*  COPYBOOK  : GRILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IL
******************************************************************
 01  PT-RIL-PARTY.

          03 PT-RIL-INSURED-NAME              PIC X(40).
          03 PT-RIL-TAX-ID                    PIC X(11).
          03 PT-RIL-ADDRESS-LINE1             PIC X(30).
          03 PT-RIL-ADDRESS-LINE2             PIC X(30).
          03 PT-RIL-CITY                      PIC X(20).
          03 PT-RIL-STATE-CODE                PIC X(2).
          03 PT-RIL-ZIP-CODE                  PIC X(9).
          03 PT-RIL-PHONE                     PIC X(14).
          03 PT-RIL-AGENCY-CODE               PIC X(6).
          03 PT-RIL-AGENT-NAME                PIC X(30).
