******************************************************************
*  COPYBOOK  : GRINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IN
******************************************************************
 01  PT-RIN-PARTY.

          03 PT-RIN-INSURED-NAME              PIC X(40).
          03 PT-RIN-TAX-ID                    PIC X(11).
          03 PT-RIN-ADDRESS-LINE1             PIC X(30).
          03 PT-RIN-ADDRESS-LINE2             PIC X(30).
          03 PT-RIN-CITY                      PIC X(20).
          03 PT-RIN-STATE-CODE                PIC X(2).
          03 PT-RIN-ZIP-CODE                  PIC X(9).
          03 PT-RIN-PHONE                     PIC X(14).
          03 PT-RIN-AGENCY-CODE               PIC X(6).
          03 PT-RIN-AGENT-NAME                PIC X(30).
