******************************************************************
*  COPYBOOK  : GRINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : IN
******************************************************************
 01  EN-RIN-ENDORSEMENT.

          03 EN-RIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RIN-FORM-NUMBER               PIC X(10).
          03 EN-RIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-RIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
