******************************************************************
*  COPYBOOK  : GRKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : KS
******************************************************************
 01  EN-RKS-ENDORSEMENT.

          03 EN-RKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RKS-FORM-NUMBER               PIC X(10).
          03 EN-RKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-RKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
