******************************************************************
*  COPYBOOK  : GRKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : KS
******************************************************************
 01  PT-RKS-PARTY.

          03 PT-RKS-INSURED-NAME              PIC X(40).
          03 PT-RKS-TAX-ID                    PIC X(11).
          03 PT-RKS-ADDRESS-LINE1             PIC X(30).
          03 PT-RKS-ADDRESS-LINE2             PIC X(30).
          03 PT-RKS-CITY                      PIC X(20).
          03 PT-RKS-STATE-CODE                PIC X(2).
          03 PT-RKS-ZIP-CODE                  PIC X(9).
          03 PT-RKS-PHONE                     PIC X(14).
          03 PT-RKS-AGENCY-CODE               PIC X(6).
          03 PT-RKS-AGENT-NAME                PIC X(30).
