******************************************************************
*  COPYBOOK  : GRKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : KY
******************************************************************
 01  PT-RKY-PARTY.

          03 PT-RKY-INSURED-NAME              PIC X(40).
          03 PT-RKY-TAX-ID                    PIC X(11).
          03 PT-RKY-ADDRESS-LINE1             PIC X(30).
          03 PT-RKY-ADDRESS-LINE2             PIC X(30).
          03 PT-RKY-CITY                      PIC X(20).
          03 PT-RKY-STATE-CODE                PIC X(2).
          03 PT-RKY-ZIP-CODE                  PIC X(9).
          03 PT-RKY-PHONE                     PIC X(14).
          03 PT-RKY-AGENCY-CODE               PIC X(6).
          03 PT-RKY-AGENT-NAME                PIC X(30).
