******************************************************************
*  COPYBOOK  : GRKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : KY
******************************************************************
 01  EN-RKY-ENDORSEMENT.

          03 EN-RKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RKY-FORM-NUMBER               PIC X(10).
          03 EN-RKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-RKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
