******************************************************************
*  COPYBOOK  : GRLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : LA
******************************************************************
 01  EN-RLA-ENDORSEMENT.

          03 EN-RLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RLA-FORM-NUMBER               PIC X(10).
          03 EN-RLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
