******************************************************************
*  COPYBOOK  : GRMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MA
******************************************************************
 01  EN-RMA-ENDORSEMENT.

          03 EN-RMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMA-FORM-NUMBER               PIC X(10).
          03 EN-RMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
