******************************************************************
*  COPYBOOK  : GRMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MD
******************************************************************
 01  EN-RMD-ENDORSEMENT.

          03 EN-RMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMD-FORM-NUMBER               PIC X(10).
          03 EN-RMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
