******************************************************************
*  COPYBOOK  : GRMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : ME
******************************************************************
 01  EN-RME-ENDORSEMENT.

          03 EN-RME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RME-FORM-NUMBER               PIC X(10).
          03 EN-RME-EFFECTIVE-DATE            PIC X(10).
          03 EN-RME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
