******************************************************************
*  COPYBOOK  : GRMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MI
******************************************************************
 01  PT-RMI-PARTY.

          03 PT-RMI-INSURED-NAME              PIC X(40).
          03 PT-RMI-TAX-ID                    PIC X(11).
          03 PT-RMI-ADDRESS-LINE1             PIC X(30).
          03 PT-RMI-ADDRESS-LINE2             PIC X(30).
          03 PT-RMI-CITY                      PIC X(20).
          03 PT-RMI-STATE-CODE                PIC X(2).
          03 PT-RMI-ZIP-CODE                  PIC X(9).
          03 PT-RMI-PHONE                     PIC X(14).
          03 PT-RMI-AGENCY-CODE               PIC X(6).
          03 PT-RMI-AGENT-NAME                PIC X(30).
