******************************************************************
*  COPYBOOK  : GRMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MI
******************************************************************
 01  EN-RMI-ENDORSEMENT.

          03 EN-RMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMI-FORM-NUMBER               PIC X(10).
          03 EN-RMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
