******************************************************************
*  COPYBOOK  : GRMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MN
******************************************************************
 01  EN-RMN-ENDORSEMENT.

          03 EN-RMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMN-FORM-NUMBER               PIC X(10).
          03 EN-RMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
