******************************************************************
*  COPYBOOK  : GRMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MO
******************************************************************
 01  EN-RMO-ENDORSEMENT.

          03 EN-RMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMO-FORM-NUMBER               PIC X(10).
          03 EN-RMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
