******************************************************************
*  COPYBOOK  : GRMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MS
******************************************************************
 01  EN-RMS-ENDORSEMENT.

          03 EN-RMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMS-FORM-NUMBER               PIC X(10).
          03 EN-RMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
