******************************************************************
*  COPYBOOK  : GRMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : MT
******************************************************************
 01  EN-RMT-ENDORSEMENT.

          03 EN-RMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RMT-FORM-NUMBER               PIC X(10).
          03 EN-RMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-RMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
