******************************************************************
*  COPYBOOK  : GRNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NC
******************************************************************
 01  EN-RNC-ENDORSEMENT.

          03 EN-RNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNC-FORM-NUMBER               PIC X(10).
          03 EN-RNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
