******************************************************************
*  COPYBOOK  : GRNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : ND
******************************************************************
 01  EN-RND-ENDORSEMENT.

          03 EN-RND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RND-FORM-NUMBER               PIC X(10).
          03 EN-RND-EFFECTIVE-DATE            PIC X(10).
          03 EN-RND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
