******************************************************************
*  COPYBOOK  : GRNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NE
******************************************************************
 01  EN-RNE-ENDORSEMENT.

          03 EN-RNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNE-FORM-NUMBER               PIC X(10).
          03 EN-RNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
