******************************************************************
*  COPYBOOK  : GRNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NH
******************************************************************
 01  EN-RNH-ENDORSEMENT.

          03 EN-RNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNH-FORM-NUMBER               PIC X(10).
          03 EN-RNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
