******************************************************************
*  COPYBOOK  : GRNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NJ
******************************************************************
 01  PT-RNJ-PARTY.

          03 PT-RNJ-INSURED-NAME              PIC X(40).
          03 PT-RNJ-TAX-ID                    PIC X(11).
          03 PT-RNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-RNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-RNJ-CITY                      PIC X(20).
          03 PT-RNJ-STATE-CODE                PIC X(2).
          03 PT-RNJ-ZIP-CODE                  PIC X(9).
          03 PT-RNJ-PHONE                     PIC X(14).
          03 PT-RNJ-AGENCY-CODE               PIC X(6).
          03 PT-RNJ-AGENT-NAME                PIC X(30).
