******************************************************************
*  COPYBOOK  : GRNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NJ
******************************************************************
 01  EN-RNJ-ENDORSEMENT.

          03 EN-RNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNJ-FORM-NUMBER               PIC X(10).
          03 EN-RNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
