******************************************************************
*  COPYBOOK  : GRNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NM
******************************************************************
 01  EN-RNM-ENDORSEMENT.

          03 EN-RNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNM-FORM-NUMBER               PIC X(10).
          03 EN-RNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
