******************************************************************
*  COPYBOOK  : GRNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NV
******************************************************************
 01  EN-RNV-ENDORSEMENT.

          03 EN-RNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNV-FORM-NUMBER               PIC X(10).
          03 EN-RNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
