******************************************************************
*  COPYBOOK  : GRNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : NY
******************************************************************
 01  EN-RNY-ENDORSEMENT.

          03 EN-RNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RNY-FORM-NUMBER               PIC X(10).
          03 EN-RNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-RNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
