******************************************************************
*  COPYBOOK  : GROHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OH
******************************************************************
 01  PT-ROH-PARTY.

          03 PT-ROH-INSURED-NAME              PIC X(40).
          03 PT-ROH-TAX-ID                    PIC X(11).
          03 PT-ROH-ADDRESS-LINE1             PIC X(30).
          03 PT-ROH-ADDRESS-LINE2             PIC X(30).
          03 PT-ROH-CITY                      PIC X(20).
          03 PT-ROH-STATE-CODE                PIC X(2).
          03 PT-ROH-ZIP-CODE                  PIC X(9).
          03 PT-ROH-PHONE                     PIC X(14).
          03 PT-ROH-AGENCY-CODE               PIC X(6).
          03 PT-ROH-AGENT-NAME                PIC X(30).
