******************************************************************
*  COPYBOOK  : GROHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OH
******************************************************************
 01  EN-ROH-ENDORSEMENT.

          03 EN-ROH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ROH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ROH-FORM-NUMBER               PIC X(10).
          03 EN-ROH-EFFECTIVE-DATE            PIC X(10).
          03 EN-ROH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
