******************************************************************
*  COPYBOOK  : GROKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OK
******************************************************************
 01  EN-ROK-ENDORSEMENT.

          03 EN-ROK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ROK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ROK-FORM-NUMBER               PIC X(10).
          03 EN-ROK-EFFECTIVE-DATE            PIC X(10).
          03 EN-ROK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
