******************************************************************
*  COPYBOOK  : GROKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OK
******************************************************************
 01  PT-ROK-PARTY.

          03 PT-ROK-INSURED-NAME              PIC X(40).
          03 PT-ROK-TAX-ID                    PIC X(11).
          03 PT-ROK-ADDRESS-LINE1             PIC X(30).
          03 PT-ROK-ADDRESS-LINE2             PIC X(30).
          03 PT-ROK-CITY                      PIC X(20).
          03 PT-ROK-STATE-CODE                PIC X(2).
          03 PT-ROK-ZIP-CODE                  PIC X(9).
          03 PT-ROK-PHONE                     PIC X(14).
          03 PT-ROK-AGENCY-CODE               PIC X(6).
          03 PT-ROK-AGENT-NAME                PIC X(30).
