******************************************************************
*  COPYBOOK  : GRORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OR
******************************************************************
 01  EN-ROR-ENDORSEMENT.

          03 EN-ROR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-ROR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-ROR-FORM-NUMBER               PIC X(10).
          03 EN-ROR-EFFECTIVE-DATE            PIC X(10).
          03 EN-ROR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
