******************************************************************
*  COPYBOOK  : GRORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : OR
******************************************************************
 01  PT-ROR-PARTY.

          03 PT-ROR-INSURED-NAME              PIC X(40).
          03 PT-ROR-TAX-ID                    PIC X(11).
          03 PT-ROR-ADDRESS-LINE1             PIC X(30).
          03 PT-ROR-ADDRESS-LINE2             PIC X(30).
          03 PT-ROR-CITY                      PIC X(20).
          03 PT-ROR-STATE-CODE                PIC X(2).
          03 PT-ROR-ZIP-CODE                  PIC X(9).
          03 PT-ROR-PHONE                     PIC X(14).
          03 PT-ROR-AGENCY-CODE               PIC X(6).
          03 PT-ROR-AGENT-NAME                PIC X(30).
