******************************************************************
*  COPYBOOK  : GRPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : PA
******************************************************************
 01  EN-RPA-ENDORSEMENT.

          03 EN-RPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RPA-FORM-NUMBER               PIC X(10).
          03 EN-RPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
