******************************************************************
*  COPYBOOK  : GRRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : RI
******************************************************************
 01  EN-RRI-ENDORSEMENT.

          03 EN-RRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RRI-FORM-NUMBER               PIC X(10).
          03 EN-RRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-RRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
