******************************************************************
*  COPYBOOK  : GRRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : RI
******************************************************************
 01  PT-RRI-PARTY.

          03 PT-RRI-INSURED-NAME              PIC X(40).
          03 PT-RRI-TAX-ID                    PIC X(11).
          03 PT-RRI-ADDRESS-LINE1             PIC X(30).
          03 PT-RRI-ADDRESS-LINE2             PIC X(30).
          03 PT-RRI-CITY                      PIC X(20).
          03 PT-RRI-STATE-CODE                PIC X(2).
          03 PT-RRI-ZIP-CODE                  PIC X(9).
          03 PT-RRI-PHONE                     PIC X(14).
          03 PT-RRI-AGENCY-CODE               PIC X(6).
          03 PT-RRI-AGENT-NAME                PIC X(30).
