******************************************************************
*  COPYBOOK  : GRSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : SC
******************************************************************
 01  EN-RSC-ENDORSEMENT.

          03 EN-RSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RSC-FORM-NUMBER               PIC X(10).
          03 EN-RSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-RSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
