******************************************************************
*  COPYBOOK  : GRSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : SD
******************************************************************
 01  EN-RSD-ENDORSEMENT.

          03 EN-RSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RSD-FORM-NUMBER               PIC X(10).
          03 EN-RSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-RSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
