******************************************************************
*  COPYBOOK  : GRTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : TN
******************************************************************
 01  PT-RTN-PARTY.

          03 PT-RTN-INSURED-NAME              PIC X(40).
          03 PT-RTN-TAX-ID                    PIC X(11).
          03 PT-RTN-ADDRESS-LINE1             PIC X(30).
          03 PT-RTN-ADDRESS-LINE2             PIC X(30).
          03 PT-RTN-CITY                      PIC X(20).
          03 PT-RTN-STATE-CODE                PIC X(2).
          03 PT-RTN-ZIP-CODE                  PIC X(9).
          03 PT-RTN-PHONE                     PIC X(14).
          03 PT-RTN-AGENCY-CODE               PIC X(6).
          03 PT-RTN-AGENT-NAME                PIC X(30).
