******************************************************************
*  COPYBOOK  : GRTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : TN
******************************************************************
 01  EN-RTN-ENDORSEMENT.

          03 EN-RTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RTN-FORM-NUMBER               PIC X(10).
          03 EN-RTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-RTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
