******************************************************************
*  COPYBOOK  : GRTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : TX
******************************************************************
 01  EN-RTX-ENDORSEMENT.

          03 EN-RTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RTX-FORM-NUMBER               PIC X(10).
          03 EN-RTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-RTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
