******************************************************************
*  COPYBOOK  : GRUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : UT
******************************************************************
 01  EN-RUT-ENDORSEMENT.

          03 EN-RUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RUT-FORM-NUMBER               PIC X(10).
          03 EN-RUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-RUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
