******************************************************************
*  COPYBOOK  : GRUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : UT
******************************************************************
 01  PT-RUT-PARTY.

          03 PT-RUT-INSURED-NAME              PIC X(40).
          03 PT-RUT-TAX-ID                    PIC X(11).
          03 PT-RUT-ADDRESS-LINE1             PIC X(30).
          03 PT-RUT-ADDRESS-LINE2             PIC X(30).
          03 PT-RUT-CITY                      PIC X(20).
          03 PT-RUT-STATE-CODE                PIC X(2).
          03 PT-RUT-ZIP-CODE                  PIC X(9).
          03 PT-RUT-PHONE                     PIC X(14).
          03 PT-RUT-AGENCY-CODE               PIC X(6).
          03 PT-RUT-AGENT-NAME                PIC X(30).
