******************************************************************
*  COPYBOOK  : GRVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : VA
******************************************************************
 01  PT-RVA-PARTY.

          03 PT-RVA-INSURED-NAME              PIC X(40).
          03 PT-RVA-TAX-ID                    PIC X(11).
          03 PT-RVA-ADDRESS-LINE1             PIC X(30).
          03 PT-RVA-ADDRESS-LINE2             PIC X(30).
          03 PT-RVA-CITY                      PIC X(20).
          03 PT-RVA-STATE-CODE                PIC X(2).
          03 PT-RVA-ZIP-CODE                  PIC X(9).
          03 PT-RVA-PHONE                     PIC X(14).
          03 PT-RVA-AGENCY-CODE               PIC X(6).
          03 PT-RVA-AGENT-NAME                PIC X(30).
