******************************************************************
*  COPYBOOK  : GRVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : VA
******************************************************************
 01  EN-RVA-ENDORSEMENT.

          03 EN-RVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RVA-FORM-NUMBER               PIC X(10).
          03 EN-RVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
