******************************************************************
*  COPYBOOK  : GRVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : VT
******************************************************************
 01  EN-RVT-ENDORSEMENT.

          03 EN-RVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RVT-FORM-NUMBER               PIC X(10).
          03 EN-RVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-RVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
