******************************************************************
*  COPYBOOK  : GRWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WA
******************************************************************
 01  PT-RWA-PARTY.

          03 PT-RWA-INSURED-NAME              PIC X(40).
          03 PT-RWA-TAX-ID                    PIC X(11).
          03 PT-RWA-ADDRESS-LINE1             PIC X(30).
          03 PT-RWA-ADDRESS-LINE2             PIC X(30).
          03 PT-RWA-CITY                      PIC X(20).
          03 PT-RWA-STATE-CODE                PIC X(2).
          03 PT-RWA-ZIP-CODE                  PIC X(9).
          03 PT-RWA-PHONE                     PIC X(14).
          03 PT-RWA-AGENCY-CODE               PIC X(6).
          03 PT-RWA-AGENT-NAME                PIC X(30).
