******************************************************************
*  COPYBOOK  : GRWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WA
******************************************************************
 01  EN-RWA-ENDORSEMENT.

          03 EN-RWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RWA-FORM-NUMBER               PIC X(10).
          03 EN-RWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-RWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
