******************************************************************
*  COPYBOOK  : GRWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WI
******************************************************************
 01  EN-RWI-ENDORSEMENT.

          03 EN-RWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RWI-FORM-NUMBER               PIC X(10).
          03 EN-RWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-RWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
