******************************************************************
*  COPYBOOK  : GRWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WI
******************************************************************
 01  PT-RWI-PARTY.

          03 PT-RWI-INSURED-NAME              PIC X(40).
          03 PT-RWI-TAX-ID                    PIC X(11).
          03 PT-RWI-ADDRESS-LINE1             PIC X(30).
          03 PT-RWI-ADDRESS-LINE2             PIC X(30).
          03 PT-RWI-CITY                      PIC X(20).
          03 PT-RWI-STATE-CODE                PIC X(2).
          03 PT-RWI-ZIP-CODE                  PIC X(9).
          03 PT-RWI-PHONE                     PIC X(14).
          03 PT-RWI-AGENCY-CODE               PIC X(6).
          03 PT-RWI-AGENT-NAME                PIC X(30).
