******************************************************************
*  COPYBOOK  : GRWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WV
******************************************************************
 01  EN-RWV-ENDORSEMENT.

          03 EN-RWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RWV-FORM-NUMBER               PIC X(10).
          03 EN-RWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-RWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
