******************************************************************
*  COPYBOOK  : GRWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WV
******************************************************************
 01  PT-RWV-PARTY.

          03 PT-RWV-INSURED-NAME              PIC X(40).
          03 PT-RWV-TAX-ID                    PIC X(11).
          03 PT-RWV-ADDRESS-LINE1             PIC X(30).
          03 PT-RWV-ADDRESS-LINE2             PIC X(30).
          03 PT-RWV-CITY                      PIC X(20).
          03 PT-RWV-STATE-CODE                PIC X(2).
          03 PT-RWV-ZIP-CODE                  PIC X(9).
          03 PT-RWV-PHONE                     PIC X(14).
          03 PT-RWV-AGENCY-CODE               PIC X(6).
          03 PT-RWV-AGENT-NAME                PIC X(30).
