******************************************************************
*  COPYBOOK  : GRWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WY
******************************************************************
 01  PT-RWY-PARTY.

          03 PT-RWY-INSURED-NAME              PIC X(40).
          03 PT-RWY-TAX-ID                    PIC X(11).
          03 PT-RWY-ADDRESS-LINE1             PIC X(30).
          03 PT-RWY-ADDRESS-LINE2             PIC X(30).
          03 PT-RWY-CITY                      PIC X(20).
          03 PT-RWY-STATE-CODE                PIC X(2).
          03 PT-RWY-ZIP-CODE                  PIC X(9).
          03 PT-RWY-PHONE                     PIC X(14).
          03 PT-RWY-AGENCY-CODE               PIC X(6).
          03 PT-RWY-AGENT-NAME                PIC X(30).
