******************************************************************
*  COPYBOOK  : GRWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Products and Completed Operations Liability (PC)
*  STATE     : WY
******************************************************************
 01  EN-RWY-ENDORSEMENT.

          03 EN-RWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-RWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-RWY-FORM-NUMBER               PIC X(10).
          03 EN-RWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-RWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
