******************************************************************
*  COPYBOOK  : GCAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AK
******************************************************************
 01  PT-CAK-PARTY.

          03 PT-CAK-INSURED-NAME              PIC X(40).
          03 PT-CAK-TAX-ID                    PIC X(11).
          03 PT-CAK-ADDRESS-LINE1             PIC X(30).
          03 PT-CAK-ADDRESS-LINE2             PIC X(30).
          03 PT-CAK-CITY                      PIC X(20).
          03 PT-CAK-STATE-CODE                PIC X(2).
          03 PT-CAK-ZIP-CODE                  PIC X(9).
          03 PT-CAK-PHONE                     PIC X(14).
          03 PT-CAK-AGENCY-CODE               PIC X(6).
          03 PT-CAK-AGENT-NAME                PIC X(30).
