******************************************************************
*  COPYBOOK  : GCAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AK
******************************************************************
 01  EN-CAK-ENDORSEMENT.

          03 EN-CAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CAK-FORM-NUMBER               PIC X(10).
          03 EN-CAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-CAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
