******************************************************************
*  COPYBOOK  : GCALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AL
******************************************************************
 01  EN-CAL-ENDORSEMENT.

          03 EN-CAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CAL-FORM-NUMBER               PIC X(10).
          03 EN-CAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-CAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
