******************************************************************
*  COPYBOOK  : GCARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AR
******************************************************************
 01  EN-CAR-ENDORSEMENT.

          03 EN-CAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CAR-FORM-NUMBER               PIC X(10).
          03 EN-CAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-CAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
