******************************************************************
*  COPYBOOK  : GCARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AR
******************************************************************
 01  PT-CAR-PARTY.

          03 PT-CAR-INSURED-NAME              PIC X(40).
          03 PT-CAR-TAX-ID                    PIC X(11).
          03 PT-CAR-ADDRESS-LINE1             PIC X(30).
          03 PT-CAR-ADDRESS-LINE2             PIC X(30).
          03 PT-CAR-CITY                      PIC X(20).
          03 PT-CAR-STATE-CODE                PIC X(2).
          03 PT-CAR-ZIP-CODE                  PIC X(9).
          03 PT-CAR-PHONE                     PIC X(14).
          03 PT-CAR-AGENCY-CODE               PIC X(6).
          03 PT-CAR-AGENT-NAME                PIC X(30).
