******************************************************************
*  COPYBOOK  : GCAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AZ
******************************************************************
 01  PT-CAZ-PARTY.

          03 PT-CAZ-INSURED-NAME              PIC X(40).
          03 PT-CAZ-TAX-ID                    PIC X(11).
          03 PT-CAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-CAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-CAZ-CITY                      PIC X(20).
          03 PT-CAZ-STATE-CODE                PIC X(2).
          03 PT-CAZ-ZIP-CODE                  PIC X(9).
          03 PT-CAZ-PHONE                     PIC X(14).
          03 PT-CAZ-AGENCY-CODE               PIC X(6).
          03 PT-CAZ-AGENT-NAME                PIC X(30).
