******************************************************************
*  COPYBOOK  : GCAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : AZ
******************************************************************
 01  EN-CAZ-ENDORSEMENT.

          03 EN-CAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CAZ-FORM-NUMBER               PIC X(10).
          03 EN-CAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-CAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
