******************************************************************
*  COPYBOOK  : GCCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CA
******************************************************************
 01  PT-CCA-PARTY.

          03 PT-CCA-INSURED-NAME              PIC X(40).
          03 PT-CCA-TAX-ID                    PIC X(11).
          03 PT-CCA-ADDRESS-LINE1             PIC X(30).
          03 PT-CCA-ADDRESS-LINE2             PIC X(30).
          03 PT-CCA-CITY                      PIC X(20).
          03 PT-CCA-STATE-CODE                PIC X(2).
          03 PT-CCA-ZIP-CODE                  PIC X(9).
          03 PT-CCA-PHONE                     PIC X(14).
          03 PT-CCA-AGENCY-CODE               PIC X(6).
          03 PT-CCA-AGENT-NAME                PIC X(30).
