******************************************************************
*  COPYBOOK  : GCCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CA
******************************************************************
 01  EN-CCA-ENDORSEMENT.

          03 EN-CCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CCA-FORM-NUMBER               PIC X(10).
          03 EN-CCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
