******************************************************************
*  COPYBOOK  : GCCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CO
******************************************************************
 01  PT-CCO-PARTY.

          03 PT-CCO-INSURED-NAME              PIC X(40).
          03 PT-CCO-TAX-ID                    PIC X(11).
          03 PT-CCO-ADDRESS-LINE1             PIC X(30).
          03 PT-CCO-ADDRESS-LINE2             PIC X(30).
          03 PT-CCO-CITY                      PIC X(20).
          03 PT-CCO-STATE-CODE                PIC X(2).
          03 PT-CCO-ZIP-CODE                  PIC X(9).
          03 PT-CCO-PHONE                     PIC X(14).
          03 PT-CCO-AGENCY-CODE               PIC X(6).
          03 PT-CCO-AGENT-NAME                PIC X(30).
