******************************************************************
*  COPYBOOK  : GCCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CO
******************************************************************
 01  EN-CCO-ENDORSEMENT.

          03 EN-CCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CCO-FORM-NUMBER               PIC X(10).
          03 EN-CCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-CCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
