******************************************************************
*  COPYBOOK  : GCCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CT
******************************************************************
 01  EN-CCT-ENDORSEMENT.

          03 EN-CCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CCT-FORM-NUMBER               PIC X(10).
          03 EN-CCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-CCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
