******************************************************************
*  COPYBOOK  : GCCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : CT
******************************************************************
 01  PT-CCT-PARTY.

          03 PT-CCT-INSURED-NAME              PIC X(40).
          03 PT-CCT-TAX-ID                    PIC X(11).
          03 PT-CCT-ADDRESS-LINE1             PIC X(30).
          03 PT-CCT-ADDRESS-LINE2             PIC X(30).
          03 PT-CCT-CITY                      PIC X(20).
          03 PT-CCT-STATE-CODE                PIC X(2).
          03 PT-CCT-ZIP-CODE                  PIC X(9).
          03 PT-CCT-PHONE                     PIC X(14).
          03 PT-CCT-AGENCY-CODE               PIC X(6).
          03 PT-CCT-AGENT-NAME                PIC X(30).
