******************************************************************
*  COPYBOOK  : GCDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : DC
******************************************************************
 01  EN-CDC-ENDORSEMENT.

          03 EN-CDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CDC-FORM-NUMBER               PIC X(10).
          03 EN-CDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-CDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
