******************************************************************
*  COPYBOOK  : GCDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : DE
******************************************************************
 01  EN-CDE-ENDORSEMENT.

          03 EN-CDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CDE-FORM-NUMBER               PIC X(10).
          03 EN-CDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-CDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
