******************************************************************
*  COPYBOOK  : GCFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : FL
******************************************************************
 01  EN-CFL-ENDORSEMENT.

          03 EN-CFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CFL-FORM-NUMBER               PIC X(10).
          03 EN-CFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-CFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
