******************************************************************
*  COPYBOOK  : GCFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : FL
******************************************************************
 01  PT-CFL-PARTY.

          03 PT-CFL-INSURED-NAME              PIC X(40).
          03 PT-CFL-TAX-ID                    PIC X(11).
          03 PT-CFL-ADDRESS-LINE1             PIC X(30).
          03 PT-CFL-ADDRESS-LINE2             PIC X(30).
          03 PT-CFL-CITY                      PIC X(20).
          03 PT-CFL-STATE-CODE                PIC X(2).
          03 PT-CFL-ZIP-CODE                  PIC X(9).
          03 PT-CFL-PHONE                     PIC X(14).
          03 PT-CFL-AGENCY-CODE               PIC X(6).
          03 PT-CFL-AGENT-NAME                PIC X(30).
