******************************************************************
*  COPYBOOK  : GCGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : GA
******************************************************************
 01  EN-CGA-ENDORSEMENT.

          03 EN-CGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CGA-FORM-NUMBER               PIC X(10).
          03 EN-CGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
