******************************************************************
*  COPYBOOK  : GCHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : HI
******************************************************************
 01  EN-CHI-ENDORSEMENT.

          03 EN-CHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CHI-FORM-NUMBER               PIC X(10).
          03 EN-CHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-CHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
