******************************************************************
*  COPYBOOK  : GCHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : HI
******************************************************************
 01  PT-CHI-PARTY.

          03 PT-CHI-INSURED-NAME              PIC X(40).
          03 PT-CHI-TAX-ID                    PIC X(11).
          03 PT-CHI-ADDRESS-LINE1             PIC X(30).
          03 PT-CHI-ADDRESS-LINE2             PIC X(30).
          03 PT-CHI-CITY                      PIC X(20).
          03 PT-CHI-STATE-CODE                PIC X(2).
          03 PT-CHI-ZIP-CODE                  PIC X(9).
          03 PT-CHI-PHONE                     PIC X(14).
          03 PT-CHI-AGENCY-CODE               PIC X(6).
          03 PT-CHI-AGENT-NAME                PIC X(30).
