******************************************************************
*  COPYBOOK  : GCIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : IA
******************************************************************
 01  EN-CIA-ENDORSEMENT.

          03 EN-CIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CIA-FORM-NUMBER               PIC X(10).
          03 EN-CIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
