******************************************************************
*  COPYBOOK  : GCIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : IA
******************************************************************
 01  PT-CIA-PARTY.

          03 PT-CIA-INSURED-NAME              PIC X(40).
          03 PT-CIA-TAX-ID                    PIC X(11).
          03 PT-CIA-ADDRESS-LINE1             PIC X(30).
          03 PT-CIA-ADDRESS-LINE2             PIC X(30).
          03 PT-CIA-CITY                      PIC X(20).
          03 PT-CIA-STATE-CODE                PIC X(2).
          03 PT-CIA-ZIP-CODE                  PIC X(9).
          03 PT-CIA-PHONE                     PIC X(14).
          03 PT-CIA-AGENCY-CODE               PIC X(6).
          03 PT-CIA-AGENT-NAME                PIC X(30).
