******************************************************************
*  COPYBOOK  : GCILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : IL
******************************************************************
 01  EN-CIL-ENDORSEMENT.

          03 EN-CIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CIL-FORM-NUMBER               PIC X(10).
          03 EN-CIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-CIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
