******************************************************************
*  COPYBOOK  : GCINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : IN
******************************************************************
 01  EN-CIN-ENDORSEMENT.

          03 EN-CIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CIN-FORM-NUMBER               PIC X(10).
          03 EN-CIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-CIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
