******************************************************************
*  COPYBOOK  : GCKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : KS
******************************************************************
 01  EN-CKS-ENDORSEMENT.

          03 EN-CKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CKS-FORM-NUMBER               PIC X(10).
          03 EN-CKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-CKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
