******************************************************************
*  COPYBOOK  : GCKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : KS
******************************************************************
 01  PT-CKS-PARTY.

          03 PT-CKS-INSURED-NAME              PIC X(40).
          03 PT-CKS-TAX-ID                    PIC X(11).
          03 PT-CKS-ADDRESS-LINE1             PIC X(30).
          03 PT-CKS-ADDRESS-LINE2             PIC X(30).
          03 PT-CKS-CITY                      PIC X(20).
          03 PT-CKS-STATE-CODE                PIC X(2).
          03 PT-CKS-ZIP-CODE                  PIC X(9).
          03 PT-CKS-PHONE                     PIC X(14).
          03 PT-CKS-AGENCY-CODE               PIC X(6).
          03 PT-CKS-AGENT-NAME                PIC X(30).
