******************************************************************
*  COPYBOOK  : GCKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : KY
******************************************************************
 01  PT-CKY-PARTY.

          03 PT-CKY-INSURED-NAME              PIC X(40).
          03 PT-CKY-TAX-ID                    PIC X(11).
          03 PT-CKY-ADDRESS-LINE1             PIC X(30).
          03 PT-CKY-ADDRESS-LINE2             PIC X(30).
          03 PT-CKY-CITY                      PIC X(20).
          03 PT-CKY-STATE-CODE                PIC X(2).
          03 PT-CKY-ZIP-CODE                  PIC X(9).
          03 PT-CKY-PHONE                     PIC X(14).
          03 PT-CKY-AGENCY-CODE               PIC X(6).
          03 PT-CKY-AGENT-NAME                PIC X(30).
