******************************************************************
*  COPYBOOK  : GCKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : KY
******************************************************************
 01  EN-CKY-ENDORSEMENT.

          03 EN-CKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CKY-FORM-NUMBER               PIC X(10).
          03 EN-CKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-CKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
