******************************************************************
*  COPYBOOK  : GCLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : LA
******************************************************************
 01  EN-CLA-ENDORSEMENT.

          03 EN-CLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CLA-FORM-NUMBER               PIC X(10).
          03 EN-CLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
