******************************************************************
*  COPYBOOK  : GCMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MA
******************************************************************
 01  EN-CMA-ENDORSEMENT.

          03 EN-CMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMA-FORM-NUMBER               PIC X(10).
          03 EN-CMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
