******************************************************************
*  COPYBOOK  : GCMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MD
******************************************************************
 01  EN-CMD-ENDORSEMENT.

          03 EN-CMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMD-FORM-NUMBER               PIC X(10).
          03 EN-CMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
