******************************************************************
*  COPYBOOK  : GCMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : ME
******************************************************************
 01  EN-CME-ENDORSEMENT.

          03 EN-CME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CME-FORM-NUMBER               PIC X(10).
          03 EN-CME-EFFECTIVE-DATE            PIC X(10).
          03 EN-CME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
