******************************************************************
*  COPYBOOK  : GCMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : ME
******************************************************************
 01  PT-CME-PARTY.

          03 PT-CME-INSURED-NAME              PIC X(40).
          03 PT-CME-TAX-ID                    PIC X(11).
          03 PT-CME-ADDRESS-LINE1             PIC X(30).
          03 PT-CME-ADDRESS-LINE2             PIC X(30).
          03 PT-CME-CITY                      PIC X(20).
          03 PT-CME-STATE-CODE                PIC X(2).
          03 PT-CME-ZIP-CODE                  PIC X(9).
          03 PT-CME-PHONE                     PIC X(14).
          03 PT-CME-AGENCY-CODE               PIC X(6).
          03 PT-CME-AGENT-NAME                PIC X(30).
