******************************************************************
*  COPYBOOK  : GCMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MI
******************************************************************
 01  EN-CMI-ENDORSEMENT.

          03 EN-CMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMI-FORM-NUMBER               PIC X(10).
          03 EN-CMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
