******************************************************************
*  COPYBOOK  : GCMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MI
******************************************************************
 01  PT-CMI-PARTY.

          03 PT-CMI-INSURED-NAME              PIC X(40).
          03 PT-CMI-TAX-ID                    PIC X(11).
          03 PT-CMI-ADDRESS-LINE1             PIC X(30).
          03 PT-CMI-ADDRESS-LINE2             PIC X(30).
          03 PT-CMI-CITY                      PIC X(20).
          03 PT-CMI-STATE-CODE                PIC X(2).
          03 PT-CMI-ZIP-CODE                  PIC X(9).
          03 PT-CMI-PHONE                     PIC X(14).
          03 PT-CMI-AGENCY-CODE               PIC X(6).
          03 PT-CMI-AGENT-NAME                PIC X(30).
