******************************************************************
*  COPYBOOK  : GCMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MN
******************************************************************
 01  EN-CMN-ENDORSEMENT.

          03 EN-CMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMN-FORM-NUMBER               PIC X(10).
          03 EN-CMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
