******************************************************************
*  COPYBOOK  : GCMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MO
******************************************************************
 01  EN-CMO-ENDORSEMENT.

          03 EN-CMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMO-FORM-NUMBER               PIC X(10).
          03 EN-CMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
