******************************************************************
*  COPYBOOK  : GCMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : MT
******************************************************************
 01  EN-CMT-ENDORSEMENT.

          03 EN-CMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CMT-FORM-NUMBER               PIC X(10).
          03 EN-CMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-CMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
