******************************************************************
*  COPYBOOK  : GCNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NC
******************************************************************
 01  EN-CNC-ENDORSEMENT.

          03 EN-CNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNC-FORM-NUMBER               PIC X(10).
          03 EN-CNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
