******************************************************************
*  COPYBOOK  : GCNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : ND
******************************************************************
 01  EN-CND-ENDORSEMENT.

          03 EN-CND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CND-FORM-NUMBER               PIC X(10).
          03 EN-CND-EFFECTIVE-DATE            PIC X(10).
          03 EN-CND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
