******************************************************************
*  COPYBOOK  : GCNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NE
******************************************************************
 01  EN-CNE-ENDORSEMENT.

          03 EN-CNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNE-FORM-NUMBER               PIC X(10).
          03 EN-CNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
