******************************************************************
*  COPYBOOK  : GCNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NE
******************************************************************
 01  PT-CNE-PARTY.

          03 PT-CNE-INSURED-NAME              PIC X(40).
          03 PT-CNE-TAX-ID                    PIC X(11).
          03 PT-CNE-ADDRESS-LINE1             PIC X(30).
          03 PT-CNE-ADDRESS-LINE2             PIC X(30).
          03 PT-CNE-CITY                      PIC X(20).
          03 PT-CNE-STATE-CODE                PIC X(2).
          03 PT-CNE-ZIP-CODE                  PIC X(9).
          03 PT-CNE-PHONE                     PIC X(14).
          03 PT-CNE-AGENCY-CODE               PIC X(6).
          03 PT-CNE-AGENT-NAME                PIC X(30).
