******************************************************************
*  COPYBOOK  : GCNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NH
******************************************************************
 01  EN-CNH-ENDORSEMENT.

          03 EN-CNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNH-FORM-NUMBER               PIC X(10).
          03 EN-CNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
