******************************************************************
*  COPYBOOK  : GCNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NH
******************************************************************
 01  PT-CNH-PARTY.

          03 PT-CNH-INSURED-NAME              PIC X(40).
          03 PT-CNH-TAX-ID                    PIC X(11).
          03 PT-CNH-ADDRESS-LINE1             PIC X(30).
          03 PT-CNH-ADDRESS-LINE2             PIC X(30).
          03 PT-CNH-CITY                      PIC X(20).
          03 PT-CNH-STATE-CODE                PIC X(2).
          03 PT-CNH-ZIP-CODE                  PIC X(9).
          03 PT-CNH-PHONE                     PIC X(14).
          03 PT-CNH-AGENCY-CODE               PIC X(6).
          03 PT-CNH-AGENT-NAME                PIC X(30).
