******************************************************************
*  COPYBOOK  : GCNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NJ
******************************************************************
 01  PT-CNJ-PARTY.

          03 PT-CNJ-INSURED-NAME              PIC X(40).
          03 PT-CNJ-TAX-ID                    PIC X(11).
          03 PT-CNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-CNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-CNJ-CITY                      PIC X(20).
          03 PT-CNJ-STATE-CODE                PIC X(2).
          03 PT-CNJ-ZIP-CODE                  PIC X(9).
          03 PT-CNJ-PHONE                     PIC X(14).
          03 PT-CNJ-AGENCY-CODE               PIC X(6).
          03 PT-CNJ-AGENT-NAME                PIC X(30).
