******************************************************************
*  COPYBOOK  : GCNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NJ
******************************************************************
 01  EN-CNJ-ENDORSEMENT.

          03 EN-CNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNJ-FORM-NUMBER               PIC X(10).
          03 EN-CNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
