******************************************************************
*  COPYBOOK  : GCNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NM
******************************************************************
 01  PT-CNM-PARTY.

          03 PT-CNM-INSURED-NAME              PIC X(40).
          03 PT-CNM-TAX-ID                    PIC X(11).
          03 PT-CNM-ADDRESS-LINE1             PIC X(30).
          03 PT-CNM-ADDRESS-LINE2             PIC X(30).
          03 PT-CNM-CITY                      PIC X(20).
          03 PT-CNM-STATE-CODE                PIC X(2).
          03 PT-CNM-ZIP-CODE                  PIC X(9).
          03 PT-CNM-PHONE                     PIC X(14).
          03 PT-CNM-AGENCY-CODE               PIC X(6).
          03 PT-CNM-AGENT-NAME                PIC X(30).
