******************************************************************
*  COPYBOOK  : GCNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NM
******************************************************************
 01  EN-CNM-ENDORSEMENT.

          03 EN-CNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNM-FORM-NUMBER               PIC X(10).
          03 EN-CNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
