******************************************************************
*  COPYBOOK  : GCNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NY
******************************************************************
 01  EN-CNY-ENDORSEMENT.

          03 EN-CNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CNY-FORM-NUMBER               PIC X(10).
          03 EN-CNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-CNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
