******************************************************************
*  COPYBOOK  : GCNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : NY
******************************************************************
 01  PT-CNY-PARTY.

          03 PT-CNY-INSURED-NAME              PIC X(40).
          03 PT-CNY-TAX-ID                    PIC X(11).
          03 PT-CNY-ADDRESS-LINE1             PIC X(30).
          03 PT-CNY-ADDRESS-LINE2             PIC X(30).
          03 PT-CNY-CITY                      PIC X(20).
          03 PT-CNY-STATE-CODE                PIC X(2).
          03 PT-CNY-ZIP-CODE                  PIC X(9).
          03 PT-CNY-PHONE                     PIC X(14).
          03 PT-CNY-AGENCY-CODE               PIC X(6).
          03 PT-CNY-AGENT-NAME                PIC X(30).
