******************************************************************
*  COPYBOOK  : GCOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : OH
******************************************************************
 01  PT-COH-PARTY.

          03 PT-COH-INSURED-NAME              PIC X(40).
          03 PT-COH-TAX-ID                    PIC X(11).
          03 PT-COH-ADDRESS-LINE1             PIC X(30).
          03 PT-COH-ADDRESS-LINE2             PIC X(30).
          03 PT-COH-CITY                      PIC X(20).
          03 PT-COH-STATE-CODE                PIC X(2).
          03 PT-COH-ZIP-CODE                  PIC X(9).
          03 PT-COH-PHONE                     PIC X(14).
          03 PT-COH-AGENCY-CODE               PIC X(6).
          03 PT-COH-AGENT-NAME                PIC X(30).
