******************************************************************
*  COPYBOOK  : GCOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : OK
******************************************************************
 01  EN-COK-ENDORSEMENT.

          03 EN-COK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-COK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-COK-FORM-NUMBER               PIC X(10).
          03 EN-COK-EFFECTIVE-DATE            PIC X(10).
          03 EN-COK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
