******************************************************************
*  COPYBOOK  : GCOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : OK
******************************************************************
 01  PT-COK-PARTY.

          03 PT-COK-INSURED-NAME              PIC X(40).
          03 PT-COK-TAX-ID                    PIC X(11).
          03 PT-COK-ADDRESS-LINE1             PIC X(30).
          03 PT-COK-ADDRESS-LINE2             PIC X(30).
          03 PT-COK-CITY                      PIC X(20).
          03 PT-COK-STATE-CODE                PIC X(2).
          03 PT-COK-ZIP-CODE                  PIC X(9).
          03 PT-COK-PHONE                     PIC X(14).
          03 PT-COK-AGENCY-CODE               PIC X(6).
          03 PT-COK-AGENT-NAME                PIC X(30).
