******************************************************************
*  COPYBOOK  : GCORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : OR
******************************************************************
 01  EN-COR-ENDORSEMENT.

          03 EN-COR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-COR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-COR-FORM-NUMBER               PIC X(10).
          03 EN-COR-EFFECTIVE-DATE            PIC X(10).
          03 EN-COR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
