******************************************************************
*  COPYBOOK  : GCPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : PA
******************************************************************
 01  EN-CPA-ENDORSEMENT.

          03 EN-CPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CPA-FORM-NUMBER               PIC X(10).
          03 EN-CPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
