******************************************************************
*  COPYBOOK  : GCRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : RI
******************************************************************
 01  PT-CRI-PARTY.

          03 PT-CRI-INSURED-NAME              PIC X(40).
          03 PT-CRI-TAX-ID                    PIC X(11).
          03 PT-CRI-ADDRESS-LINE1             PIC X(30).
          03 PT-CRI-ADDRESS-LINE2             PIC X(30).
          03 PT-CRI-CITY                      PIC X(20).
          03 PT-CRI-STATE-CODE                PIC X(2).
          03 PT-CRI-ZIP-CODE                  PIC X(9).
          03 PT-CRI-PHONE                     PIC X(14).
          03 PT-CRI-AGENCY-CODE               PIC X(6).
          03 PT-CRI-AGENT-NAME                PIC X(30).
