******************************************************************
*  COPYBOOK  : GCRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : RI
******************************************************************
 01  EN-CRI-ENDORSEMENT.

          03 EN-CRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CRI-FORM-NUMBER               PIC X(10).
          03 EN-CRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-CRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
