******************************************************************
*  COPYBOOK  : GCSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : SC
******************************************************************
 01  PT-CSC-PARTY.

          03 PT-CSC-INSURED-NAME              PIC X(40).
          03 PT-CSC-TAX-ID                    PIC X(11).
          03 PT-CSC-ADDRESS-LINE1             PIC X(30).
          03 PT-CSC-ADDRESS-LINE2             PIC X(30).
          03 PT-CSC-CITY                      PIC X(20).
          03 PT-CSC-STATE-CODE                PIC X(2).
          03 PT-CSC-ZIP-CODE                  PIC X(9).
          03 PT-CSC-PHONE                     PIC X(14).
          03 PT-CSC-AGENCY-CODE               PIC X(6).
          03 PT-CSC-AGENT-NAME                PIC X(30).
