******************************************************************
*  COPYBOOK  : GCSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : SC
******************************************************************
 01  EN-CSC-ENDORSEMENT.

          03 EN-CSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CSC-FORM-NUMBER               PIC X(10).
          03 EN-CSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-CSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
