******************************************************************
*  COPYBOOK  : GCSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : SD
******************************************************************
 01  EN-CSD-ENDORSEMENT.

          03 EN-CSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CSD-FORM-NUMBER               PIC X(10).
          03 EN-CSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-CSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
