******************************************************************
*  COPYBOOK  : GCTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : TN
******************************************************************
 01  PT-CTN-PARTY.

          03 PT-CTN-INSURED-NAME              PIC X(40).
          03 PT-CTN-TAX-ID                    PIC X(11).
          03 PT-CTN-ADDRESS-LINE1             PIC X(30).
          03 PT-CTN-ADDRESS-LINE2             PIC X(30).
          03 PT-CTN-CITY                      PIC X(20).
          03 PT-CTN-STATE-CODE                PIC X(2).
          03 PT-CTN-ZIP-CODE                  PIC X(9).
          03 PT-CTN-PHONE                     PIC X(14).
          03 PT-CTN-AGENCY-CODE               PIC X(6).
          03 PT-CTN-AGENT-NAME                PIC X(30).
