******************************************************************
*  COPYBOOK  : GCTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : TN
******************************************************************
 01  EN-CTN-ENDORSEMENT.

          03 EN-CTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CTN-FORM-NUMBER               PIC X(10).
          03 EN-CTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-CTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
