******************************************************************
*  COPYBOOK  : GCTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : TX
******************************************************************
 01  EN-CTX-ENDORSEMENT.

          03 EN-CTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CTX-FORM-NUMBER               PIC X(10).
          03 EN-CTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-CTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
