******************************************************************
*  COPYBOOK  : GCUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : UT
******************************************************************
 01  PT-CUT-PARTY.

          03 PT-CUT-INSURED-NAME              PIC X(40).
          03 PT-CUT-TAX-ID                    PIC X(11).
          03 PT-CUT-ADDRESS-LINE1             PIC X(30).
          03 PT-CUT-ADDRESS-LINE2             PIC X(30).
          03 PT-CUT-CITY                      PIC X(20).
          03 PT-CUT-STATE-CODE                PIC X(2).
          03 PT-CUT-ZIP-CODE                  PIC X(9).
          03 PT-CUT-PHONE                     PIC X(14).
          03 PT-CUT-AGENCY-CODE               PIC X(6).
          03 PT-CUT-AGENT-NAME                PIC X(30).
