******************************************************************
*  COPYBOOK  : GCUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : UT
******************************************************************
 01  EN-CUT-ENDORSEMENT.

          03 EN-CUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CUT-FORM-NUMBER               PIC X(10).
          03 EN-CUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-CUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
