******************************************************************
*  COPYBOOK  : GCVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : VA
******************************************************************
 01  EN-CVA-ENDORSEMENT.

          03 EN-CVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CVA-FORM-NUMBER               PIC X(10).
          03 EN-CVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
