******************************************************************
*  COPYBOOK  : GCVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : VA
******************************************************************
 01  PT-CVA-PARTY.

          03 PT-CVA-INSURED-NAME              PIC X(40).
          03 PT-CVA-TAX-ID                    PIC X(11).
          03 PT-CVA-ADDRESS-LINE1             PIC X(30).
          03 PT-CVA-ADDRESS-LINE2             PIC X(30).
          03 PT-CVA-CITY                      PIC X(20).
          03 PT-CVA-STATE-CODE                PIC X(2).
          03 PT-CVA-ZIP-CODE                  PIC X(9).
          03 PT-CVA-PHONE                     PIC X(14).
          03 PT-CVA-AGENCY-CODE               PIC X(6).
          03 PT-CVA-AGENT-NAME                PIC X(30).
