******************************************************************
*  COPYBOOK  : GCVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : VT
******************************************************************
 01  EN-CVT-ENDORSEMENT.

          03 EN-CVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CVT-FORM-NUMBER               PIC X(10).
          03 EN-CVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-CVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
