******************************************************************
*  COPYBOOK  : GCWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WA
******************************************************************
 01  EN-CWA-ENDORSEMENT.

          03 EN-CWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CWA-FORM-NUMBER               PIC X(10).
          03 EN-CWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-CWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
