******************************************************************
*  COPYBOOK  : GCWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WA
******************************************************************
 01  PT-CWA-PARTY.

          03 PT-CWA-INSURED-NAME              PIC X(40).
          03 PT-CWA-TAX-ID                    PIC X(11).
          03 PT-CWA-ADDRESS-LINE1             PIC X(30).
          03 PT-CWA-ADDRESS-LINE2             PIC X(30).
          03 PT-CWA-CITY                      PIC X(20).
          03 PT-CWA-STATE-CODE                PIC X(2).
          03 PT-CWA-ZIP-CODE                  PIC X(9).
          03 PT-CWA-PHONE                     PIC X(14).
          03 PT-CWA-AGENCY-CODE               PIC X(6).
          03 PT-CWA-AGENT-NAME                PIC X(30).
