******************************************************************
*  COPYBOOK  : GCWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WI
******************************************************************
 01  PT-CWI-PARTY.

          03 PT-CWI-INSURED-NAME              PIC X(40).
          03 PT-CWI-TAX-ID                    PIC X(11).
          03 PT-CWI-ADDRESS-LINE1             PIC X(30).
          03 PT-CWI-ADDRESS-LINE2             PIC X(30).
          03 PT-CWI-CITY                      PIC X(20).
          03 PT-CWI-STATE-CODE                PIC X(2).
          03 PT-CWI-ZIP-CODE                  PIC X(9).
          03 PT-CWI-PHONE                     PIC X(14).
          03 PT-CWI-AGENCY-CODE               PIC X(6).
          03 PT-CWI-AGENT-NAME                PIC X(30).
