******************************************************************
*  COPYBOOK  : GCWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WI
******************************************************************
 01  EN-CWI-ENDORSEMENT.

          03 EN-CWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CWI-FORM-NUMBER               PIC X(10).
          03 EN-CWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-CWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
