******************************************************************
*  COPYBOOK  : GCWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WV
******************************************************************
 01  PT-CWV-PARTY.

          03 PT-CWV-INSURED-NAME              PIC X(40).
          03 PT-CWV-TAX-ID                    PIC X(11).
          03 PT-CWV-ADDRESS-LINE1             PIC X(30).
          03 PT-CWV-ADDRESS-LINE2             PIC X(30).
          03 PT-CWV-CITY                      PIC X(20).
          03 PT-CWV-STATE-CODE                PIC X(2).
          03 PT-CWV-ZIP-CODE                  PIC X(9).
          03 PT-CWV-PHONE                     PIC X(14).
          03 PT-CWV-AGENCY-CODE               PIC X(6).
          03 PT-CWV-AGENT-NAME                PIC X(30).
