******************************************************************
*  COPYBOOK  : GCWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WV
******************************************************************
 01  EN-CWV-ENDORSEMENT.

          03 EN-CWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CWV-FORM-NUMBER               PIC X(10).
          03 EN-CWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-CWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
