******************************************************************
*  COPYBOOK  : GCWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WY
******************************************************************
 01  PT-CWY-PARTY.

          03 PT-CWY-INSURED-NAME              PIC X(40).
          03 PT-CWY-TAX-ID                    PIC X(11).
          03 PT-CWY-ADDRESS-LINE1             PIC X(30).
          03 PT-CWY-ADDRESS-LINE2             PIC X(30).
          03 PT-CWY-CITY                      PIC X(20).
          03 PT-CWY-STATE-CODE                PIC X(2).
          03 PT-CWY-ZIP-CODE                  PIC X(9).
          03 PT-CWY-PHONE                     PIC X(14).
          03 PT-CWY-AGENCY-CODE               PIC X(6).
          03 PT-CWY-AGENT-NAME                PIC X(30).
