******************************************************************
*  COPYBOOK  : GCWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Contractual Liability (CL)
*  STATE     : WY
******************************************************************
 01  EN-CWY-ENDORSEMENT.

          03 EN-CWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-CWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-CWY-FORM-NUMBER               PIC X(10).
          03 EN-CWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-CWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
