******************************************************************
*  COPYBOOK  : GNAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AK
******************************************************************
 01  PT-NAK-PARTY.

          03 PT-NAK-INSURED-NAME              PIC X(40).
          03 PT-NAK-TAX-ID                    PIC X(11).
          03 PT-NAK-ADDRESS-LINE1             PIC X(30).
          03 PT-NAK-ADDRESS-LINE2             PIC X(30).
          03 PT-NAK-CITY                      PIC X(20).
          03 PT-NAK-STATE-CODE                PIC X(2).
          03 PT-NAK-ZIP-CODE                  PIC X(9).
          03 PT-NAK-PHONE                     PIC X(14).
          03 PT-NAK-AGENCY-CODE               PIC X(6).
          03 PT-NAK-AGENT-NAME                PIC X(30).
