******************************************************************
*  COPYBOOK  : GNAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AK
******************************************************************
 01  EN-NAK-ENDORSEMENT.

          03 EN-NAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NAK-FORM-NUMBER               PIC X(10).
          03 EN-NAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-NAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
