******************************************************************
*  COPYBOOK  : GNALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AL
******************************************************************
 01  PT-NAL-PARTY.

          03 PT-NAL-INSURED-NAME              PIC X(40).
          03 PT-NAL-TAX-ID                    PIC X(11).
          03 PT-NAL-ADDRESS-LINE1             PIC X(30).
          03 PT-NAL-ADDRESS-LINE2             PIC X(30).
          03 PT-NAL-CITY                      PIC X(20).
          03 PT-NAL-STATE-CODE                PIC X(2).
          03 PT-NAL-ZIP-CODE                  PIC X(9).
          03 PT-NAL-PHONE                     PIC X(14).
          03 PT-NAL-AGENCY-CODE               PIC X(6).
          03 PT-NAL-AGENT-NAME                PIC X(30).
