******************************************************************
*  COPYBOOK  : GNALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AL
******************************************************************
 01  EN-NAL-ENDORSEMENT.

          03 EN-NAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NAL-FORM-NUMBER               PIC X(10).
          03 EN-NAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-NAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
