******************************************************************
*  COPYBOOK  : GNARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AR
******************************************************************
 01  EN-NAR-ENDORSEMENT.

          03 EN-NAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NAR-FORM-NUMBER               PIC X(10).
          03 EN-NAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-NAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
