******************************************************************
*  COPYBOOK  : GNARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AR
******************************************************************
 01  PT-NAR-PARTY.

          03 PT-NAR-INSURED-NAME              PIC X(40).
          03 PT-NAR-TAX-ID                    PIC X(11).
          03 PT-NAR-ADDRESS-LINE1             PIC X(30).
          03 PT-NAR-ADDRESS-LINE2             PIC X(30).
          03 PT-NAR-CITY                      PIC X(20).
          03 PT-NAR-STATE-CODE                PIC X(2).
          03 PT-NAR-ZIP-CODE                  PIC X(9).
          03 PT-NAR-PHONE                     PIC X(14).
          03 PT-NAR-AGENCY-CODE               PIC X(6).
          03 PT-NAR-AGENT-NAME                PIC X(30).
