******************************************************************
*  COPYBOOK  : GNAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AZ
******************************************************************
 01  EN-NAZ-ENDORSEMENT.

          03 EN-NAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NAZ-FORM-NUMBER               PIC X(10).
          03 EN-NAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-NAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
