******************************************************************
*  COPYBOOK  : GNAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : AZ
******************************************************************
 01  PT-NAZ-PARTY.

          03 PT-NAZ-INSURED-NAME              PIC X(40).
          03 PT-NAZ-TAX-ID                    PIC X(11).
          03 PT-NAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-NAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-NAZ-CITY                      PIC X(20).
          03 PT-NAZ-STATE-CODE                PIC X(2).
          03 PT-NAZ-ZIP-CODE                  PIC X(9).
          03 PT-NAZ-PHONE                     PIC X(14).
          03 PT-NAZ-AGENCY-CODE               PIC X(6).
          03 PT-NAZ-AGENT-NAME                PIC X(30).
