******************************************************************
*  COPYBOOK  : GNCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CA
******************************************************************
 01  PT-NCA-PARTY.

          03 PT-NCA-INSURED-NAME              PIC X(40).
          03 PT-NCA-TAX-ID                    PIC X(11).
          03 PT-NCA-ADDRESS-LINE1             PIC X(30).
          03 PT-NCA-ADDRESS-LINE2             PIC X(30).
          03 PT-NCA-CITY                      PIC X(20).
          03 PT-NCA-STATE-CODE                PIC X(2).
          03 PT-NCA-ZIP-CODE                  PIC X(9).
          03 PT-NCA-PHONE                     PIC X(14).
          03 PT-NCA-AGENCY-CODE               PIC X(6).
          03 PT-NCA-AGENT-NAME                PIC X(30).
