******************************************************************
*  COPYBOOK  : GNCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CA
******************************************************************
 01  EN-NCA-ENDORSEMENT.

          03 EN-NCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NCA-FORM-NUMBER               PIC X(10).
          03 EN-NCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
