******************************************************************
*  COPYBOOK  : GNCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CO
******************************************************************
 01  EN-NCO-ENDORSEMENT.

          03 EN-NCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NCO-FORM-NUMBER               PIC X(10).
          03 EN-NCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-NCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
