******************************************************************
*  COPYBOOK  : GNCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CO
******************************************************************
 01  PT-NCO-PARTY.

          03 PT-NCO-INSURED-NAME              PIC X(40).
          03 PT-NCO-TAX-ID                    PIC X(11).
          03 PT-NCO-ADDRESS-LINE1             PIC X(30).
          03 PT-NCO-ADDRESS-LINE2             PIC X(30).
          03 PT-NCO-CITY                      PIC X(20).
          03 PT-NCO-STATE-CODE                PIC X(2).
          03 PT-NCO-ZIP-CODE                  PIC X(9).
          03 PT-NCO-PHONE                     PIC X(14).
          03 PT-NCO-AGENCY-CODE               PIC X(6).
          03 PT-NCO-AGENT-NAME                PIC X(30).
