******************************************************************
*  COPYBOOK  : GNCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CT
******************************************************************
 01  PT-NCT-PARTY.

          03 PT-NCT-INSURED-NAME              PIC X(40).
          03 PT-NCT-TAX-ID                    PIC X(11).
          03 PT-NCT-ADDRESS-LINE1             PIC X(30).
          03 PT-NCT-ADDRESS-LINE2             PIC X(30).
          03 PT-NCT-CITY                      PIC X(20).
          03 PT-NCT-STATE-CODE                PIC X(2).
          03 PT-NCT-ZIP-CODE                  PIC X(9).
          03 PT-NCT-PHONE                     PIC X(14).
          03 PT-NCT-AGENCY-CODE               PIC X(6).
          03 PT-NCT-AGENT-NAME                PIC X(30).
