******************************************************************
*  COPYBOOK  : GNCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : CT
******************************************************************
 01  EN-NCT-ENDORSEMENT.

          03 EN-NCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NCT-FORM-NUMBER               PIC X(10).
          03 EN-NCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-NCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
