******************************************************************
*  COPYBOOK  : GNDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : DC
******************************************************************
 01  EN-NDC-ENDORSEMENT.

          03 EN-NDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NDC-FORM-NUMBER               PIC X(10).
          03 EN-NDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-NDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
