******************************************************************
*  COPYBOOK  : GNDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : DE
******************************************************************
 01  PT-NDE-PARTY.

          03 PT-NDE-INSURED-NAME              PIC X(40).
          03 PT-NDE-TAX-ID                    PIC X(11).
          03 PT-NDE-ADDRESS-LINE1             PIC X(30).
          03 PT-NDE-ADDRESS-LINE2             PIC X(30).
          03 PT-NDE-CITY                      PIC X(20).
          03 PT-NDE-STATE-CODE                PIC X(2).
          03 PT-NDE-ZIP-CODE                  PIC X(9).
          03 PT-NDE-PHONE                     PIC X(14).
          03 PT-NDE-AGENCY-CODE               PIC X(6).
          03 PT-NDE-AGENT-NAME                PIC X(30).
