******************************************************************
*  COPYBOOK  : GNDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : DE
******************************************************************
 01  EN-NDE-ENDORSEMENT.

          03 EN-NDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NDE-FORM-NUMBER               PIC X(10).
          03 EN-NDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-NDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
