******************************************************************
*  COPYBOOK  : GNFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : FL
******************************************************************
 01  EN-NFL-ENDORSEMENT.

          03 EN-NFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NFL-FORM-NUMBER               PIC X(10).
          03 EN-NFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-NFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
