******************************************************************
*  COPYBOOK  : GNFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : FL
******************************************************************
 01  PT-NFL-PARTY.

          03 PT-NFL-INSURED-NAME              PIC X(40).
          03 PT-NFL-TAX-ID                    PIC X(11).
          03 PT-NFL-ADDRESS-LINE1             PIC X(30).
          03 PT-NFL-ADDRESS-LINE2             PIC X(30).
          03 PT-NFL-CITY                      PIC X(20).
          03 PT-NFL-STATE-CODE                PIC X(2).
          03 PT-NFL-ZIP-CODE                  PIC X(9).
          03 PT-NFL-PHONE                     PIC X(14).
          03 PT-NFL-AGENCY-CODE               PIC X(6).
          03 PT-NFL-AGENT-NAME                PIC X(30).
