******************************************************************
*  COPYBOOK  : GNGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : GA
******************************************************************
 01  PT-NGA-PARTY.

          03 PT-NGA-INSURED-NAME              PIC X(40).
          03 PT-NGA-TAX-ID                    PIC X(11).
          03 PT-NGA-ADDRESS-LINE1             PIC X(30).
          03 PT-NGA-ADDRESS-LINE2             PIC X(30).
          03 PT-NGA-CITY                      PIC X(20).
          03 PT-NGA-STATE-CODE                PIC X(2).
          03 PT-NGA-ZIP-CODE                  PIC X(9).
          03 PT-NGA-PHONE                     PIC X(14).
          03 PT-NGA-AGENCY-CODE               PIC X(6).
          03 PT-NGA-AGENT-NAME                PIC X(30).
