******************************************************************
*  COPYBOOK  : GNGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : GA
******************************************************************
 01  EN-NGA-ENDORSEMENT.

          03 EN-NGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NGA-FORM-NUMBER               PIC X(10).
          03 EN-NGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
