******************************************************************
*  COPYBOOK  : GNHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : HI
******************************************************************
 01  EN-NHI-ENDORSEMENT.

          03 EN-NHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NHI-FORM-NUMBER               PIC X(10).
          03 EN-NHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-NHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
