******************************************************************
*  COPYBOOK  : GNIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IA
******************************************************************
 01  PT-NIA-PARTY.

          03 PT-NIA-INSURED-NAME              PIC X(40).
          03 PT-NIA-TAX-ID                    PIC X(11).
          03 PT-NIA-ADDRESS-LINE1             PIC X(30).
          03 PT-NIA-ADDRESS-LINE2             PIC X(30).
          03 PT-NIA-CITY                      PIC X(20).
          03 PT-NIA-STATE-CODE                PIC X(2).
          03 PT-NIA-ZIP-CODE                  PIC X(9).
          03 PT-NIA-PHONE                     PIC X(14).
          03 PT-NIA-AGENCY-CODE               PIC X(6).
          03 PT-NIA-AGENT-NAME                PIC X(30).
