******************************************************************
*  COPYBOOK  : GNIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IA
******************************************************************
 01  EN-NIA-ENDORSEMENT.

          03 EN-NIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NIA-FORM-NUMBER               PIC X(10).
          03 EN-NIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
