******************************************************************
*  COPYBOOK  : GNIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ID
******************************************************************
 01  EN-NID-ENDORSEMENT.

          03 EN-NID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NID-FORM-NUMBER               PIC X(10).
          03 EN-NID-EFFECTIVE-DATE            PIC X(10).
          03 EN-NID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
