******************************************************************
*  COPYBOOK  : GNIDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ID
******************************************************************
 01  PT-NID-PARTY.

          03 PT-NID-INSURED-NAME              PIC X(40).
          03 PT-NID-TAX-ID                    PIC X(11).
          03 PT-NID-ADDRESS-LINE1             PIC X(30).
          03 PT-NID-ADDRESS-LINE2             PIC X(30).
          03 PT-NID-CITY                      PIC X(20).
          03 PT-NID-STATE-CODE                PIC X(2).
          03 PT-NID-ZIP-CODE                  PIC X(9).
          03 PT-NID-PHONE                     PIC X(14).
          03 PT-NID-AGENCY-CODE               PIC X(6).
          03 PT-NID-AGENT-NAME                PIC X(30).
