******************************************************************
*  COPYBOOK  : GNILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IL
******************************************************************
 01  EN-NIL-ENDORSEMENT.

          03 EN-NIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NIL-FORM-NUMBER               PIC X(10).
          03 EN-NIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-NIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
