******************************************************************
*  COPYBOOK  : GNILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IL
******************************************************************
 01  PT-NIL-PARTY.

          03 PT-NIL-INSURED-NAME              PIC X(40).
          03 PT-NIL-TAX-ID                    PIC X(11).
          03 PT-NIL-ADDRESS-LINE1             PIC X(30).
          03 PT-NIL-ADDRESS-LINE2             PIC X(30).
          03 PT-NIL-CITY                      PIC X(20).
          03 PT-NIL-STATE-CODE                PIC X(2).
          03 PT-NIL-ZIP-CODE                  PIC X(9).
          03 PT-NIL-PHONE                     PIC X(14).
          03 PT-NIL-AGENCY-CODE               PIC X(6).
          03 PT-NIL-AGENT-NAME                PIC X(30).
