******************************************************************
*  COPYBOOK  : GNINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IN
******************************************************************
 01  EN-NIN-ENDORSEMENT.

          03 EN-NIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NIN-FORM-NUMBER               PIC X(10).
          03 EN-NIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-NIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
