******************************************************************
*  COPYBOOK  : GNINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : IN
******************************************************************
 01  PT-NIN-PARTY.

          03 PT-NIN-INSURED-NAME              PIC X(40).
          03 PT-NIN-TAX-ID                    PIC X(11).
          03 PT-NIN-ADDRESS-LINE1             PIC X(30).
          03 PT-NIN-ADDRESS-LINE2             PIC X(30).
          03 PT-NIN-CITY                      PIC X(20).
          03 PT-NIN-STATE-CODE                PIC X(2).
          03 PT-NIN-ZIP-CODE                  PIC X(9).
          03 PT-NIN-PHONE                     PIC X(14).
          03 PT-NIN-AGENCY-CODE               PIC X(6).
          03 PT-NIN-AGENT-NAME                PIC X(30).
