******************************************************************
*  COPYBOOK  : GNKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : KS
******************************************************************
 01  PT-NKS-PARTY.

          03 PT-NKS-INSURED-NAME              PIC X(40).
          03 PT-NKS-TAX-ID                    PIC X(11).
          03 PT-NKS-ADDRESS-LINE1             PIC X(30).
          03 PT-NKS-ADDRESS-LINE2             PIC X(30).
          03 PT-NKS-CITY                      PIC X(20).
          03 PT-NKS-STATE-CODE                PIC X(2).
          03 PT-NKS-ZIP-CODE                  PIC X(9).
          03 PT-NKS-PHONE                     PIC X(14).
          03 PT-NKS-AGENCY-CODE               PIC X(6).
          03 PT-NKS-AGENT-NAME                PIC X(30).
