******************************************************************
*  COPYBOOK  : GNKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : KS
******************************************************************
 01  EN-NKS-ENDORSEMENT.

          03 EN-NKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NKS-FORM-NUMBER               PIC X(10).
          03 EN-NKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-NKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
