******************************************************************
*  COPYBOOK  : GNKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : KY
******************************************************************
 01  EN-NKY-ENDORSEMENT.

          03 EN-NKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NKY-FORM-NUMBER               PIC X(10).
          03 EN-NKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-NKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
