******************************************************************
*  COPYBOOK  : GNKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : KY
******************************************************************
 01  PT-NKY-PARTY.

          03 PT-NKY-INSURED-NAME              PIC X(40).
          03 PT-NKY-TAX-ID                    PIC X(11).
          03 PT-NKY-ADDRESS-LINE1             PIC X(30).
          03 PT-NKY-ADDRESS-LINE2             PIC X(30).
          03 PT-NKY-CITY                      PIC X(20).
          03 PT-NKY-STATE-CODE                PIC X(2).
          03 PT-NKY-ZIP-CODE                  PIC X(9).
          03 PT-NKY-PHONE                     PIC X(14).
          03 PT-NKY-AGENCY-CODE               PIC X(6).
          03 PT-NKY-AGENT-NAME                PIC X(30).
