******************************************************************
*  COPYBOOK  : GNLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : LA
******************************************************************
 01  EN-NLA-ENDORSEMENT.

          03 EN-NLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NLA-FORM-NUMBER               PIC X(10).
          03 EN-NLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
