******************************************************************
*  COPYBOOK  : GNLAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : LA
******************************************************************
 01  PT-NLA-PARTY.

          03 PT-NLA-INSURED-NAME              PIC X(40).
          03 PT-NLA-TAX-ID                    PIC X(11).
          03 PT-NLA-ADDRESS-LINE1             PIC X(30).
          03 PT-NLA-ADDRESS-LINE2             PIC X(30).
          03 PT-NLA-CITY                      PIC X(20).
          03 PT-NLA-STATE-CODE                PIC X(2).
          03 PT-NLA-ZIP-CODE                  PIC X(9).
          03 PT-NLA-PHONE                     PIC X(14).
          03 PT-NLA-AGENCY-CODE               PIC X(6).
          03 PT-NLA-AGENT-NAME                PIC X(30).
