******************************************************************
*  COPYBOOK  : GNMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MA
******************************************************************
 01  EN-NMA-ENDORSEMENT.

          03 EN-NMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMA-FORM-NUMBER               PIC X(10).
          03 EN-NMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
