******************************************************************
*  COPYBOOK  : GNMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MA
******************************************************************
 01  PT-NMA-PARTY.

          03 PT-NMA-INSURED-NAME              PIC X(40).
          03 PT-NMA-TAX-ID                    PIC X(11).
          03 PT-NMA-ADDRESS-LINE1             PIC X(30).
          03 PT-NMA-ADDRESS-LINE2             PIC X(30).
          03 PT-NMA-CITY                      PIC X(20).
          03 PT-NMA-STATE-CODE                PIC X(2).
          03 PT-NMA-ZIP-CODE                  PIC X(9).
          03 PT-NMA-PHONE                     PIC X(14).
          03 PT-NMA-AGENCY-CODE               PIC X(6).
          03 PT-NMA-AGENT-NAME                PIC X(30).
