******************************************************************
*  COPYBOOK  : GNMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MD
******************************************************************
 01  EN-NMD-ENDORSEMENT.

          03 EN-NMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMD-FORM-NUMBER               PIC X(10).
          03 EN-NMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
