******************************************************************
*  COPYBOOK  : GNMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ME
******************************************************************
 01  EN-NME-ENDORSEMENT.

          03 EN-NME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NME-FORM-NUMBER               PIC X(10).
          03 EN-NME-EFFECTIVE-DATE            PIC X(10).
          03 EN-NME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
