******************************************************************
*  COPYBOOK  : GNMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ME
******************************************************************
 01  PT-NME-PARTY.

          03 PT-NME-INSURED-NAME              PIC X(40).
          03 PT-NME-TAX-ID                    PIC X(11).
          03 PT-NME-ADDRESS-LINE1             PIC X(30).
          03 PT-NME-ADDRESS-LINE2             PIC X(30).
          03 PT-NME-CITY                      PIC X(20).
          03 PT-NME-STATE-CODE                PIC X(2).
          03 PT-NME-ZIP-CODE                  PIC X(9).
          03 PT-NME-PHONE                     PIC X(14).
          03 PT-NME-AGENCY-CODE               PIC X(6).
          03 PT-NME-AGENT-NAME                PIC X(30).
