******************************************************************
*  COPYBOOK  : GNMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MI
******************************************************************
 01  PT-NMI-PARTY.

          03 PT-NMI-INSURED-NAME              PIC X(40).
          03 PT-NMI-TAX-ID                    PIC X(11).
          03 PT-NMI-ADDRESS-LINE1             PIC X(30).
          03 PT-NMI-ADDRESS-LINE2             PIC X(30).
          03 PT-NMI-CITY                      PIC X(20).
          03 PT-NMI-STATE-CODE                PIC X(2).
          03 PT-NMI-ZIP-CODE                  PIC X(9).
          03 PT-NMI-PHONE                     PIC X(14).
          03 PT-NMI-AGENCY-CODE               PIC X(6).
          03 PT-NMI-AGENT-NAME                PIC X(30).
