******************************************************************
*  COPYBOOK  : GNMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MI
******************************************************************
 01  EN-NMI-ENDORSEMENT.

          03 EN-NMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMI-FORM-NUMBER               PIC X(10).
          03 EN-NMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
