******************************************************************
*  COPYBOOK  : GNMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MN
******************************************************************
 01  EN-NMN-ENDORSEMENT.

          03 EN-NMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMN-FORM-NUMBER               PIC X(10).
          03 EN-NMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
