******************************************************************
*  COPYBOOK  : GNMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MN
******************************************************************
 01  PT-NMN-PARTY.

          03 PT-NMN-INSURED-NAME              PIC X(40).
          03 PT-NMN-TAX-ID                    PIC X(11).
          03 PT-NMN-ADDRESS-LINE1             PIC X(30).
          03 PT-NMN-ADDRESS-LINE2             PIC X(30).
          03 PT-NMN-CITY                      PIC X(20).
          03 PT-NMN-STATE-CODE                PIC X(2).
          03 PT-NMN-ZIP-CODE                  PIC X(9).
          03 PT-NMN-PHONE                     PIC X(14).
          03 PT-NMN-AGENCY-CODE               PIC X(6).
          03 PT-NMN-AGENT-NAME                PIC X(30).
