******************************************************************
*  COPYBOOK  : GNMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MO
******************************************************************
 01  PT-NMO-PARTY.

          03 PT-NMO-INSURED-NAME              PIC X(40).
          03 PT-NMO-TAX-ID                    PIC X(11).
          03 PT-NMO-ADDRESS-LINE1             PIC X(30).
          03 PT-NMO-ADDRESS-LINE2             PIC X(30).
          03 PT-NMO-CITY                      PIC X(20).
          03 PT-NMO-STATE-CODE                PIC X(2).
          03 PT-NMO-ZIP-CODE                  PIC X(9).
          03 PT-NMO-PHONE                     PIC X(14).
          03 PT-NMO-AGENCY-CODE               PIC X(6).
          03 PT-NMO-AGENT-NAME                PIC X(30).
