******************************************************************
*  COPYBOOK  : GNMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MO
******************************************************************
 01  EN-NMO-ENDORSEMENT.

          03 EN-NMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMO-FORM-NUMBER               PIC X(10).
          03 EN-NMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
