******************************************************************
*  COPYBOOK  : GNMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MS
******************************************************************
 01  EN-NMS-ENDORSEMENT.

          03 EN-NMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMS-FORM-NUMBER               PIC X(10).
          03 EN-NMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
