******************************************************************
*  COPYBOOK  : GNMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MT
******************************************************************
 01  EN-NMT-ENDORSEMENT.

          03 EN-NMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NMT-FORM-NUMBER               PIC X(10).
          03 EN-NMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-NMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
