******************************************************************
*  COPYBOOK  : GNMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : MT
******************************************************************
 01  PT-NMT-PARTY.

          03 PT-NMT-INSURED-NAME              PIC X(40).
          03 PT-NMT-TAX-ID                    PIC X(11).
          03 PT-NMT-ADDRESS-LINE1             PIC X(30).
          03 PT-NMT-ADDRESS-LINE2             PIC X(30).
          03 PT-NMT-CITY                      PIC X(20).
          03 PT-NMT-STATE-CODE                PIC X(2).
          03 PT-NMT-ZIP-CODE                  PIC X(9).
          03 PT-NMT-PHONE                     PIC X(14).
          03 PT-NMT-AGENCY-CODE               PIC X(6).
          03 PT-NMT-AGENT-NAME                PIC X(30).
