******************************************************************
*  COPYBOOK  : GNNCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NC
******************************************************************
 01  PT-NNC-PARTY.

          03 PT-NNC-INSURED-NAME              PIC X(40).
          03 PT-NNC-TAX-ID                    PIC X(11).
          03 PT-NNC-ADDRESS-LINE1             PIC X(30).
          03 PT-NNC-ADDRESS-LINE2             PIC X(30).
          03 PT-NNC-CITY                      PIC X(20).
          03 PT-NNC-STATE-CODE                PIC X(2).
          03 PT-NNC-ZIP-CODE                  PIC X(9).
          03 PT-NNC-PHONE                     PIC X(14).
          03 PT-NNC-AGENCY-CODE               PIC X(6).
          03 PT-NNC-AGENT-NAME                PIC X(30).
