******************************************************************
*  COPYBOOK  : GNNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NC
******************************************************************
 01  EN-NNC-ENDORSEMENT.

          03 EN-NNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNC-FORM-NUMBER               PIC X(10).
          03 EN-NNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
