******************************************************************
*  COPYBOOK  : GNNDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ND
******************************************************************
 01  PT-NND-PARTY.

          03 PT-NND-INSURED-NAME              PIC X(40).
          03 PT-NND-TAX-ID                    PIC X(11).
          03 PT-NND-ADDRESS-LINE1             PIC X(30).
          03 PT-NND-ADDRESS-LINE2             PIC X(30).
          03 PT-NND-CITY                      PIC X(20).
          03 PT-NND-STATE-CODE                PIC X(2).
          03 PT-NND-ZIP-CODE                  PIC X(9).
          03 PT-NND-PHONE                     PIC X(14).
          03 PT-NND-AGENCY-CODE               PIC X(6).
          03 PT-NND-AGENT-NAME                PIC X(30).
