******************************************************************
*  COPYBOOK  : GNNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : ND
******************************************************************
 01  EN-NND-ENDORSEMENT.

          03 EN-NND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NND-FORM-NUMBER               PIC X(10).
          03 EN-NND-EFFECTIVE-DATE            PIC X(10).
          03 EN-NND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
