******************************************************************
*  COPYBOOK  : GNNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NE
******************************************************************
 01  EN-NNE-ENDORSEMENT.

          03 EN-NNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNE-FORM-NUMBER               PIC X(10).
          03 EN-NNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
