******************************************************************
*  COPYBOOK  : GNNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NE
******************************************************************
 01  PT-NNE-PARTY.

          03 PT-NNE-INSURED-NAME              PIC X(40).
          03 PT-NNE-TAX-ID                    PIC X(11).
          03 PT-NNE-ADDRESS-LINE1             PIC X(30).
          03 PT-NNE-ADDRESS-LINE2             PIC X(30).
          03 PT-NNE-CITY                      PIC X(20).
          03 PT-NNE-STATE-CODE                PIC X(2).
          03 PT-NNE-ZIP-CODE                  PIC X(9).
          03 PT-NNE-PHONE                     PIC X(14).
          03 PT-NNE-AGENCY-CODE               PIC X(6).
          03 PT-NNE-AGENT-NAME                PIC X(30).
