******************************************************************
*  COPYBOOK  : GNNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NH
******************************************************************
 01  EN-NNH-ENDORSEMENT.

          03 EN-NNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNH-FORM-NUMBER               PIC X(10).
          03 EN-NNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
