******************************************************************
*  COPYBOOK  : GNNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NJ
******************************************************************
 01  EN-NNJ-ENDORSEMENT.

          03 EN-NNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNJ-FORM-NUMBER               PIC X(10).
          03 EN-NNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
