******************************************************************
*  COPYBOOK  : GNNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NJ
******************************************************************
 01  PT-NNJ-PARTY.

          03 PT-NNJ-INSURED-NAME              PIC X(40).
          03 PT-NNJ-TAX-ID                    PIC X(11).
          03 PT-NNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-NNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-NNJ-CITY                      PIC X(20).
          03 PT-NNJ-STATE-CODE                PIC X(2).
          03 PT-NNJ-ZIP-CODE                  PIC X(9).
          03 PT-NNJ-PHONE                     PIC X(14).
          03 PT-NNJ-AGENCY-CODE               PIC X(6).
          03 PT-NNJ-AGENT-NAME                PIC X(30).
