******************************************************************
*  COPYBOOK  : GNNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NM
******************************************************************
 01  EN-NNM-ENDORSEMENT.

          03 EN-NNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNM-FORM-NUMBER               PIC X(10).
          03 EN-NNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
