******************************************************************
*  COPYBOOK  : GNNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NM
******************************************************************
 01  PT-NNM-PARTY.

          03 PT-NNM-INSURED-NAME              PIC X(40).
          03 PT-NNM-TAX-ID                    PIC X(11).
          03 PT-NNM-ADDRESS-LINE1             PIC X(30).
          03 PT-NNM-ADDRESS-LINE2             PIC X(30).
          03 PT-NNM-CITY                      PIC X(20).
          03 PT-NNM-STATE-CODE                PIC X(2).
          03 PT-NNM-ZIP-CODE                  PIC X(9).
          03 PT-NNM-PHONE                     PIC X(14).
          03 PT-NNM-AGENCY-CODE               PIC X(6).
          03 PT-NNM-AGENT-NAME                PIC X(30).
