******************************************************************
*  COPYBOOK  : GNNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NV
******************************************************************
 01  EN-NNV-ENDORSEMENT.

          03 EN-NNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNV-FORM-NUMBER               PIC X(10).
          03 EN-NNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
