******************************************************************
*  COPYBOOK  : GNNVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NV
******************************************************************
 01  PT-NNV-PARTY.

          03 PT-NNV-INSURED-NAME              PIC X(40).
          03 PT-NNV-TAX-ID                    PIC X(11).
          03 PT-NNV-ADDRESS-LINE1             PIC X(30).
          03 PT-NNV-ADDRESS-LINE2             PIC X(30).
          03 PT-NNV-CITY                      PIC X(20).
          03 PT-NNV-STATE-CODE                PIC X(2).
          03 PT-NNV-ZIP-CODE                  PIC X(9).
          03 PT-NNV-PHONE                     PIC X(14).
          03 PT-NNV-AGENCY-CODE               PIC X(6).
          03 PT-NNV-AGENT-NAME                PIC X(30).
