******************************************************************
*  COPYBOOK  : GNNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NY
******************************************************************
 01  PT-NNY-PARTY.

          03 PT-NNY-INSURED-NAME              PIC X(40).
          03 PT-NNY-TAX-ID                    PIC X(11).
          03 PT-NNY-ADDRESS-LINE1             PIC X(30).
          03 PT-NNY-ADDRESS-LINE2             PIC X(30).
          03 PT-NNY-CITY                      PIC X(20).
          03 PT-NNY-STATE-CODE                PIC X(2).
          03 PT-NNY-ZIP-CODE                  PIC X(9).
          03 PT-NNY-PHONE                     PIC X(14).
          03 PT-NNY-AGENCY-CODE               PIC X(6).
          03 PT-NNY-AGENT-NAME                PIC X(30).
