******************************************************************
*  COPYBOOK  : GNNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : NY
******************************************************************
 01  EN-NNY-ENDORSEMENT.

          03 EN-NNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NNY-FORM-NUMBER               PIC X(10).
          03 EN-NNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-NNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
