******************************************************************
*  COPYBOOK  : GNOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OH
******************************************************************
 01  PT-NOH-PARTY.

          03 PT-NOH-INSURED-NAME              PIC X(40).
          03 PT-NOH-TAX-ID                    PIC X(11).
          03 PT-NOH-ADDRESS-LINE1             PIC X(30).
          03 PT-NOH-ADDRESS-LINE2             PIC X(30).
          03 PT-NOH-CITY                      PIC X(20).
          03 PT-NOH-STATE-CODE                PIC X(2).
          03 PT-NOH-ZIP-CODE                  PIC X(9).
          03 PT-NOH-PHONE                     PIC X(14).
          03 PT-NOH-AGENCY-CODE               PIC X(6).
          03 PT-NOH-AGENT-NAME                PIC X(30).
