******************************************************************
*  COPYBOOK  : GNOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OH
******************************************************************
 01  EN-NOH-ENDORSEMENT.

          03 EN-NOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NOH-FORM-NUMBER               PIC X(10).
          03 EN-NOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-NOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
