******************************************************************
*  COPYBOOK  : GNOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OK
******************************************************************
 01  EN-NOK-ENDORSEMENT.

          03 EN-NOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NOK-FORM-NUMBER               PIC X(10).
          03 EN-NOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-NOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
