******************************************************************
*  COPYBOOK  : GNOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OK
******************************************************************
 01  PT-NOK-PARTY.

          03 PT-NOK-INSURED-NAME              PIC X(40).
          03 PT-NOK-TAX-ID                    PIC X(11).
          03 PT-NOK-ADDRESS-LINE1             PIC X(30).
          03 PT-NOK-ADDRESS-LINE2             PIC X(30).
          03 PT-NOK-CITY                      PIC X(20).
          03 PT-NOK-STATE-CODE                PIC X(2).
          03 PT-NOK-ZIP-CODE                  PIC X(9).
          03 PT-NOK-PHONE                     PIC X(14).
          03 PT-NOK-AGENCY-CODE               PIC X(6).
          03 PT-NOK-AGENT-NAME                PIC X(30).
