******************************************************************
*  COPYBOOK  : GNORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OR
******************************************************************
 01  EN-NOR-ENDORSEMENT.

          03 EN-NOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NOR-FORM-NUMBER               PIC X(10).
          03 EN-NOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-NOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
