******************************************************************
*  COPYBOOK  : GNORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : OR
******************************************************************
 01  PT-NOR-PARTY.

          03 PT-NOR-INSURED-NAME              PIC X(40).
          03 PT-NOR-TAX-ID                    PIC X(11).
          03 PT-NOR-ADDRESS-LINE1             PIC X(30).
          03 PT-NOR-ADDRESS-LINE2             PIC X(30).
          03 PT-NOR-CITY                      PIC X(20).
          03 PT-NOR-STATE-CODE                PIC X(2).
          03 PT-NOR-ZIP-CODE                  PIC X(9).
          03 PT-NOR-PHONE                     PIC X(14).
          03 PT-NOR-AGENCY-CODE               PIC X(6).
          03 PT-NOR-AGENT-NAME                PIC X(30).
