******************************************************************
*  COPYBOOK  : GNPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : PA
******************************************************************
 01  EN-NPA-ENDORSEMENT.

          03 EN-NPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NPA-FORM-NUMBER               PIC X(10).
          03 EN-NPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
