******************************************************************
*  COPYBOOK  : GNRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : RI
******************************************************************
 01  EN-NRI-ENDORSEMENT.

          03 EN-NRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NRI-FORM-NUMBER               PIC X(10).
          03 EN-NRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-NRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
