******************************************************************
*  COPYBOOK  : GNSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : SC
******************************************************************
 01  PT-NSC-PARTY.

          03 PT-NSC-INSURED-NAME              PIC X(40).
          03 PT-NSC-TAX-ID                    PIC X(11).
          03 PT-NSC-ADDRESS-LINE1             PIC X(30).
          03 PT-NSC-ADDRESS-LINE2             PIC X(30).
          03 PT-NSC-CITY                      PIC X(20).
          03 PT-NSC-STATE-CODE                PIC X(2).
          03 PT-NSC-ZIP-CODE                  PIC X(9).
          03 PT-NSC-PHONE                     PIC X(14).
          03 PT-NSC-AGENCY-CODE               PIC X(6).
          03 PT-NSC-AGENT-NAME                PIC X(30).
