******************************************************************
*  COPYBOOK  : GNSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : SC
******************************************************************
 01  EN-NSC-ENDORSEMENT.

          03 EN-NSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NSC-FORM-NUMBER               PIC X(10).
          03 EN-NSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-NSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
