******************************************************************
*  COPYBOOK  : GNSDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : SD
******************************************************************
 01  PT-NSD-PARTY.

          03 PT-NSD-INSURED-NAME              PIC X(40).
          03 PT-NSD-TAX-ID                    PIC X(11).
          03 PT-NSD-ADDRESS-LINE1             PIC X(30).
          03 PT-NSD-ADDRESS-LINE2             PIC X(30).
          03 PT-NSD-CITY                      PIC X(20).
          03 PT-NSD-STATE-CODE                PIC X(2).
          03 PT-NSD-ZIP-CODE                  PIC X(9).
          03 PT-NSD-PHONE                     PIC X(14).
          03 PT-NSD-AGENCY-CODE               PIC X(6).
          03 PT-NSD-AGENT-NAME                PIC X(30).
