******************************************************************
*  COPYBOOK  : GNSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : SD
******************************************************************
 01  EN-NSD-ENDORSEMENT.

          03 EN-NSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NSD-FORM-NUMBER               PIC X(10).
          03 EN-NSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-NSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
