******************************************************************
*  COPYBOOK  : GNTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : TN
******************************************************************
 01  PT-NTN-PARTY.

          03 PT-NTN-INSURED-NAME              PIC X(40).
          03 PT-NTN-TAX-ID                    PIC X(11).
          03 PT-NTN-ADDRESS-LINE1             PIC X(30).
          03 PT-NTN-ADDRESS-LINE2             PIC X(30).
          03 PT-NTN-CITY                      PIC X(20).
          03 PT-NTN-STATE-CODE                PIC X(2).
          03 PT-NTN-ZIP-CODE                  PIC X(9).
          03 PT-NTN-PHONE                     PIC X(14).
          03 PT-NTN-AGENCY-CODE               PIC X(6).
          03 PT-NTN-AGENT-NAME                PIC X(30).
