******************************************************************
*  COPYBOOK  : GNTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : TN
******************************************************************
 01  EN-NTN-ENDORSEMENT.

          03 EN-NTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NTN-FORM-NUMBER               PIC X(10).
          03 EN-NTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-NTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
