******************************************************************
*  COPYBOOK  : GNTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : TX
******************************************************************
 01  EN-NTX-ENDORSEMENT.

          03 EN-NTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NTX-FORM-NUMBER               PIC X(10).
          03 EN-NTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-NTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
