******************************************************************
*  COPYBOOK  : GNTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : TX
******************************************************************
 01  PT-NTX-PARTY.

          03 PT-NTX-INSURED-NAME              PIC X(40).
          03 PT-NTX-TAX-ID                    PIC X(11).
          03 PT-NTX-ADDRESS-LINE1             PIC X(30).
          03 PT-NTX-ADDRESS-LINE2             PIC X(30).
          03 PT-NTX-CITY                      PIC X(20).
          03 PT-NTX-STATE-CODE                PIC X(2).
          03 PT-NTX-ZIP-CODE                  PIC X(9).
          03 PT-NTX-PHONE                     PIC X(14).
          03 PT-NTX-AGENCY-CODE               PIC X(6).
          03 PT-NTX-AGENT-NAME                PIC X(30).
