******************************************************************
*  COPYBOOK  : GNUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : UT
******************************************************************
 01  EN-NUT-ENDORSEMENT.

          03 EN-NUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NUT-FORM-NUMBER               PIC X(10).
          03 EN-NUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-NUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
