******************************************************************
*  COPYBOOK  : GNVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : VA
******************************************************************
 01  PT-NVA-PARTY.

          03 PT-NVA-INSURED-NAME              PIC X(40).
          03 PT-NVA-TAX-ID                    PIC X(11).
          03 PT-NVA-ADDRESS-LINE1             PIC X(30).
          03 PT-NVA-ADDRESS-LINE2             PIC X(30).
          03 PT-NVA-CITY                      PIC X(20).
          03 PT-NVA-STATE-CODE                PIC X(2).
          03 PT-NVA-ZIP-CODE                  PIC X(9).
          03 PT-NVA-PHONE                     PIC X(14).
          03 PT-NVA-AGENCY-CODE               PIC X(6).
          03 PT-NVA-AGENT-NAME                PIC X(30).
