******************************************************************
*  COPYBOOK  : GNVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : VA
******************************************************************
 01  EN-NVA-ENDORSEMENT.

          03 EN-NVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NVA-FORM-NUMBER               PIC X(10).
          03 EN-NVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
