******************************************************************
*  COPYBOOK  : GNVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : VT
******************************************************************
 01  PT-NVT-PARTY.

          03 PT-NVT-INSURED-NAME              PIC X(40).
          03 PT-NVT-TAX-ID                    PIC X(11).
          03 PT-NVT-ADDRESS-LINE1             PIC X(30).
          03 PT-NVT-ADDRESS-LINE2             PIC X(30).
          03 PT-NVT-CITY                      PIC X(20).
          03 PT-NVT-STATE-CODE                PIC X(2).
          03 PT-NVT-ZIP-CODE                  PIC X(9).
          03 PT-NVT-PHONE                     PIC X(14).
          03 PT-NVT-AGENCY-CODE               PIC X(6).
          03 PT-NVT-AGENT-NAME                PIC X(30).
