******************************************************************
*  COPYBOOK  : GNVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : VT
******************************************************************
 01  EN-NVT-ENDORSEMENT.

          03 EN-NVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NVT-FORM-NUMBER               PIC X(10).
          03 EN-NVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-NVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
