******************************************************************
*  COPYBOOK  : GNWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WA
******************************************************************
 01  PT-NWA-PARTY.

          03 PT-NWA-INSURED-NAME              PIC X(40).
          03 PT-NWA-TAX-ID                    PIC X(11).
          03 PT-NWA-ADDRESS-LINE1             PIC X(30).
          03 PT-NWA-ADDRESS-LINE2             PIC X(30).
          03 PT-NWA-CITY                      PIC X(20).
          03 PT-NWA-STATE-CODE                PIC X(2).
          03 PT-NWA-ZIP-CODE                  PIC X(9).
          03 PT-NWA-PHONE                     PIC X(14).
          03 PT-NWA-AGENCY-CODE               PIC X(6).
          03 PT-NWA-AGENT-NAME                PIC X(30).
