******************************************************************
*  COPYBOOK  : GNWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WA
******************************************************************
 01  EN-NWA-ENDORSEMENT.

          03 EN-NWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NWA-FORM-NUMBER               PIC X(10).
          03 EN-NWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-NWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
