******************************************************************
*  COPYBOOK  : GNWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WI
******************************************************************
 01  EN-NWI-ENDORSEMENT.

          03 EN-NWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NWI-FORM-NUMBER               PIC X(10).
          03 EN-NWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-NWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
