******************************************************************
*  COPYBOOK  : GNWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WI
******************************************************************
 01  PT-NWI-PARTY.

          03 PT-NWI-INSURED-NAME              PIC X(40).
          03 PT-NWI-TAX-ID                    PIC X(11).
          03 PT-NWI-ADDRESS-LINE1             PIC X(30).
          03 PT-NWI-ADDRESS-LINE2             PIC X(30).
          03 PT-NWI-CITY                      PIC X(20).
          03 PT-NWI-STATE-CODE                PIC X(2).
          03 PT-NWI-ZIP-CODE                  PIC X(9).
          03 PT-NWI-PHONE                     PIC X(14).
          03 PT-NWI-AGENCY-CODE               PIC X(6).
          03 PT-NWI-AGENT-NAME                PIC X(30).
