******************************************************************
*  COPYBOOK  : GNWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WV
******************************************************************
 01  PT-NWV-PARTY.

          03 PT-NWV-INSURED-NAME              PIC X(40).
          03 PT-NWV-TAX-ID                    PIC X(11).
          03 PT-NWV-ADDRESS-LINE1             PIC X(30).
          03 PT-NWV-ADDRESS-LINE2             PIC X(30).
          03 PT-NWV-CITY                      PIC X(20).
          03 PT-NWV-STATE-CODE                PIC X(2).
          03 PT-NWV-ZIP-CODE                  PIC X(9).
          03 PT-NWV-PHONE                     PIC X(14).
          03 PT-NWV-AGENCY-CODE               PIC X(6).
          03 PT-NWV-AGENT-NAME                PIC X(30).
