******************************************************************
*  COPYBOOK  : GNWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WV
******************************************************************
 01  EN-NWV-ENDORSEMENT.

          03 EN-NWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NWV-FORM-NUMBER               PIC X(10).
          03 EN-NWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-NWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
