******************************************************************
*  COPYBOOK  : GNWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WY
******************************************************************
 01  EN-NWY-ENDORSEMENT.

          03 EN-NWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-NWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-NWY-FORM-NUMBER               PIC X(10).
          03 EN-NWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-NWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
