******************************************************************
*  COPYBOOK  : GNWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Limited Pollution Liability (PL)
*  STATE     : WY
******************************************************************
 01  PT-NWY-PARTY.

          03 PT-NWY-INSURED-NAME              PIC X(40).
          03 PT-NWY-TAX-ID                    PIC X(11).
          03 PT-NWY-ADDRESS-LINE1             PIC X(30).
          03 PT-NWY-ADDRESS-LINE2             PIC X(30).
          03 PT-NWY-CITY                      PIC X(20).
          03 PT-NWY-STATE-CODE                PIC X(2).
          03 PT-NWY-ZIP-CODE                  PIC X(9).
          03 PT-NWY-PHONE                     PIC X(14).
          03 PT-NWY-AGENCY-CODE               PIC X(6).
          03 PT-NWY-AGENT-NAME                PIC X(30).
