******************************************************************
*  COPYBOOK  : GPAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AK
******************************************************************
 01  PT-PAK-PARTY.

          03 PT-PAK-INSURED-NAME              PIC X(40).
          03 PT-PAK-TAX-ID                    PIC X(11).
          03 PT-PAK-ADDRESS-LINE1             PIC X(30).
          03 PT-PAK-ADDRESS-LINE2             PIC X(30).
          03 PT-PAK-CITY                      PIC X(20).
          03 PT-PAK-STATE-CODE                PIC X(2).
          03 PT-PAK-ZIP-CODE                  PIC X(9).
          03 PT-PAK-PHONE                     PIC X(14).
          03 PT-PAK-AGENCY-CODE               PIC X(6).
          03 PT-PAK-AGENT-NAME                PIC X(30).
