******************************************************************
*  COPYBOOK  : GPAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AK
******************************************************************
 01  EN-PAK-ENDORSEMENT.

          03 EN-PAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PAK-FORM-NUMBER               PIC X(10).
          03 EN-PAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-PAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
