******************************************************************
*  COPYBOOK  : GPALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AL
******************************************************************
 01  PT-PAL-PARTY.

          03 PT-PAL-INSURED-NAME              PIC X(40).
          03 PT-PAL-TAX-ID                    PIC X(11).
          03 PT-PAL-ADDRESS-LINE1             PIC X(30).
          03 PT-PAL-ADDRESS-LINE2             PIC X(30).
          03 PT-PAL-CITY                      PIC X(20).
          03 PT-PAL-STATE-CODE                PIC X(2).
          03 PT-PAL-ZIP-CODE                  PIC X(9).
          03 PT-PAL-PHONE                     PIC X(14).
          03 PT-PAL-AGENCY-CODE               PIC X(6).
          03 PT-PAL-AGENT-NAME                PIC X(30).
