******************************************************************
*  COPYBOOK  : GPALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AL
******************************************************************
 01  EN-PAL-ENDORSEMENT.

          03 EN-PAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PAL-FORM-NUMBER               PIC X(10).
          03 EN-PAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-PAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
