******************************************************************
*  COPYBOOK  : GPARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AR
******************************************************************
 01  EN-PAR-ENDORSEMENT.

          03 EN-PAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PAR-FORM-NUMBER               PIC X(10).
          03 EN-PAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-PAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
