******************************************************************
*  COPYBOOK  : GPARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AR
******************************************************************
 01  PT-PAR-PARTY.

          03 PT-PAR-INSURED-NAME              PIC X(40).
          03 PT-PAR-TAX-ID                    PIC X(11).
          03 PT-PAR-ADDRESS-LINE1             PIC X(30).
          03 PT-PAR-ADDRESS-LINE2             PIC X(30).
          03 PT-PAR-CITY                      PIC X(20).
          03 PT-PAR-STATE-CODE                PIC X(2).
          03 PT-PAR-ZIP-CODE                  PIC X(9).
          03 PT-PAR-PHONE                     PIC X(14).
          03 PT-PAR-AGENCY-CODE               PIC X(6).
          03 PT-PAR-AGENT-NAME                PIC X(30).
