******************************************************************
*  COPYBOOK  : GPAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AZ
******************************************************************
 01  PT-PAZ-PARTY.

          03 PT-PAZ-INSURED-NAME              PIC X(40).
          03 PT-PAZ-TAX-ID                    PIC X(11).
          03 PT-PAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-PAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-PAZ-CITY                      PIC X(20).
          03 PT-PAZ-STATE-CODE                PIC X(2).
          03 PT-PAZ-ZIP-CODE                  PIC X(9).
          03 PT-PAZ-PHONE                     PIC X(14).
          03 PT-PAZ-AGENCY-CODE               PIC X(6).
          03 PT-PAZ-AGENT-NAME                PIC X(30).
