******************************************************************
*  COPYBOOK  : GPAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : AZ
******************************************************************
 01  EN-PAZ-ENDORSEMENT.

          03 EN-PAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PAZ-FORM-NUMBER               PIC X(10).
          03 EN-PAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-PAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
