******************************************************************
*  COPYBOOK  : GPCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CA
******************************************************************
 01  EN-PCA-ENDORSEMENT.

          03 EN-PCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PCA-FORM-NUMBER               PIC X(10).
          03 EN-PCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
