******************************************************************
*  COPYBOOK  : GPCAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CA
******************************************************************
 01  PT-PCA-PARTY.

          03 PT-PCA-INSURED-NAME              PIC X(40).
          03 PT-PCA-TAX-ID                    PIC X(11).
          03 PT-PCA-ADDRESS-LINE1             PIC X(30).
          03 PT-PCA-ADDRESS-LINE2             PIC X(30).
          03 PT-PCA-CITY                      PIC X(20).
          03 PT-PCA-STATE-CODE                PIC X(2).
          03 PT-PCA-ZIP-CODE                  PIC X(9).
          03 PT-PCA-PHONE                     PIC X(14).
          03 PT-PCA-AGENCY-CODE               PIC X(6).
          03 PT-PCA-AGENT-NAME                PIC X(30).
