******************************************************************
*  COPYBOOK  : GPCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CO
******************************************************************
 01  PT-PCO-PARTY.

          03 PT-PCO-INSURED-NAME              PIC X(40).
          03 PT-PCO-TAX-ID                    PIC X(11).
          03 PT-PCO-ADDRESS-LINE1             PIC X(30).
          03 PT-PCO-ADDRESS-LINE2             PIC X(30).
          03 PT-PCO-CITY                      PIC X(20).
          03 PT-PCO-STATE-CODE                PIC X(2).
          03 PT-PCO-ZIP-CODE                  PIC X(9).
          03 PT-PCO-PHONE                     PIC X(14).
          03 PT-PCO-AGENCY-CODE               PIC X(6).
          03 PT-PCO-AGENT-NAME                PIC X(30).
