******************************************************************
*  COPYBOOK  : GPCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CO
******************************************************************
 01  EN-PCO-ENDORSEMENT.

          03 EN-PCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PCO-FORM-NUMBER               PIC X(10).
          03 EN-PCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-PCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
