******************************************************************
*  COPYBOOK  : GPCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CT
******************************************************************
 01  EN-PCT-ENDORSEMENT.

          03 EN-PCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PCT-FORM-NUMBER               PIC X(10).
          03 EN-PCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-PCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
