******************************************************************
*  COPYBOOK  : GPCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : CT
******************************************************************
 01  PT-PCT-PARTY.

          03 PT-PCT-INSURED-NAME              PIC X(40).
          03 PT-PCT-TAX-ID                    PIC X(11).
          03 PT-PCT-ADDRESS-LINE1             PIC X(30).
          03 PT-PCT-ADDRESS-LINE2             PIC X(30).
          03 PT-PCT-CITY                      PIC X(20).
          03 PT-PCT-STATE-CODE                PIC X(2).
          03 PT-PCT-ZIP-CODE                  PIC X(9).
          03 PT-PCT-PHONE                     PIC X(14).
          03 PT-PCT-AGENCY-CODE               PIC X(6).
          03 PT-PCT-AGENT-NAME                PIC X(30).
