******************************************************************
*  COPYBOOK  : GPDCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : DC
******************************************************************
 01  PT-PDC-PARTY.

          03 PT-PDC-INSURED-NAME              PIC X(40).
          03 PT-PDC-TAX-ID                    PIC X(11).
          03 PT-PDC-ADDRESS-LINE1             PIC X(30).
          03 PT-PDC-ADDRESS-LINE2             PIC X(30).
          03 PT-PDC-CITY                      PIC X(20).
          03 PT-PDC-STATE-CODE                PIC X(2).
          03 PT-PDC-ZIP-CODE                  PIC X(9).
          03 PT-PDC-PHONE                     PIC X(14).
          03 PT-PDC-AGENCY-CODE               PIC X(6).
          03 PT-PDC-AGENT-NAME                PIC X(30).
