******************************************************************
*  COPYBOOK  : GPDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : DC
******************************************************************
 01  EN-PDC-ENDORSEMENT.

          03 EN-PDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PDC-FORM-NUMBER               PIC X(10).
          03 EN-PDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-PDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
