******************************************************************
*  COPYBOOK  : GPDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : DE
******************************************************************
 01  EN-PDE-ENDORSEMENT.

          03 EN-PDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PDE-FORM-NUMBER               PIC X(10).
          03 EN-PDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-PDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
