******************************************************************
*  COPYBOOK  : GPDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : DE
******************************************************************
 01  PT-PDE-PARTY.

          03 PT-PDE-INSURED-NAME              PIC X(40).
          03 PT-PDE-TAX-ID                    PIC X(11).
          03 PT-PDE-ADDRESS-LINE1             PIC X(30).
          03 PT-PDE-ADDRESS-LINE2             PIC X(30).
          03 PT-PDE-CITY                      PIC X(20).
          03 PT-PDE-STATE-CODE                PIC X(2).
          03 PT-PDE-ZIP-CODE                  PIC X(9).
          03 PT-PDE-PHONE                     PIC X(14).
          03 PT-PDE-AGENCY-CODE               PIC X(6).
          03 PT-PDE-AGENT-NAME                PIC X(30).
