******************************************************************
*  COPYBOOK  : GPFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : FL
******************************************************************
 01  PT-PFL-PARTY.

          03 PT-PFL-INSURED-NAME              PIC X(40).
          03 PT-PFL-TAX-ID                    PIC X(11).
          03 PT-PFL-ADDRESS-LINE1             PIC X(30).
          03 PT-PFL-ADDRESS-LINE2             PIC X(30).
          03 PT-PFL-CITY                      PIC X(20).
          03 PT-PFL-STATE-CODE                PIC X(2).
          03 PT-PFL-ZIP-CODE                  PIC X(9).
          03 PT-PFL-PHONE                     PIC X(14).
          03 PT-PFL-AGENCY-CODE               PIC X(6).
          03 PT-PFL-AGENT-NAME                PIC X(30).
