******************************************************************
*  COPYBOOK  : GPFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : FL
******************************************************************
 01  EN-PFL-ENDORSEMENT.

          03 EN-PFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PFL-FORM-NUMBER               PIC X(10).
          03 EN-PFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-PFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
