******************************************************************
*  COPYBOOK  : GPGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : GA
******************************************************************
 01  PT-PGA-PARTY.

          03 PT-PGA-INSURED-NAME              PIC X(40).
          03 PT-PGA-TAX-ID                    PIC X(11).
          03 PT-PGA-ADDRESS-LINE1             PIC X(30).
          03 PT-PGA-ADDRESS-LINE2             PIC X(30).
          03 PT-PGA-CITY                      PIC X(20).
          03 PT-PGA-STATE-CODE                PIC X(2).
          03 PT-PGA-ZIP-CODE                  PIC X(9).
          03 PT-PGA-PHONE                     PIC X(14).
          03 PT-PGA-AGENCY-CODE               PIC X(6).
          03 PT-PGA-AGENT-NAME                PIC X(30).
