******************************************************************
*  COPYBOOK  : GPGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : GA
******************************************************************
 01  EN-PGA-ENDORSEMENT.

          03 EN-PGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PGA-FORM-NUMBER               PIC X(10).
          03 EN-PGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
