******************************************************************
*  COPYBOOK  : GPHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : HI
******************************************************************
 01  EN-PHI-ENDORSEMENT.

          03 EN-PHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PHI-FORM-NUMBER               PIC X(10).
          03 EN-PHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-PHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
