******************************************************************
*  COPYBOOK  : GPHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : HI
******************************************************************
 01  PT-PHI-PARTY.

          03 PT-PHI-INSURED-NAME              PIC X(40).
          03 PT-PHI-TAX-ID                    PIC X(11).
          03 PT-PHI-ADDRESS-LINE1             PIC X(30).
          03 PT-PHI-ADDRESS-LINE2             PIC X(30).
          03 PT-PHI-CITY                      PIC X(20).
          03 PT-PHI-STATE-CODE                PIC X(2).
          03 PT-PHI-ZIP-CODE                  PIC X(9).
          03 PT-PHI-PHONE                     PIC X(14).
          03 PT-PHI-AGENCY-CODE               PIC X(6).
          03 PT-PHI-AGENT-NAME                PIC X(30).
