******************************************************************
*  COPYBOOK  : GPIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : IA
******************************************************************
 01  EN-PIA-ENDORSEMENT.

          03 EN-PIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PIA-FORM-NUMBER               PIC X(10).
          03 EN-PIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
