******************************************************************
*  COPYBOOK  : GPIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : IA
******************************************************************
 01  PT-PIA-PARTY.

          03 PT-PIA-INSURED-NAME              PIC X(40).
          03 PT-PIA-TAX-ID                    PIC X(11).
          03 PT-PIA-ADDRESS-LINE1             PIC X(30).
          03 PT-PIA-ADDRESS-LINE2             PIC X(30).
          03 PT-PIA-CITY                      PIC X(20).
          03 PT-PIA-STATE-CODE                PIC X(2).
          03 PT-PIA-ZIP-CODE                  PIC X(9).
          03 PT-PIA-PHONE                     PIC X(14).
          03 PT-PIA-AGENCY-CODE               PIC X(6).
          03 PT-PIA-AGENT-NAME                PIC X(30).
