******************************************************************
*  COPYBOOK  : GPIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : ID
******************************************************************
 01  EN-PID-ENDORSEMENT.

          03 EN-PID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PID-FORM-NUMBER               PIC X(10).
          03 EN-PID-EFFECTIVE-DATE            PIC X(10).
          03 EN-PID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
