******************************************************************
*  COPYBOOK  : GPILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : IL
******************************************************************
 01  EN-PIL-ENDORSEMENT.

          03 EN-PIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PIL-FORM-NUMBER               PIC X(10).
          03 EN-PIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-PIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
