******************************************************************
*  COPYBOOK  : GPILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : IL
******************************************************************
 01  PT-PIL-PARTY.

          03 PT-PIL-INSURED-NAME              PIC X(40).
          03 PT-PIL-TAX-ID                    PIC X(11).
          03 PT-PIL-ADDRESS-LINE1             PIC X(30).
          03 PT-PIL-ADDRESS-LINE2             PIC X(30).
          03 PT-PIL-CITY                      PIC X(20).
          03 PT-PIL-STATE-CODE                PIC X(2).
          03 PT-PIL-ZIP-CODE                  PIC X(9).
          03 PT-PIL-PHONE                     PIC X(14).
          03 PT-PIL-AGENCY-CODE               PIC X(6).
          03 PT-PIL-AGENT-NAME                PIC X(30).
