******************************************************************
*  COPYBOOK  : GPINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : IN
******************************************************************
 01  EN-PIN-ENDORSEMENT.

          03 EN-PIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PIN-FORM-NUMBER               PIC X(10).
          03 EN-PIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-PIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
