******************************************************************
*  COPYBOOK  : GPKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : KS
******************************************************************
 01  EN-PKS-ENDORSEMENT.

          03 EN-PKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PKS-FORM-NUMBER               PIC X(10).
          03 EN-PKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-PKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
