******************************************************************
*  COPYBOOK  : GPKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : KS
******************************************************************
 01  PT-PKS-PARTY.

          03 PT-PKS-INSURED-NAME              PIC X(40).
          03 PT-PKS-TAX-ID                    PIC X(11).
          03 PT-PKS-ADDRESS-LINE1             PIC X(30).
          03 PT-PKS-ADDRESS-LINE2             PIC X(30).
          03 PT-PKS-CITY                      PIC X(20).
          03 PT-PKS-STATE-CODE                PIC X(2).
          03 PT-PKS-ZIP-CODE                  PIC X(9).
          03 PT-PKS-PHONE                     PIC X(14).
          03 PT-PKS-AGENCY-CODE               PIC X(6).
          03 PT-PKS-AGENT-NAME                PIC X(30).
