******************************************************************
*  COPYBOOK  : GPKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : KY
******************************************************************
 01  PT-PKY-PARTY.

          03 PT-PKY-INSURED-NAME              PIC X(40).
          03 PT-PKY-TAX-ID                    PIC X(11).
          03 PT-PKY-ADDRESS-LINE1             PIC X(30).
          03 PT-PKY-ADDRESS-LINE2             PIC X(30).
          03 PT-PKY-CITY                      PIC X(20).
          03 PT-PKY-STATE-CODE                PIC X(2).
          03 PT-PKY-ZIP-CODE                  PIC X(9).
          03 PT-PKY-PHONE                     PIC X(14).
          03 PT-PKY-AGENCY-CODE               PIC X(6).
          03 PT-PKY-AGENT-NAME                PIC X(30).
