******************************************************************
*  COPYBOOK  : GPKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : KY
******************************************************************
 01  EN-PKY-ENDORSEMENT.

          03 EN-PKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PKY-FORM-NUMBER               PIC X(10).
          03 EN-PKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-PKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
