******************************************************************
*  COPYBOOK  : GPLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : LA
******************************************************************
 01  EN-PLA-ENDORSEMENT.

          03 EN-PLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PLA-FORM-NUMBER               PIC X(10).
          03 EN-PLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
