******************************************************************
*  COPYBOOK  : GPLAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : LA
******************************************************************
 01  PT-PLA-PARTY.

          03 PT-PLA-INSURED-NAME              PIC X(40).
          03 PT-PLA-TAX-ID                    PIC X(11).
          03 PT-PLA-ADDRESS-LINE1             PIC X(30).
          03 PT-PLA-ADDRESS-LINE2             PIC X(30).
          03 PT-PLA-CITY                      PIC X(20).
          03 PT-PLA-STATE-CODE                PIC X(2).
          03 PT-PLA-ZIP-CODE                  PIC X(9).
          03 PT-PLA-PHONE                     PIC X(14).
          03 PT-PLA-AGENCY-CODE               PIC X(6).
          03 PT-PLA-AGENT-NAME                PIC X(30).
