******************************************************************
*  COPYBOOK  : GPMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MA
******************************************************************
 01  PT-PMA-PARTY.

          03 PT-PMA-INSURED-NAME              PIC X(40).
          03 PT-PMA-TAX-ID                    PIC X(11).
          03 PT-PMA-ADDRESS-LINE1             PIC X(30).
          03 PT-PMA-ADDRESS-LINE2             PIC X(30).
          03 PT-PMA-CITY                      PIC X(20).
          03 PT-PMA-STATE-CODE                PIC X(2).
          03 PT-PMA-ZIP-CODE                  PIC X(9).
          03 PT-PMA-PHONE                     PIC X(14).
          03 PT-PMA-AGENCY-CODE               PIC X(6).
          03 PT-PMA-AGENT-NAME                PIC X(30).
