******************************************************************
*  COPYBOOK  : GPMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MA
******************************************************************
 01  EN-PMA-ENDORSEMENT.

          03 EN-PMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMA-FORM-NUMBER               PIC X(10).
          03 EN-PMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
