******************************************************************
*  COPYBOOK  : GPMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MD
******************************************************************
 01  EN-PMD-ENDORSEMENT.

          03 EN-PMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMD-FORM-NUMBER               PIC X(10).
          03 EN-PMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
