******************************************************************
*  COPYBOOK  : GPMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : ME
******************************************************************
 01  EN-PME-ENDORSEMENT.

          03 EN-PME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PME-FORM-NUMBER               PIC X(10).
          03 EN-PME-EFFECTIVE-DATE            PIC X(10).
          03 EN-PME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
