******************************************************************
*  COPYBOOK  : GPMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : ME
******************************************************************
 01  PT-PME-PARTY.

          03 PT-PME-INSURED-NAME              PIC X(40).
          03 PT-PME-TAX-ID                    PIC X(11).
          03 PT-PME-ADDRESS-LINE1             PIC X(30).
          03 PT-PME-ADDRESS-LINE2             PIC X(30).
          03 PT-PME-CITY                      PIC X(20).
          03 PT-PME-STATE-CODE                PIC X(2).
          03 PT-PME-ZIP-CODE                  PIC X(9).
          03 PT-PME-PHONE                     PIC X(14).
          03 PT-PME-AGENCY-CODE               PIC X(6).
          03 PT-PME-AGENT-NAME                PIC X(30).
