******************************************************************
*  COPYBOOK  : GPMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MI
******************************************************************
 01  EN-PMI-ENDORSEMENT.

          03 EN-PMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMI-FORM-NUMBER               PIC X(10).
          03 EN-PMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
