******************************************************************
*  COPYBOOK  : GPMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MN
******************************************************************
 01  EN-PMN-ENDORSEMENT.

          03 EN-PMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMN-FORM-NUMBER               PIC X(10).
          03 EN-PMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
