******************************************************************
*  COPYBOOK  : GPMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MN
******************************************************************
 01  PT-PMN-PARTY.

          03 PT-PMN-INSURED-NAME              PIC X(40).
          03 PT-PMN-TAX-ID                    PIC X(11).
          03 PT-PMN-ADDRESS-LINE1             PIC X(30).
          03 PT-PMN-ADDRESS-LINE2             PIC X(30).
          03 PT-PMN-CITY                      PIC X(20).
          03 PT-PMN-STATE-CODE                PIC X(2).
          03 PT-PMN-ZIP-CODE                  PIC X(9).
          03 PT-PMN-PHONE                     PIC X(14).
          03 PT-PMN-AGENCY-CODE               PIC X(6).
          03 PT-PMN-AGENT-NAME                PIC X(30).
