******************************************************************
*  COPYBOOK  : GPMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MO
******************************************************************
 01  PT-PMO-PARTY.

          03 PT-PMO-INSURED-NAME              PIC X(40).
          03 PT-PMO-TAX-ID                    PIC X(11).
          03 PT-PMO-ADDRESS-LINE1             PIC X(30).
          03 PT-PMO-ADDRESS-LINE2             PIC X(30).
          03 PT-PMO-CITY                      PIC X(20).
          03 PT-PMO-STATE-CODE                PIC X(2).
          03 PT-PMO-ZIP-CODE                  PIC X(9).
          03 PT-PMO-PHONE                     PIC X(14).
          03 PT-PMO-AGENCY-CODE               PIC X(6).
          03 PT-PMO-AGENT-NAME                PIC X(30).
