******************************************************************
*  COPYBOOK  : GPMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MO
******************************************************************
 01  EN-PMO-ENDORSEMENT.

          03 EN-PMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMO-FORM-NUMBER               PIC X(10).
          03 EN-PMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
