******************************************************************
*  COPYBOOK  : GPMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MS
******************************************************************
 01  EN-PMS-ENDORSEMENT.

          03 EN-PMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMS-FORM-NUMBER               PIC X(10).
          03 EN-PMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
