******************************************************************
*  COPYBOOK  : GPMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MS
******************************************************************
 01  PT-PMS-PARTY.

          03 PT-PMS-INSURED-NAME              PIC X(40).
          03 PT-PMS-TAX-ID                    PIC X(11).
          03 PT-PMS-ADDRESS-LINE1             PIC X(30).
          03 PT-PMS-ADDRESS-LINE2             PIC X(30).
          03 PT-PMS-CITY                      PIC X(20).
          03 PT-PMS-STATE-CODE                PIC X(2).
          03 PT-PMS-ZIP-CODE                  PIC X(9).
          03 PT-PMS-PHONE                     PIC X(14).
          03 PT-PMS-AGENCY-CODE               PIC X(6).
          03 PT-PMS-AGENT-NAME                PIC X(30).
