******************************************************************
*  COPYBOOK  : GPMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MT
******************************************************************
 01  EN-PMT-ENDORSEMENT.

          03 EN-PMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PMT-FORM-NUMBER               PIC X(10).
          03 EN-PMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-PMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
