******************************************************************
*  COPYBOOK  : GPMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : MT
******************************************************************
 01  PT-PMT-PARTY.

          03 PT-PMT-INSURED-NAME              PIC X(40).
          03 PT-PMT-TAX-ID                    PIC X(11).
          03 PT-PMT-ADDRESS-LINE1             PIC X(30).
          03 PT-PMT-ADDRESS-LINE2             PIC X(30).
          03 PT-PMT-CITY                      PIC X(20).
          03 PT-PMT-STATE-CODE                PIC X(2).
          03 PT-PMT-ZIP-CODE                  PIC X(9).
          03 PT-PMT-PHONE                     PIC X(14).
          03 PT-PMT-AGENCY-CODE               PIC X(6).
          03 PT-PMT-AGENT-NAME                PIC X(30).
