******************************************************************
*  COPYBOOK  : GPNCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NC
******************************************************************
 01  PT-PNC-PARTY.

          03 PT-PNC-INSURED-NAME              PIC X(40).
          03 PT-PNC-TAX-ID                    PIC X(11).
          03 PT-PNC-ADDRESS-LINE1             PIC X(30).
          03 PT-PNC-ADDRESS-LINE2             PIC X(30).
          03 PT-PNC-CITY                      PIC X(20).
          03 PT-PNC-STATE-CODE                PIC X(2).
          03 PT-PNC-ZIP-CODE                  PIC X(9).
          03 PT-PNC-PHONE                     PIC X(14).
          03 PT-PNC-AGENCY-CODE               PIC X(6).
          03 PT-PNC-AGENT-NAME                PIC X(30).
