******************************************************************
*  COPYBOOK  : GPNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NC
******************************************************************
 01  EN-PNC-ENDORSEMENT.

          03 EN-PNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNC-FORM-NUMBER               PIC X(10).
          03 EN-PNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
