******************************************************************
*  COPYBOOK  : GPNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : ND
******************************************************************
 01  EN-PND-ENDORSEMENT.

          03 EN-PND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PND-FORM-NUMBER               PIC X(10).
          03 EN-PND-EFFECTIVE-DATE            PIC X(10).
          03 EN-PND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
