******************************************************************
*  COPYBOOK  : GPNDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : ND
******************************************************************
 01  PT-PND-PARTY.

          03 PT-PND-INSURED-NAME              PIC X(40).
          03 PT-PND-TAX-ID                    PIC X(11).
          03 PT-PND-ADDRESS-LINE1             PIC X(30).
          03 PT-PND-ADDRESS-LINE2             PIC X(30).
          03 PT-PND-CITY                      PIC X(20).
          03 PT-PND-STATE-CODE                PIC X(2).
          03 PT-PND-ZIP-CODE                  PIC X(9).
          03 PT-PND-PHONE                     PIC X(14).
          03 PT-PND-AGENCY-CODE               PIC X(6).
          03 PT-PND-AGENT-NAME                PIC X(30).
