******************************************************************
*  COPYBOOK  : GPNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NE
******************************************************************
 01  EN-PNE-ENDORSEMENT.

          03 EN-PNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNE-FORM-NUMBER               PIC X(10).
          03 EN-PNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
