******************************************************************
*  COPYBOOK  : GPNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NE
******************************************************************
 01  PT-PNE-PARTY.

          03 PT-PNE-INSURED-NAME              PIC X(40).
          03 PT-PNE-TAX-ID                    PIC X(11).
          03 PT-PNE-ADDRESS-LINE1             PIC X(30).
          03 PT-PNE-ADDRESS-LINE2             PIC X(30).
          03 PT-PNE-CITY                      PIC X(20).
          03 PT-PNE-STATE-CODE                PIC X(2).
          03 PT-PNE-ZIP-CODE                  PIC X(9).
          03 PT-PNE-PHONE                     PIC X(14).
          03 PT-PNE-AGENCY-CODE               PIC X(6).
          03 PT-PNE-AGENT-NAME                PIC X(30).
