******************************************************************
*  COPYBOOK  : GPNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NH
******************************************************************
 01  EN-PNH-ENDORSEMENT.

          03 EN-PNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNH-FORM-NUMBER               PIC X(10).
          03 EN-PNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
