******************************************************************
*  COPYBOOK  : GPNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NJ
******************************************************************
 01  EN-PNJ-ENDORSEMENT.

          03 EN-PNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNJ-FORM-NUMBER               PIC X(10).
          03 EN-PNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
