******************************************************************
*  COPYBOOK  : GPNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NM
******************************************************************
 01  EN-PNM-ENDORSEMENT.

          03 EN-PNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNM-FORM-NUMBER               PIC X(10).
          03 EN-PNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
