******************************************************************
*  COPYBOOK  : GPNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NM
******************************************************************
 01  PT-PNM-PARTY.

          03 PT-PNM-INSURED-NAME              PIC X(40).
          03 PT-PNM-TAX-ID                    PIC X(11).
          03 PT-PNM-ADDRESS-LINE1             PIC X(30).
          03 PT-PNM-ADDRESS-LINE2             PIC X(30).
          03 PT-PNM-CITY                      PIC X(20).
          03 PT-PNM-STATE-CODE                PIC X(2).
          03 PT-PNM-ZIP-CODE                  PIC X(9).
          03 PT-PNM-PHONE                     PIC X(14).
          03 PT-PNM-AGENCY-CODE               PIC X(6).
          03 PT-PNM-AGENT-NAME                PIC X(30).
