******************************************************************
*  COPYBOOK  : GPNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NV
******************************************************************
 01  EN-PNV-ENDORSEMENT.

          03 EN-PNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNV-FORM-NUMBER               PIC X(10).
          03 EN-PNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
