******************************************************************
*  COPYBOOK  : GPNVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NV
******************************************************************
 01  PT-PNV-PARTY.

          03 PT-PNV-INSURED-NAME              PIC X(40).
          03 PT-PNV-TAX-ID                    PIC X(11).
          03 PT-PNV-ADDRESS-LINE1             PIC X(30).
          03 PT-PNV-ADDRESS-LINE2             PIC X(30).
          03 PT-PNV-CITY                      PIC X(20).
          03 PT-PNV-STATE-CODE                PIC X(2).
          03 PT-PNV-ZIP-CODE                  PIC X(9).
          03 PT-PNV-PHONE                     PIC X(14).
          03 PT-PNV-AGENCY-CODE               PIC X(6).
          03 PT-PNV-AGENT-NAME                PIC X(30).
