******************************************************************
*  COPYBOOK  : GPNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NY
******************************************************************
 01  PT-PNY-PARTY.

          03 PT-PNY-INSURED-NAME              PIC X(40).
          03 PT-PNY-TAX-ID                    PIC X(11).
          03 PT-PNY-ADDRESS-LINE1             PIC X(30).
          03 PT-PNY-ADDRESS-LINE2             PIC X(30).
          03 PT-PNY-CITY                      PIC X(20).
          03 PT-PNY-STATE-CODE                PIC X(2).
          03 PT-PNY-ZIP-CODE                  PIC X(9).
          03 PT-PNY-PHONE                     PIC X(14).
          03 PT-PNY-AGENCY-CODE               PIC X(6).
          03 PT-PNY-AGENT-NAME                PIC X(30).
