******************************************************************
*  COPYBOOK  : GPNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : NY
******************************************************************
 01  EN-PNY-ENDORSEMENT.

          03 EN-PNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PNY-FORM-NUMBER               PIC X(10).
          03 EN-PNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-PNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
