******************************************************************
*  COPYBOOK  : GPOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OH
******************************************************************
 01  PT-POH-PARTY.

          03 PT-POH-INSURED-NAME              PIC X(40).
          03 PT-POH-TAX-ID                    PIC X(11).
          03 PT-POH-ADDRESS-LINE1             PIC X(30).
          03 PT-POH-ADDRESS-LINE2             PIC X(30).
          03 PT-POH-CITY                      PIC X(20).
          03 PT-POH-STATE-CODE                PIC X(2).
          03 PT-POH-ZIP-CODE                  PIC X(9).
          03 PT-POH-PHONE                     PIC X(14).
          03 PT-POH-AGENCY-CODE               PIC X(6).
          03 PT-POH-AGENT-NAME                PIC X(30).
