******************************************************************
*  COPYBOOK  : GPOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OH
******************************************************************
 01  EN-POH-ENDORSEMENT.

          03 EN-POH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-POH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-POH-FORM-NUMBER               PIC X(10).
          03 EN-POH-EFFECTIVE-DATE            PIC X(10).
          03 EN-POH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
