******************************************************************
*  COPYBOOK  : GPOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OK
******************************************************************
 01  PT-POK-PARTY.

          03 PT-POK-INSURED-NAME              PIC X(40).
          03 PT-POK-TAX-ID                    PIC X(11).
          03 PT-POK-ADDRESS-LINE1             PIC X(30).
          03 PT-POK-ADDRESS-LINE2             PIC X(30).
          03 PT-POK-CITY                      PIC X(20).
          03 PT-POK-STATE-CODE                PIC X(2).
          03 PT-POK-ZIP-CODE                  PIC X(9).
          03 PT-POK-PHONE                     PIC X(14).
          03 PT-POK-AGENCY-CODE               PIC X(6).
          03 PT-POK-AGENT-NAME                PIC X(30).
