******************************************************************
*  COPYBOOK  : GPOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OK
******************************************************************
 01  EN-POK-ENDORSEMENT.

          03 EN-POK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-POK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-POK-FORM-NUMBER               PIC X(10).
          03 EN-POK-EFFECTIVE-DATE            PIC X(10).
          03 EN-POK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
