******************************************************************
*  COPYBOOK  : GPORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OR
******************************************************************
 01  PT-POR-PARTY.

          03 PT-POR-INSURED-NAME              PIC X(40).
          03 PT-POR-TAX-ID                    PIC X(11).
          03 PT-POR-ADDRESS-LINE1             PIC X(30).
          03 PT-POR-ADDRESS-LINE2             PIC X(30).
          03 PT-POR-CITY                      PIC X(20).
          03 PT-POR-STATE-CODE                PIC X(2).
          03 PT-POR-ZIP-CODE                  PIC X(9).
          03 PT-POR-PHONE                     PIC X(14).
          03 PT-POR-AGENCY-CODE               PIC X(6).
          03 PT-POR-AGENT-NAME                PIC X(30).
