******************************************************************
*  COPYBOOK  : GPORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : OR
******************************************************************
 01  EN-POR-ENDORSEMENT.

          03 EN-POR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-POR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-POR-FORM-NUMBER               PIC X(10).
          03 EN-POR-EFFECTIVE-DATE            PIC X(10).
          03 EN-POR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
