******************************************************************
*  COPYBOOK  : GPPAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : PA
******************************************************************
 01  PT-PPA-PARTY.

          03 PT-PPA-INSURED-NAME              PIC X(40).
          03 PT-PPA-TAX-ID                    PIC X(11).
          03 PT-PPA-ADDRESS-LINE1             PIC X(30).
          03 PT-PPA-ADDRESS-LINE2             PIC X(30).
          03 PT-PPA-CITY                      PIC X(20).
          03 PT-PPA-STATE-CODE                PIC X(2).
          03 PT-PPA-ZIP-CODE                  PIC X(9).
          03 PT-PPA-PHONE                     PIC X(14).
          03 PT-PPA-AGENCY-CODE               PIC X(6).
          03 PT-PPA-AGENT-NAME                PIC X(30).
