******************************************************************
*  COPYBOOK  : GPPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : PA
******************************************************************
 01  EN-PPA-ENDORSEMENT.

          03 EN-PPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PPA-FORM-NUMBER               PIC X(10).
          03 EN-PPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
