******************************************************************
*  COPYBOOK  : GPRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : RI
******************************************************************
 01  PT-PRI-PARTY.

          03 PT-PRI-INSURED-NAME              PIC X(40).
          03 PT-PRI-TAX-ID                    PIC X(11).
          03 PT-PRI-ADDRESS-LINE1             PIC X(30).
          03 PT-PRI-ADDRESS-LINE2             PIC X(30).
          03 PT-PRI-CITY                      PIC X(20).
          03 PT-PRI-STATE-CODE                PIC X(2).
          03 PT-PRI-ZIP-CODE                  PIC X(9).
          03 PT-PRI-PHONE                     PIC X(14).
          03 PT-PRI-AGENCY-CODE               PIC X(6).
          03 PT-PRI-AGENT-NAME                PIC X(30).
