******************************************************************
*  COPYBOOK  : GPRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : RI
******************************************************************
 01  EN-PRI-ENDORSEMENT.

          03 EN-PRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PRI-FORM-NUMBER               PIC X(10).
          03 EN-PRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-PRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
