******************************************************************
*  COPYBOOK  : GPSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : SC
******************************************************************
 01  EN-PSC-ENDORSEMENT.

          03 EN-PSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PSC-FORM-NUMBER               PIC X(10).
          03 EN-PSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-PSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
