******************************************************************
*  COPYBOOK  : GPSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : SC
******************************************************************
 01  PT-PSC-PARTY.

          03 PT-PSC-INSURED-NAME              PIC X(40).
          03 PT-PSC-TAX-ID                    PIC X(11).
          03 PT-PSC-ADDRESS-LINE1             PIC X(30).
          03 PT-PSC-ADDRESS-LINE2             PIC X(30).
          03 PT-PSC-CITY                      PIC X(20).
          03 PT-PSC-STATE-CODE                PIC X(2).
          03 PT-PSC-ZIP-CODE                  PIC X(9).
          03 PT-PSC-PHONE                     PIC X(14).
          03 PT-PSC-AGENCY-CODE               PIC X(6).
          03 PT-PSC-AGENT-NAME                PIC X(30).
