******************************************************************
*  COPYBOOK  : GPSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : SD
******************************************************************
 01  EN-PSD-ENDORSEMENT.

          03 EN-PSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PSD-FORM-NUMBER               PIC X(10).
          03 EN-PSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-PSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
