******************************************************************
*  COPYBOOK  : GPSDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : SD
******************************************************************
 01  PT-PSD-PARTY.

          03 PT-PSD-INSURED-NAME              PIC X(40).
          03 PT-PSD-TAX-ID                    PIC X(11).
          03 PT-PSD-ADDRESS-LINE1             PIC X(30).
          03 PT-PSD-ADDRESS-LINE2             PIC X(30).
          03 PT-PSD-CITY                      PIC X(20).
          03 PT-PSD-STATE-CODE                PIC X(2).
          03 PT-PSD-ZIP-CODE                  PIC X(9).
          03 PT-PSD-PHONE                     PIC X(14).
          03 PT-PSD-AGENCY-CODE               PIC X(6).
          03 PT-PSD-AGENT-NAME                PIC X(30).
