******************************************************************
*  COPYBOOK  : GPTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : TN
******************************************************************
 01  PT-PTN-PARTY.

          03 PT-PTN-INSURED-NAME              PIC X(40).
          03 PT-PTN-TAX-ID                    PIC X(11).
          03 PT-PTN-ADDRESS-LINE1             PIC X(30).
          03 PT-PTN-ADDRESS-LINE2             PIC X(30).
          03 PT-PTN-CITY                      PIC X(20).
          03 PT-PTN-STATE-CODE                PIC X(2).
          03 PT-PTN-ZIP-CODE                  PIC X(9).
          03 PT-PTN-PHONE                     PIC X(14).
          03 PT-PTN-AGENCY-CODE               PIC X(6).
          03 PT-PTN-AGENT-NAME                PIC X(30).
