******************************************************************
*  COPYBOOK  : GPTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : TN
******************************************************************
 01  EN-PTN-ENDORSEMENT.

          03 EN-PTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PTN-FORM-NUMBER               PIC X(10).
          03 EN-PTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-PTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
