******************************************************************
*  COPYBOOK  : GPTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : TX
******************************************************************
 01  PT-PTX-PARTY.

          03 PT-PTX-INSURED-NAME              PIC X(40).
          03 PT-PTX-TAX-ID                    PIC X(11).
          03 PT-PTX-ADDRESS-LINE1             PIC X(30).
          03 PT-PTX-ADDRESS-LINE2             PIC X(30).
          03 PT-PTX-CITY                      PIC X(20).
          03 PT-PTX-STATE-CODE                PIC X(2).
          03 PT-PTX-ZIP-CODE                  PIC X(9).
          03 PT-PTX-PHONE                     PIC X(14).
          03 PT-PTX-AGENCY-CODE               PIC X(6).
          03 PT-PTX-AGENT-NAME                PIC X(30).
