******************************************************************
*  COPYBOOK  : GPTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : TX
******************************************************************
 01  EN-PTX-ENDORSEMENT.

          03 EN-PTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PTX-FORM-NUMBER               PIC X(10).
          03 EN-PTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-PTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
