******************************************************************
*  COPYBOOK  : GPUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : UT
******************************************************************
 01  PT-PUT-PARTY.

          03 PT-PUT-INSURED-NAME              PIC X(40).
          03 PT-PUT-TAX-ID                    PIC X(11).
          03 PT-PUT-ADDRESS-LINE1             PIC X(30).
          03 PT-PUT-ADDRESS-LINE2             PIC X(30).
          03 PT-PUT-CITY                      PIC X(20).
          03 PT-PUT-STATE-CODE                PIC X(2).
          03 PT-PUT-ZIP-CODE                  PIC X(9).
          03 PT-PUT-PHONE                     PIC X(14).
          03 PT-PUT-AGENCY-CODE               PIC X(6).
          03 PT-PUT-AGENT-NAME                PIC X(30).
