******************************************************************
*  COPYBOOK  : GPUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : UT
******************************************************************
 01  EN-PUT-ENDORSEMENT.

          03 EN-PUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PUT-FORM-NUMBER               PIC X(10).
          03 EN-PUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-PUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
