******************************************************************
*  COPYBOOK  : GPVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : VA
******************************************************************
 01  PT-PVA-PARTY.

          03 PT-PVA-INSURED-NAME              PIC X(40).
          03 PT-PVA-TAX-ID                    PIC X(11).
          03 PT-PVA-ADDRESS-LINE1             PIC X(30).
          03 PT-PVA-ADDRESS-LINE2             PIC X(30).
          03 PT-PVA-CITY                      PIC X(20).
          03 PT-PVA-STATE-CODE                PIC X(2).
          03 PT-PVA-ZIP-CODE                  PIC X(9).
          03 PT-PVA-PHONE                     PIC X(14).
          03 PT-PVA-AGENCY-CODE               PIC X(6).
          03 PT-PVA-AGENT-NAME                PIC X(30).
