******************************************************************
*  COPYBOOK  : GPVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : VA
******************************************************************
 01  EN-PVA-ENDORSEMENT.

          03 EN-PVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PVA-FORM-NUMBER               PIC X(10).
          03 EN-PVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
