******************************************************************
*  COPYBOOK  : GPVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : VT
******************************************************************
 01  PT-PVT-PARTY.

          03 PT-PVT-INSURED-NAME              PIC X(40).
          03 PT-PVT-TAX-ID                    PIC X(11).
          03 PT-PVT-ADDRESS-LINE1             PIC X(30).
          03 PT-PVT-ADDRESS-LINE2             PIC X(30).
          03 PT-PVT-CITY                      PIC X(20).
          03 PT-PVT-STATE-CODE                PIC X(2).
          03 PT-PVT-ZIP-CODE                  PIC X(9).
          03 PT-PVT-PHONE                     PIC X(14).
          03 PT-PVT-AGENCY-CODE               PIC X(6).
          03 PT-PVT-AGENT-NAME                PIC X(30).
