******************************************************************
*  COPYBOOK  : GPVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : VT
******************************************************************
 01  EN-PVT-ENDORSEMENT.

          03 EN-PVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PVT-FORM-NUMBER               PIC X(10).
          03 EN-PVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-PVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
