******************************************************************
*  COPYBOOK  : GPWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WA
******************************************************************
 01  EN-PWA-ENDORSEMENT.

          03 EN-PWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PWA-FORM-NUMBER               PIC X(10).
          03 EN-PWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-PWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
