******************************************************************
*  COPYBOOK  : GPWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WA
******************************************************************
 01  PT-PWA-PARTY.

          03 PT-PWA-INSURED-NAME              PIC X(40).
          03 PT-PWA-TAX-ID                    PIC X(11).
          03 PT-PWA-ADDRESS-LINE1             PIC X(30).
          03 PT-PWA-ADDRESS-LINE2             PIC X(30).
          03 PT-PWA-CITY                      PIC X(20).
          03 PT-PWA-STATE-CODE                PIC X(2).
          03 PT-PWA-ZIP-CODE                  PIC X(9).
          03 PT-PWA-PHONE                     PIC X(14).
          03 PT-PWA-AGENCY-CODE               PIC X(6).
          03 PT-PWA-AGENT-NAME                PIC X(30).
