******************************************************************
*  COPYBOOK  : GPWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WI
******************************************************************
 01  PT-PWI-PARTY.

          03 PT-PWI-INSURED-NAME              PIC X(40).
          03 PT-PWI-TAX-ID                    PIC X(11).
          03 PT-PWI-ADDRESS-LINE1             PIC X(30).
          03 PT-PWI-ADDRESS-LINE2             PIC X(30).
          03 PT-PWI-CITY                      PIC X(20).
          03 PT-PWI-STATE-CODE                PIC X(2).
          03 PT-PWI-ZIP-CODE                  PIC X(9).
          03 PT-PWI-PHONE                     PIC X(14).
          03 PT-PWI-AGENCY-CODE               PIC X(6).
          03 PT-PWI-AGENT-NAME                PIC X(30).
