******************************************************************
*  COPYBOOK  : GPWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WI
******************************************************************
 01  EN-PWI-ENDORSEMENT.

          03 EN-PWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PWI-FORM-NUMBER               PIC X(10).
          03 EN-PWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-PWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
