******************************************************************
*  COPYBOOK  : GPWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WV
******************************************************************
 01  PT-PWV-PARTY.

          03 PT-PWV-INSURED-NAME              PIC X(40).
          03 PT-PWV-TAX-ID                    PIC X(11).
          03 PT-PWV-ADDRESS-LINE1             PIC X(30).
          03 PT-PWV-ADDRESS-LINE2             PIC X(30).
          03 PT-PWV-CITY                      PIC X(20).
          03 PT-PWV-STATE-CODE                PIC X(2).
          03 PT-PWV-ZIP-CODE                  PIC X(9).
          03 PT-PWV-PHONE                     PIC X(14).
          03 PT-PWV-AGENCY-CODE               PIC X(6).
          03 PT-PWV-AGENT-NAME                PIC X(30).
