******************************************************************
*  COPYBOOK  : GPWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WV
******************************************************************
 01  EN-PWV-ENDORSEMENT.

          03 EN-PWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PWV-FORM-NUMBER               PIC X(10).
          03 EN-PWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-PWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
