******************************************************************
*  COPYBOOK  : GPWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WY
******************************************************************
 01  EN-PWY-ENDORSEMENT.

          03 EN-PWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-PWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-PWY-FORM-NUMBER               PIC X(10).
          03 EN-PWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-PWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
