******************************************************************
*  COPYBOOK  : GPWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Premises and Operations Liability (PR)
*  STATE     : WY
******************************************************************
 01  PT-PWY-PARTY.

          03 PT-PWY-INSURED-NAME              PIC X(40).
          03 PT-PWY-TAX-ID                    PIC X(11).
          03 PT-PWY-ADDRESS-LINE1             PIC X(30).
          03 PT-PWY-ADDRESS-LINE2             PIC X(30).
          03 PT-PWY-CITY                      PIC X(20).
          03 PT-PWY-STATE-CODE                PIC X(2).
          03 PT-PWY-ZIP-CODE                  PIC X(9).
          03 PT-PWY-PHONE                     PIC X(14).
          03 PT-PWY-AGENCY-CODE               PIC X(6).
          03 PT-PWY-AGENT-NAME                PIC X(30).
