******************************************************************
*  COPYBOOK  : GQAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AK
******************************************************************
 01  EN-QAK-ENDORSEMENT.

          03 EN-QAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QAK-FORM-NUMBER               PIC X(10).
          03 EN-QAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-QAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
