******************************************************************
*  COPYBOOK  : GQAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AK
******************************************************************
 01  PT-QAK-PARTY.

          03 PT-QAK-INSURED-NAME              PIC X(40).
          03 PT-QAK-TAX-ID                    PIC X(11).
          03 PT-QAK-ADDRESS-LINE1             PIC X(30).
          03 PT-QAK-ADDRESS-LINE2             PIC X(30).
          03 PT-QAK-CITY                      PIC X(20).
          03 PT-QAK-STATE-CODE                PIC X(2).
          03 PT-QAK-ZIP-CODE                  PIC X(9).
          03 PT-QAK-PHONE                     PIC X(14).
          03 PT-QAK-AGENCY-CODE               PIC X(6).
          03 PT-QAK-AGENT-NAME                PIC X(30).
