******************************************************************
*  COPYBOOK  : GQALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AL
******************************************************************
 01  PT-QAL-PARTY.

          03 PT-QAL-INSURED-NAME              PIC X(40).
          03 PT-QAL-TAX-ID                    PIC X(11).
          03 PT-QAL-ADDRESS-LINE1             PIC X(30).
          03 PT-QAL-ADDRESS-LINE2             PIC X(30).
          03 PT-QAL-CITY                      PIC X(20).
          03 PT-QAL-STATE-CODE                PIC X(2).
          03 PT-QAL-ZIP-CODE                  PIC X(9).
          03 PT-QAL-PHONE                     PIC X(14).
          03 PT-QAL-AGENCY-CODE               PIC X(6).
          03 PT-QAL-AGENT-NAME                PIC X(30).
