******************************************************************
*  COPYBOOK  : GQALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AL
******************************************************************
 01  EN-QAL-ENDORSEMENT.

          03 EN-QAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QAL-FORM-NUMBER               PIC X(10).
          03 EN-QAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-QAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
