******************************************************************
*  COPYBOOK  : GQARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AR
******************************************************************
 01  PT-QAR-PARTY.

          03 PT-QAR-INSURED-NAME              PIC X(40).
          03 PT-QAR-TAX-ID                    PIC X(11).
          03 PT-QAR-ADDRESS-LINE1             PIC X(30).
          03 PT-QAR-ADDRESS-LINE2             PIC X(30).
          03 PT-QAR-CITY                      PIC X(20).
          03 PT-QAR-STATE-CODE                PIC X(2).
          03 PT-QAR-ZIP-CODE                  PIC X(9).
          03 PT-QAR-PHONE                     PIC X(14).
          03 PT-QAR-AGENCY-CODE               PIC X(6).
          03 PT-QAR-AGENT-NAME                PIC X(30).
