******************************************************************
*  COPYBOOK  : GQARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AR
******************************************************************
 01  EN-QAR-ENDORSEMENT.

          03 EN-QAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QAR-FORM-NUMBER               PIC X(10).
          03 EN-QAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-QAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
