******************************************************************
*  COPYBOOK  : GQAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AZ
******************************************************************
 01  EN-QAZ-ENDORSEMENT.

          03 EN-QAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QAZ-FORM-NUMBER               PIC X(10).
          03 EN-QAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-QAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
