******************************************************************
*  COPYBOOK  : GQAZY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : AZ
******************************************************************
 01  PT-QAZ-PARTY.

          03 PT-QAZ-INSURED-NAME              PIC X(40).
          03 PT-QAZ-TAX-ID                    PIC X(11).
          03 PT-QAZ-ADDRESS-LINE1             PIC X(30).
          03 PT-QAZ-ADDRESS-LINE2             PIC X(30).
          03 PT-QAZ-CITY                      PIC X(20).
          03 PT-QAZ-STATE-CODE                PIC X(2).
          03 PT-QAZ-ZIP-CODE                  PIC X(9).
          03 PT-QAZ-PHONE                     PIC X(14).
          03 PT-QAZ-AGENCY-CODE               PIC X(6).
          03 PT-QAZ-AGENT-NAME                PIC X(30).
