******************************************************************
*  COPYBOOK  : GQCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : CA
******************************************************************
 01  EN-QCA-ENDORSEMENT.

          03 EN-QCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QCA-FORM-NUMBER               PIC X(10).
          03 EN-QCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
