******************************************************************
*  COPYBOOK  : GQCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : CO
******************************************************************
 01  EN-QCO-ENDORSEMENT.

          03 EN-QCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QCO-FORM-NUMBER               PIC X(10).
          03 EN-QCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-QCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
