******************************************************************
*  COPYBOOK  : GQCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : CO
******************************************************************
 01  PT-QCO-PARTY.

          03 PT-QCO-INSURED-NAME              PIC X(40).
          03 PT-QCO-TAX-ID                    PIC X(11).
          03 PT-QCO-ADDRESS-LINE1             PIC X(30).
          03 PT-QCO-ADDRESS-LINE2             PIC X(30).
          03 PT-QCO-CITY                      PIC X(20).
          03 PT-QCO-STATE-CODE                PIC X(2).
          03 PT-QCO-ZIP-CODE                  PIC X(9).
          03 PT-QCO-PHONE                     PIC X(14).
          03 PT-QCO-AGENCY-CODE               PIC X(6).
          03 PT-QCO-AGENT-NAME                PIC X(30).
