******************************************************************
*  COPYBOOK  : GQCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : CT
******************************************************************
 01  EN-QCT-ENDORSEMENT.

          03 EN-QCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QCT-FORM-NUMBER               PIC X(10).
          03 EN-QCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-QCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
