******************************************************************
*  COPYBOOK  : GQCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : CT
******************************************************************
 01  PT-QCT-PARTY.

          03 PT-QCT-INSURED-NAME              PIC X(40).
          03 PT-QCT-TAX-ID                    PIC X(11).
          03 PT-QCT-ADDRESS-LINE1             PIC X(30).
          03 PT-QCT-ADDRESS-LINE2             PIC X(30).
          03 PT-QCT-CITY                      PIC X(20).
          03 PT-QCT-STATE-CODE                PIC X(2).
          03 PT-QCT-ZIP-CODE                  PIC X(9).
          03 PT-QCT-PHONE                     PIC X(14).
          03 PT-QCT-AGENCY-CODE               PIC X(6).
          03 PT-QCT-AGENT-NAME                PIC X(30).
