******************************************************************
*  COPYBOOK  : GQDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : DC
******************************************************************
 01  EN-QDC-ENDORSEMENT.

          03 EN-QDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QDC-FORM-NUMBER               PIC X(10).
          03 EN-QDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-QDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
