******************************************************************
*  COPYBOOK  : GQDCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : DC
******************************************************************
 01  PT-QDC-PARTY.

          03 PT-QDC-INSURED-NAME              PIC X(40).
          03 PT-QDC-TAX-ID                    PIC X(11).
          03 PT-QDC-ADDRESS-LINE1             PIC X(30).
          03 PT-QDC-ADDRESS-LINE2             PIC X(30).
          03 PT-QDC-CITY                      PIC X(20).
          03 PT-QDC-STATE-CODE                PIC X(2).
          03 PT-QDC-ZIP-CODE                  PIC X(9).
          03 PT-QDC-PHONE                     PIC X(14).
          03 PT-QDC-AGENCY-CODE               PIC X(6).
          03 PT-QDC-AGENT-NAME                PIC X(30).
