******************************************************************
*  COPYBOOK  : GQDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : DE
******************************************************************
 01  PT-QDE-PARTY.

          03 PT-QDE-INSURED-NAME              PIC X(40).
          03 PT-QDE-TAX-ID                    PIC X(11).
          03 PT-QDE-ADDRESS-LINE1             PIC X(30).
          03 PT-QDE-ADDRESS-LINE2             PIC X(30).
          03 PT-QDE-CITY                      PIC X(20).
          03 PT-QDE-STATE-CODE                PIC X(2).
          03 PT-QDE-ZIP-CODE                  PIC X(9).
          03 PT-QDE-PHONE                     PIC X(14).
          03 PT-QDE-AGENCY-CODE               PIC X(6).
          03 PT-QDE-AGENT-NAME                PIC X(30).
