******************************************************************
*  COPYBOOK  : GQDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : DE
******************************************************************
 01  EN-QDE-ENDORSEMENT.

          03 EN-QDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QDE-FORM-NUMBER               PIC X(10).
          03 EN-QDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-QDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
