******************************************************************
*  COPYBOOK  : GQFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : FL
******************************************************************
 01  PT-QFL-PARTY.

          03 PT-QFL-INSURED-NAME              PIC X(40).
          03 PT-QFL-TAX-ID                    PIC X(11).
          03 PT-QFL-ADDRESS-LINE1             PIC X(30).
          03 PT-QFL-ADDRESS-LINE2             PIC X(30).
          03 PT-QFL-CITY                      PIC X(20).
          03 PT-QFL-STATE-CODE                PIC X(2).
          03 PT-QFL-ZIP-CODE                  PIC X(9).
          03 PT-QFL-PHONE                     PIC X(14).
          03 PT-QFL-AGENCY-CODE               PIC X(6).
          03 PT-QFL-AGENT-NAME                PIC X(30).
