******************************************************************
*  COPYBOOK  : GQFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : FL
******************************************************************
 01  EN-QFL-ENDORSEMENT.

          03 EN-QFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QFL-FORM-NUMBER               PIC X(10).
          03 EN-QFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-QFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
