******************************************************************
*  COPYBOOK  : GQGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : GA
******************************************************************
 01  EN-QGA-ENDORSEMENT.

          03 EN-QGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QGA-FORM-NUMBER               PIC X(10).
          03 EN-QGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
