******************************************************************
*  COPYBOOK  : GQHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : HI
******************************************************************
 01  EN-QHI-ENDORSEMENT.

          03 EN-QHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QHI-FORM-NUMBER               PIC X(10).
          03 EN-QHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-QHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
