******************************************************************
*  COPYBOOK  : GQIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IA
******************************************************************
 01  PT-QIA-PARTY.

          03 PT-QIA-INSURED-NAME              PIC X(40).
          03 PT-QIA-TAX-ID                    PIC X(11).
          03 PT-QIA-ADDRESS-LINE1             PIC X(30).
          03 PT-QIA-ADDRESS-LINE2             PIC X(30).
          03 PT-QIA-CITY                      PIC X(20).
          03 PT-QIA-STATE-CODE                PIC X(2).
          03 PT-QIA-ZIP-CODE                  PIC X(9).
          03 PT-QIA-PHONE                     PIC X(14).
          03 PT-QIA-AGENCY-CODE               PIC X(6).
          03 PT-QIA-AGENT-NAME                PIC X(30).
