******************************************************************
*  COPYBOOK  : GQIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IA
******************************************************************
 01  EN-QIA-ENDORSEMENT.

          03 EN-QIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QIA-FORM-NUMBER               PIC X(10).
          03 EN-QIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
