******************************************************************
*  COPYBOOK  : GQIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ID
******************************************************************
 01  EN-QID-ENDORSEMENT.

          03 EN-QID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QID-FORM-NUMBER               PIC X(10).
          03 EN-QID-EFFECTIVE-DATE            PIC X(10).
          03 EN-QID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
