******************************************************************
*  COPYBOOK  : GQIDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ID
******************************************************************
 01  PT-QID-PARTY.

          03 PT-QID-INSURED-NAME              PIC X(40).
          03 PT-QID-TAX-ID                    PIC X(11).
          03 PT-QID-ADDRESS-LINE1             PIC X(30).
          03 PT-QID-ADDRESS-LINE2             PIC X(30).
          03 PT-QID-CITY                      PIC X(20).
          03 PT-QID-STATE-CODE                PIC X(2).
          03 PT-QID-ZIP-CODE                  PIC X(9).
          03 PT-QID-PHONE                     PIC X(14).
          03 PT-QID-AGENCY-CODE               PIC X(6).
          03 PT-QID-AGENT-NAME                PIC X(30).
