******************************************************************
*  COPYBOOK  : GQILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IL
******************************************************************
 01  EN-QIL-ENDORSEMENT.

          03 EN-QIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QIL-FORM-NUMBER               PIC X(10).
          03 EN-QIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-QIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
