******************************************************************
*  COPYBOOK  : GQILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IL
******************************************************************
 01  PT-QIL-PARTY.

          03 PT-QIL-INSURED-NAME              PIC X(40).
          03 PT-QIL-TAX-ID                    PIC X(11).
          03 PT-QIL-ADDRESS-LINE1             PIC X(30).
          03 PT-QIL-ADDRESS-LINE2             PIC X(30).
          03 PT-QIL-CITY                      PIC X(20).
          03 PT-QIL-STATE-CODE                PIC X(2).
          03 PT-QIL-ZIP-CODE                  PIC X(9).
          03 PT-QIL-PHONE                     PIC X(14).
          03 PT-QIL-AGENCY-CODE               PIC X(6).
          03 PT-QIL-AGENT-NAME                PIC X(30).
