******************************************************************
*  COPYBOOK  : GQINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IN
******************************************************************
 01  PT-QIN-PARTY.

          03 PT-QIN-INSURED-NAME              PIC X(40).
          03 PT-QIN-TAX-ID                    PIC X(11).
          03 PT-QIN-ADDRESS-LINE1             PIC X(30).
          03 PT-QIN-ADDRESS-LINE2             PIC X(30).
          03 PT-QIN-CITY                      PIC X(20).
          03 PT-QIN-STATE-CODE                PIC X(2).
          03 PT-QIN-ZIP-CODE                  PIC X(9).
          03 PT-QIN-PHONE                     PIC X(14).
          03 PT-QIN-AGENCY-CODE               PIC X(6).
          03 PT-QIN-AGENT-NAME                PIC X(30).
