******************************************************************
*  COPYBOOK  : GQINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : IN
******************************************************************
 01  EN-QIN-ENDORSEMENT.

          03 EN-QIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QIN-FORM-NUMBER               PIC X(10).
          03 EN-QIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-QIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
