******************************************************************
*  COPYBOOK  : GQKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : KS
******************************************************************
 01  PT-QKS-PARTY.

          03 PT-QKS-INSURED-NAME              PIC X(40).
          03 PT-QKS-TAX-ID                    PIC X(11).
          03 PT-QKS-ADDRESS-LINE1             PIC X(30).
          03 PT-QKS-ADDRESS-LINE2             PIC X(30).
          03 PT-QKS-CITY                      PIC X(20).
          03 PT-QKS-STATE-CODE                PIC X(2).
          03 PT-QKS-ZIP-CODE                  PIC X(9).
          03 PT-QKS-PHONE                     PIC X(14).
          03 PT-QKS-AGENCY-CODE               PIC X(6).
          03 PT-QKS-AGENT-NAME                PIC X(30).
