******************************************************************
*  COPYBOOK  : GQKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : KS
******************************************************************
 01  EN-QKS-ENDORSEMENT.

          03 EN-QKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QKS-FORM-NUMBER               PIC X(10).
          03 EN-QKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-QKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
