******************************************************************
*  COPYBOOK  : GQKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : KY
******************************************************************
 01  EN-QKY-ENDORSEMENT.

          03 EN-QKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QKY-FORM-NUMBER               PIC X(10).
          03 EN-QKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-QKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
