******************************************************************
*  COPYBOOK  : GQKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : KY
******************************************************************
 01  PT-QKY-PARTY.

          03 PT-QKY-INSURED-NAME              PIC X(40).
          03 PT-QKY-TAX-ID                    PIC X(11).
          03 PT-QKY-ADDRESS-LINE1             PIC X(30).
          03 PT-QKY-ADDRESS-LINE2             PIC X(30).
          03 PT-QKY-CITY                      PIC X(20).
          03 PT-QKY-STATE-CODE                PIC X(2).
          03 PT-QKY-ZIP-CODE                  PIC X(9).
          03 PT-QKY-PHONE                     PIC X(14).
          03 PT-QKY-AGENCY-CODE               PIC X(6).
          03 PT-QKY-AGENT-NAME                PIC X(30).
