******************************************************************
*  COPYBOOK  : GQLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : LA
******************************************************************
 01  EN-QLA-ENDORSEMENT.

          03 EN-QLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QLA-FORM-NUMBER               PIC X(10).
          03 EN-QLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
