******************************************************************
*  COPYBOOK  : GQLAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : LA
******************************************************************
 01  PT-QLA-PARTY.

          03 PT-QLA-INSURED-NAME              PIC X(40).
          03 PT-QLA-TAX-ID                    PIC X(11).
          03 PT-QLA-ADDRESS-LINE1             PIC X(30).
          03 PT-QLA-ADDRESS-LINE2             PIC X(30).
          03 PT-QLA-CITY                      PIC X(20).
          03 PT-QLA-STATE-CODE                PIC X(2).
          03 PT-QLA-ZIP-CODE                  PIC X(9).
          03 PT-QLA-PHONE                     PIC X(14).
          03 PT-QLA-AGENCY-CODE               PIC X(6).
          03 PT-QLA-AGENT-NAME                PIC X(30).
