******************************************************************
*  COPYBOOK  : GQMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MA
******************************************************************
 01  PT-QMA-PARTY.

          03 PT-QMA-INSURED-NAME              PIC X(40).
          03 PT-QMA-TAX-ID                    PIC X(11).
          03 PT-QMA-ADDRESS-LINE1             PIC X(30).
          03 PT-QMA-ADDRESS-LINE2             PIC X(30).
          03 PT-QMA-CITY                      PIC X(20).
          03 PT-QMA-STATE-CODE                PIC X(2).
          03 PT-QMA-ZIP-CODE                  PIC X(9).
          03 PT-QMA-PHONE                     PIC X(14).
          03 PT-QMA-AGENCY-CODE               PIC X(6).
          03 PT-QMA-AGENT-NAME                PIC X(30).
