******************************************************************
*  COPYBOOK  : GQMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MA
******************************************************************
 01  EN-QMA-ENDORSEMENT.

          03 EN-QMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMA-FORM-NUMBER               PIC X(10).
          03 EN-QMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
