******************************************************************
*  COPYBOOK  : GQMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MD
******************************************************************
 01  EN-QMD-ENDORSEMENT.

          03 EN-QMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMD-FORM-NUMBER               PIC X(10).
          03 EN-QMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
