******************************************************************
*  COPYBOOK  : GQMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ME
******************************************************************
 01  PT-QME-PARTY.

          03 PT-QME-INSURED-NAME              PIC X(40).
          03 PT-QME-TAX-ID                    PIC X(11).
          03 PT-QME-ADDRESS-LINE1             PIC X(30).
          03 PT-QME-ADDRESS-LINE2             PIC X(30).
          03 PT-QME-CITY                      PIC X(20).
          03 PT-QME-STATE-CODE                PIC X(2).
          03 PT-QME-ZIP-CODE                  PIC X(9).
          03 PT-QME-PHONE                     PIC X(14).
          03 PT-QME-AGENCY-CODE               PIC X(6).
          03 PT-QME-AGENT-NAME                PIC X(30).
