******************************************************************
*  COPYBOOK  : GQMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ME
******************************************************************
 01  EN-QME-ENDORSEMENT.

          03 EN-QME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QME-FORM-NUMBER               PIC X(10).
          03 EN-QME-EFFECTIVE-DATE            PIC X(10).
          03 EN-QME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
