******************************************************************
*  COPYBOOK  : GQMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MI
******************************************************************
 01  EN-QMI-ENDORSEMENT.

          03 EN-QMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMI-FORM-NUMBER               PIC X(10).
          03 EN-QMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
