******************************************************************
*  COPYBOOK  : GQMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MN
******************************************************************
 01  EN-QMN-ENDORSEMENT.

          03 EN-QMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMN-FORM-NUMBER               PIC X(10).
          03 EN-QMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
