******************************************************************
*  COPYBOOK  : GQMNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MN
******************************************************************
 01  PT-QMN-PARTY.

          03 PT-QMN-INSURED-NAME              PIC X(40).
          03 PT-QMN-TAX-ID                    PIC X(11).
          03 PT-QMN-ADDRESS-LINE1             PIC X(30).
          03 PT-QMN-ADDRESS-LINE2             PIC X(30).
          03 PT-QMN-CITY                      PIC X(20).
          03 PT-QMN-STATE-CODE                PIC X(2).
          03 PT-QMN-ZIP-CODE                  PIC X(9).
          03 PT-QMN-PHONE                     PIC X(14).
          03 PT-QMN-AGENCY-CODE               PIC X(6).
          03 PT-QMN-AGENT-NAME                PIC X(30).
