******************************************************************
*  COPYBOOK  : GQMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MO
******************************************************************
 01  EN-QMO-ENDORSEMENT.

          03 EN-QMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMO-FORM-NUMBER               PIC X(10).
          03 EN-QMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
