******************************************************************
*  COPYBOOK  : GQMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MO
******************************************************************
 01  PT-QMO-PARTY.

          03 PT-QMO-INSURED-NAME              PIC X(40).
          03 PT-QMO-TAX-ID                    PIC X(11).
          03 PT-QMO-ADDRESS-LINE1             PIC X(30).
          03 PT-QMO-ADDRESS-LINE2             PIC X(30).
          03 PT-QMO-CITY                      PIC X(20).
          03 PT-QMO-STATE-CODE                PIC X(2).
          03 PT-QMO-ZIP-CODE                  PIC X(9).
          03 PT-QMO-PHONE                     PIC X(14).
          03 PT-QMO-AGENCY-CODE               PIC X(6).
          03 PT-QMO-AGENT-NAME                PIC X(30).
