******************************************************************
*  COPYBOOK  : GQMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MS
******************************************************************
 01  PT-QMS-PARTY.

          03 PT-QMS-INSURED-NAME              PIC X(40).
          03 PT-QMS-TAX-ID                    PIC X(11).
          03 PT-QMS-ADDRESS-LINE1             PIC X(30).
          03 PT-QMS-ADDRESS-LINE2             PIC X(30).
          03 PT-QMS-CITY                      PIC X(20).
          03 PT-QMS-STATE-CODE                PIC X(2).
          03 PT-QMS-ZIP-CODE                  PIC X(9).
          03 PT-QMS-PHONE                     PIC X(14).
          03 PT-QMS-AGENCY-CODE               PIC X(6).
          03 PT-QMS-AGENT-NAME                PIC X(30).
