******************************************************************
*  COPYBOOK  : GQMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MS
******************************************************************
 01  EN-QMS-ENDORSEMENT.

          03 EN-QMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMS-FORM-NUMBER               PIC X(10).
          03 EN-QMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
