******************************************************************
*  COPYBOOK  : GQMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : MT
******************************************************************
 01  EN-QMT-ENDORSEMENT.

          03 EN-QMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QMT-FORM-NUMBER               PIC X(10).
          03 EN-QMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-QMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
