******************************************************************
*  COPYBOOK  : GQNCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NC
******************************************************************
 01  PT-QNC-PARTY.

          03 PT-QNC-INSURED-NAME              PIC X(40).
          03 PT-QNC-TAX-ID                    PIC X(11).
          03 PT-QNC-ADDRESS-LINE1             PIC X(30).
          03 PT-QNC-ADDRESS-LINE2             PIC X(30).
          03 PT-QNC-CITY                      PIC X(20).
          03 PT-QNC-STATE-CODE                PIC X(2).
          03 PT-QNC-ZIP-CODE                  PIC X(9).
          03 PT-QNC-PHONE                     PIC X(14).
          03 PT-QNC-AGENCY-CODE               PIC X(6).
          03 PT-QNC-AGENT-NAME                PIC X(30).
