******************************************************************
*  COPYBOOK  : GQNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NC
******************************************************************
 01  EN-QNC-ENDORSEMENT.

          03 EN-QNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNC-FORM-NUMBER               PIC X(10).
          03 EN-QNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
