******************************************************************
*  COPYBOOK  : GQNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ND
******************************************************************
 01  EN-QND-ENDORSEMENT.

          03 EN-QND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QND-FORM-NUMBER               PIC X(10).
          03 EN-QND-EFFECTIVE-DATE            PIC X(10).
          03 EN-QND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
