******************************************************************
*  COPYBOOK  : GQNDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : ND
******************************************************************
 01  PT-QND-PARTY.

          03 PT-QND-INSURED-NAME              PIC X(40).
          03 PT-QND-TAX-ID                    PIC X(11).
          03 PT-QND-ADDRESS-LINE1             PIC X(30).
          03 PT-QND-ADDRESS-LINE2             PIC X(30).
          03 PT-QND-CITY                      PIC X(20).
          03 PT-QND-STATE-CODE                PIC X(2).
          03 PT-QND-ZIP-CODE                  PIC X(9).
          03 PT-QND-PHONE                     PIC X(14).
          03 PT-QND-AGENCY-CODE               PIC X(6).
          03 PT-QND-AGENT-NAME                PIC X(30).
