******************************************************************
*  COPYBOOK  : GQNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NE
******************************************************************
 01  EN-QNE-ENDORSEMENT.

          03 EN-QNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNE-FORM-NUMBER               PIC X(10).
          03 EN-QNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
