******************************************************************
*  COPYBOOK  : GQNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NH
******************************************************************
 01  PT-QNH-PARTY.

          03 PT-QNH-INSURED-NAME              PIC X(40).
          03 PT-QNH-TAX-ID                    PIC X(11).
          03 PT-QNH-ADDRESS-LINE1             PIC X(30).
          03 PT-QNH-ADDRESS-LINE2             PIC X(30).
          03 PT-QNH-CITY                      PIC X(20).
          03 PT-QNH-STATE-CODE                PIC X(2).
          03 PT-QNH-ZIP-CODE                  PIC X(9).
          03 PT-QNH-PHONE                     PIC X(14).
          03 PT-QNH-AGENCY-CODE               PIC X(6).
          03 PT-QNH-AGENT-NAME                PIC X(30).
