******************************************************************
*  COPYBOOK  : GQNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NH
******************************************************************
 01  EN-QNH-ENDORSEMENT.

          03 EN-QNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNH-FORM-NUMBER               PIC X(10).
          03 EN-QNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
