******************************************************************
*  COPYBOOK  : GQNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NJ
******************************************************************
 01  PT-QNJ-PARTY.

          03 PT-QNJ-INSURED-NAME              PIC X(40).
          03 PT-QNJ-TAX-ID                    PIC X(11).
          03 PT-QNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-QNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-QNJ-CITY                      PIC X(20).
          03 PT-QNJ-STATE-CODE                PIC X(2).
          03 PT-QNJ-ZIP-CODE                  PIC X(9).
          03 PT-QNJ-PHONE                     PIC X(14).
          03 PT-QNJ-AGENCY-CODE               PIC X(6).
          03 PT-QNJ-AGENT-NAME                PIC X(30).
