******************************************************************
*  COPYBOOK  : GQNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NJ
******************************************************************
 01  EN-QNJ-ENDORSEMENT.

          03 EN-QNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNJ-FORM-NUMBER               PIC X(10).
          03 EN-QNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
