******************************************************************
*  COPYBOOK  : GQNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NM
******************************************************************
 01  EN-QNM-ENDORSEMENT.

          03 EN-QNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNM-FORM-NUMBER               PIC X(10).
          03 EN-QNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
