******************************************************************
*  COPYBOOK  : GQNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NM
******************************************************************
 01  PT-QNM-PARTY.

          03 PT-QNM-INSURED-NAME              PIC X(40).
          03 PT-QNM-TAX-ID                    PIC X(11).
          03 PT-QNM-ADDRESS-LINE1             PIC X(30).
          03 PT-QNM-ADDRESS-LINE2             PIC X(30).
          03 PT-QNM-CITY                      PIC X(20).
          03 PT-QNM-STATE-CODE                PIC X(2).
          03 PT-QNM-ZIP-CODE                  PIC X(9).
          03 PT-QNM-PHONE                     PIC X(14).
          03 PT-QNM-AGENCY-CODE               PIC X(6).
          03 PT-QNM-AGENT-NAME                PIC X(30).
