******************************************************************
*  COPYBOOK  : GQNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NV
******************************************************************
 01  EN-QNV-ENDORSEMENT.

          03 EN-QNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNV-FORM-NUMBER               PIC X(10).
          03 EN-QNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
