******************************************************************
*  COPYBOOK  : GQNVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NV
******************************************************************
 01  PT-QNV-PARTY.

          03 PT-QNV-INSURED-NAME              PIC X(40).
          03 PT-QNV-TAX-ID                    PIC X(11).
          03 PT-QNV-ADDRESS-LINE1             PIC X(30).
          03 PT-QNV-ADDRESS-LINE2             PIC X(30).
          03 PT-QNV-CITY                      PIC X(20).
          03 PT-QNV-STATE-CODE                PIC X(2).
          03 PT-QNV-ZIP-CODE                  PIC X(9).
          03 PT-QNV-PHONE                     PIC X(14).
          03 PT-QNV-AGENCY-CODE               PIC X(6).
          03 PT-QNV-AGENT-NAME                PIC X(30).
