******************************************************************
*  COPYBOOK  : GQNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NY
******************************************************************
 01  EN-QNY-ENDORSEMENT.

          03 EN-QNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QNY-FORM-NUMBER               PIC X(10).
          03 EN-QNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-QNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
