******************************************************************
*  COPYBOOK  : GQNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : NY
******************************************************************
 01  PT-QNY-PARTY.

          03 PT-QNY-INSURED-NAME              PIC X(40).
          03 PT-QNY-TAX-ID                    PIC X(11).
          03 PT-QNY-ADDRESS-LINE1             PIC X(30).
          03 PT-QNY-ADDRESS-LINE2             PIC X(30).
          03 PT-QNY-CITY                      PIC X(20).
          03 PT-QNY-STATE-CODE                PIC X(2).
          03 PT-QNY-ZIP-CODE                  PIC X(9).
          03 PT-QNY-PHONE                     PIC X(14).
          03 PT-QNY-AGENCY-CODE               PIC X(6).
          03 PT-QNY-AGENT-NAME                PIC X(30).
