******************************************************************
*  COPYBOOK  : GQOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OH
******************************************************************
 01  EN-QOH-ENDORSEMENT.

          03 EN-QOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QOH-FORM-NUMBER               PIC X(10).
          03 EN-QOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-QOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
