******************************************************************
*  COPYBOOK  : GQOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OH
******************************************************************
 01  PT-QOH-PARTY.

          03 PT-QOH-INSURED-NAME              PIC X(40).
          03 PT-QOH-TAX-ID                    PIC X(11).
          03 PT-QOH-ADDRESS-LINE1             PIC X(30).
          03 PT-QOH-ADDRESS-LINE2             PIC X(30).
          03 PT-QOH-CITY                      PIC X(20).
          03 PT-QOH-STATE-CODE                PIC X(2).
          03 PT-QOH-ZIP-CODE                  PIC X(9).
          03 PT-QOH-PHONE                     PIC X(14).
          03 PT-QOH-AGENCY-CODE               PIC X(6).
          03 PT-QOH-AGENT-NAME                PIC X(30).
