******************************************************************
*  COPYBOOK  : GQOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OK
******************************************************************
 01  EN-QOK-ENDORSEMENT.

          03 EN-QOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QOK-FORM-NUMBER               PIC X(10).
          03 EN-QOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-QOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
