******************************************************************
*  COPYBOOK  : GQOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OK
******************************************************************
 01  PT-QOK-PARTY.

          03 PT-QOK-INSURED-NAME              PIC X(40).
          03 PT-QOK-TAX-ID                    PIC X(11).
          03 PT-QOK-ADDRESS-LINE1             PIC X(30).
          03 PT-QOK-ADDRESS-LINE2             PIC X(30).
          03 PT-QOK-CITY                      PIC X(20).
          03 PT-QOK-STATE-CODE                PIC X(2).
          03 PT-QOK-ZIP-CODE                  PIC X(9).
          03 PT-QOK-PHONE                     PIC X(14).
          03 PT-QOK-AGENCY-CODE               PIC X(6).
          03 PT-QOK-AGENT-NAME                PIC X(30).
