******************************************************************
*  COPYBOOK  : GQORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OR
******************************************************************
 01  EN-QOR-ENDORSEMENT.

          03 EN-QOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QOR-FORM-NUMBER               PIC X(10).
          03 EN-QOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-QOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
