******************************************************************
*  COPYBOOK  : GQORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : OR
******************************************************************
 01  PT-QOR-PARTY.

          03 PT-QOR-INSURED-NAME              PIC X(40).
          03 PT-QOR-TAX-ID                    PIC X(11).
          03 PT-QOR-ADDRESS-LINE1             PIC X(30).
          03 PT-QOR-ADDRESS-LINE2             PIC X(30).
          03 PT-QOR-CITY                      PIC X(20).
          03 PT-QOR-STATE-CODE                PIC X(2).
          03 PT-QOR-ZIP-CODE                  PIC X(9).
          03 PT-QOR-PHONE                     PIC X(14).
          03 PT-QOR-AGENCY-CODE               PIC X(6).
          03 PT-QOR-AGENT-NAME                PIC X(30).
