******************************************************************
*  COPYBOOK  : GQPAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : PA
******************************************************************
 01  PT-QPA-PARTY.

          03 PT-QPA-INSURED-NAME              PIC X(40).
          03 PT-QPA-TAX-ID                    PIC X(11).
          03 PT-QPA-ADDRESS-LINE1             PIC X(30).
          03 PT-QPA-ADDRESS-LINE2             PIC X(30).
          03 PT-QPA-CITY                      PIC X(20).
          03 PT-QPA-STATE-CODE                PIC X(2).
          03 PT-QPA-ZIP-CODE                  PIC X(9).
          03 PT-QPA-PHONE                     PIC X(14).
          03 PT-QPA-AGENCY-CODE               PIC X(6).
          03 PT-QPA-AGENT-NAME                PIC X(30).
