******************************************************************
*  COPYBOOK  : GQPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : PA
******************************************************************
 01  EN-QPA-ENDORSEMENT.

          03 EN-QPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QPA-FORM-NUMBER               PIC X(10).
          03 EN-QPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
