******************************************************************
*  COPYBOOK  : GQRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : RI
******************************************************************
 01  PT-QRI-PARTY.

          03 PT-QRI-INSURED-NAME              PIC X(40).
          03 PT-QRI-TAX-ID                    PIC X(11).
          03 PT-QRI-ADDRESS-LINE1             PIC X(30).
          03 PT-QRI-ADDRESS-LINE2             PIC X(30).
          03 PT-QRI-CITY                      PIC X(20).
          03 PT-QRI-STATE-CODE                PIC X(2).
          03 PT-QRI-ZIP-CODE                  PIC X(9).
          03 PT-QRI-PHONE                     PIC X(14).
          03 PT-QRI-AGENCY-CODE               PIC X(6).
          03 PT-QRI-AGENT-NAME                PIC X(30).
