******************************************************************
*  COPYBOOK  : GQRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : RI
******************************************************************
 01  EN-QRI-ENDORSEMENT.

          03 EN-QRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QRI-FORM-NUMBER               PIC X(10).
          03 EN-QRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-QRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
