******************************************************************
*  COPYBOOK  : GQSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : SC
******************************************************************
 01  PT-QSC-PARTY.

          03 PT-QSC-INSURED-NAME              PIC X(40).
          03 PT-QSC-TAX-ID                    PIC X(11).
          03 PT-QSC-ADDRESS-LINE1             PIC X(30).
          03 PT-QSC-ADDRESS-LINE2             PIC X(30).
          03 PT-QSC-CITY                      PIC X(20).
          03 PT-QSC-STATE-CODE                PIC X(2).
          03 PT-QSC-ZIP-CODE                  PIC X(9).
          03 PT-QSC-PHONE                     PIC X(14).
          03 PT-QSC-AGENCY-CODE               PIC X(6).
          03 PT-QSC-AGENT-NAME                PIC X(30).
