******************************************************************
*  COPYBOOK  : GQSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : SC
******************************************************************
 01  EN-QSC-ENDORSEMENT.

          03 EN-QSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QSC-FORM-NUMBER               PIC X(10).
          03 EN-QSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-QSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
