******************************************************************
*  COPYBOOK  : GQSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : SD
******************************************************************
 01  EN-QSD-ENDORSEMENT.

          03 EN-QSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QSD-FORM-NUMBER               PIC X(10).
          03 EN-QSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-QSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
