******************************************************************
*  COPYBOOK  : GQTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : TN
******************************************************************
 01  EN-QTN-ENDORSEMENT.

          03 EN-QTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QTN-FORM-NUMBER               PIC X(10).
          03 EN-QTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-QTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
