******************************************************************
*  COPYBOOK  : GQTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : TN
******************************************************************
 01  PT-QTN-PARTY.

          03 PT-QTN-INSURED-NAME              PIC X(40).
          03 PT-QTN-TAX-ID                    PIC X(11).
          03 PT-QTN-ADDRESS-LINE1             PIC X(30).
          03 PT-QTN-ADDRESS-LINE2             PIC X(30).
          03 PT-QTN-CITY                      PIC X(20).
          03 PT-QTN-STATE-CODE                PIC X(2).
          03 PT-QTN-ZIP-CODE                  PIC X(9).
          03 PT-QTN-PHONE                     PIC X(14).
          03 PT-QTN-AGENCY-CODE               PIC X(6).
          03 PT-QTN-AGENT-NAME                PIC X(30).
