******************************************************************
*  COPYBOOK  : GQTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : TX
******************************************************************
 01  EN-QTX-ENDORSEMENT.

          03 EN-QTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QTX-FORM-NUMBER               PIC X(10).
          03 EN-QTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-QTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
