******************************************************************
*  COPYBOOK  : GQTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : TX
******************************************************************
 01  PT-QTX-PARTY.

          03 PT-QTX-INSURED-NAME              PIC X(40).
          03 PT-QTX-TAX-ID                    PIC X(11).
          03 PT-QTX-ADDRESS-LINE1             PIC X(30).
          03 PT-QTX-ADDRESS-LINE2             PIC X(30).
          03 PT-QTX-CITY                      PIC X(20).
          03 PT-QTX-STATE-CODE                PIC X(2).
          03 PT-QTX-ZIP-CODE                  PIC X(9).
          03 PT-QTX-PHONE                     PIC X(14).
          03 PT-QTX-AGENCY-CODE               PIC X(6).
          03 PT-QTX-AGENT-NAME                PIC X(30).
