******************************************************************
*  COPYBOOK  : GQUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : UT
******************************************************************
 01  EN-QUT-ENDORSEMENT.

          03 EN-QUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QUT-FORM-NUMBER               PIC X(10).
          03 EN-QUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-QUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
