******************************************************************
*  COPYBOOK  : GQUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : UT
******************************************************************
 01  PT-QUT-PARTY.

          03 PT-QUT-INSURED-NAME              PIC X(40).
          03 PT-QUT-TAX-ID                    PIC X(11).
          03 PT-QUT-ADDRESS-LINE1             PIC X(30).
          03 PT-QUT-ADDRESS-LINE2             PIC X(30).
          03 PT-QUT-CITY                      PIC X(20).
          03 PT-QUT-STATE-CODE                PIC X(2).
          03 PT-QUT-ZIP-CODE                  PIC X(9).
          03 PT-QUT-PHONE                     PIC X(14).
          03 PT-QUT-AGENCY-CODE               PIC X(6).
          03 PT-QUT-AGENT-NAME                PIC X(30).
