******************************************************************
*  COPYBOOK  : GQVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : VA
******************************************************************
 01  PT-QVA-PARTY.

          03 PT-QVA-INSURED-NAME              PIC X(40).
          03 PT-QVA-TAX-ID                    PIC X(11).
          03 PT-QVA-ADDRESS-LINE1             PIC X(30).
          03 PT-QVA-ADDRESS-LINE2             PIC X(30).
          03 PT-QVA-CITY                      PIC X(20).
          03 PT-QVA-STATE-CODE                PIC X(2).
          03 PT-QVA-ZIP-CODE                  PIC X(9).
          03 PT-QVA-PHONE                     PIC X(14).
          03 PT-QVA-AGENCY-CODE               PIC X(6).
          03 PT-QVA-AGENT-NAME                PIC X(30).
