******************************************************************
*  COPYBOOK  : GQVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : VA
******************************************************************
 01  EN-QVA-ENDORSEMENT.

          03 EN-QVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QVA-FORM-NUMBER               PIC X(10).
          03 EN-QVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
