******************************************************************
*  COPYBOOK  : GQVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : VT
******************************************************************
 01  PT-QVT-PARTY.

          03 PT-QVT-INSURED-NAME              PIC X(40).
          03 PT-QVT-TAX-ID                    PIC X(11).
          03 PT-QVT-ADDRESS-LINE1             PIC X(30).
          03 PT-QVT-ADDRESS-LINE2             PIC X(30).
          03 PT-QVT-CITY                      PIC X(20).
          03 PT-QVT-STATE-CODE                PIC X(2).
          03 PT-QVT-ZIP-CODE                  PIC X(9).
          03 PT-QVT-PHONE                     PIC X(14).
          03 PT-QVT-AGENCY-CODE               PIC X(6).
          03 PT-QVT-AGENT-NAME                PIC X(30).
