******************************************************************
*  COPYBOOK  : GQVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : VT
******************************************************************
 01  EN-QVT-ENDORSEMENT.

          03 EN-QVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QVT-FORM-NUMBER               PIC X(10).
          03 EN-QVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-QVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
