******************************************************************
*  COPYBOOK  : GQWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WA
******************************************************************
 01  PT-QWA-PARTY.

          03 PT-QWA-INSURED-NAME              PIC X(40).
          03 PT-QWA-TAX-ID                    PIC X(11).
          03 PT-QWA-ADDRESS-LINE1             PIC X(30).
          03 PT-QWA-ADDRESS-LINE2             PIC X(30).
          03 PT-QWA-CITY                      PIC X(20).
          03 PT-QWA-STATE-CODE                PIC X(2).
          03 PT-QWA-ZIP-CODE                  PIC X(9).
          03 PT-QWA-PHONE                     PIC X(14).
          03 PT-QWA-AGENCY-CODE               PIC X(6).
          03 PT-QWA-AGENT-NAME                PIC X(30).
