******************************************************************
*  COPYBOOK  : GQWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WA
******************************************************************
 01  EN-QWA-ENDORSEMENT.

          03 EN-QWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QWA-FORM-NUMBER               PIC X(10).
          03 EN-QWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-QWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
