******************************************************************
*  COPYBOOK  : GQWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WI
******************************************************************
 01  EN-QWI-ENDORSEMENT.

          03 EN-QWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QWI-FORM-NUMBER               PIC X(10).
          03 EN-QWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-QWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
