******************************************************************
*  COPYBOOK  : GQWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WI
******************************************************************
 01  PT-QWI-PARTY.

          03 PT-QWI-INSURED-NAME              PIC X(40).
          03 PT-QWI-TAX-ID                    PIC X(11).
          03 PT-QWI-ADDRESS-LINE1             PIC X(30).
          03 PT-QWI-ADDRESS-LINE2             PIC X(30).
          03 PT-QWI-CITY                      PIC X(20).
          03 PT-QWI-STATE-CODE                PIC X(2).
          03 PT-QWI-ZIP-CODE                  PIC X(9).
          03 PT-QWI-PHONE                     PIC X(14).
          03 PT-QWI-AGENCY-CODE               PIC X(6).
          03 PT-QWI-AGENT-NAME                PIC X(30).
