******************************************************************
*  COPYBOOK  : GQWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WV
******************************************************************
 01  EN-QWV-ENDORSEMENT.

          03 EN-QWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QWV-FORM-NUMBER               PIC X(10).
          03 EN-QWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-QWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
