******************************************************************
*  COPYBOOK  : GQWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WV
******************************************************************
 01  PT-QWV-PARTY.

          03 PT-QWV-INSURED-NAME              PIC X(40).
          03 PT-QWV-TAX-ID                    PIC X(11).
          03 PT-QWV-ADDRESS-LINE1             PIC X(30).
          03 PT-QWV-ADDRESS-LINE2             PIC X(30).
          03 PT-QWV-CITY                      PIC X(20).
          03 PT-QWV-STATE-CODE                PIC X(2).
          03 PT-QWV-ZIP-CODE                  PIC X(9).
          03 PT-QWV-PHONE                     PIC X(14).
          03 PT-QWV-AGENCY-CODE               PIC X(6).
          03 PT-QWV-AGENT-NAME                PIC X(30).
