******************************************************************
*  COPYBOOK  : GQWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WY
******************************************************************
 01  PT-QWY-PARTY.

          03 PT-QWY-INSURED-NAME              PIC X(40).
          03 PT-QWY-TAX-ID                    PIC X(11).
          03 PT-QWY-ADDRESS-LINE1             PIC X(30).
          03 PT-QWY-ADDRESS-LINE2             PIC X(30).
          03 PT-QWY-CITY                      PIC X(20).
          03 PT-QWY-STATE-CODE                PIC X(2).
          03 PT-QWY-ZIP-CODE                  PIC X(9).
          03 PT-QWY-PHONE                     PIC X(14).
          03 PT-QWY-AGENCY-CODE               PIC X(6).
          03 PT-QWY-AGENT-NAME                PIC X(30).
