******************************************************************
*  COPYBOOK  : GQWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Liquor Liability (LQ)
*  STATE     : WY
******************************************************************
 01  EN-QWY-ENDORSEMENT.

          03 EN-QWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-QWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-QWY-FORM-NUMBER               PIC X(10).
          03 EN-QWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-QWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
