******************************************************************
*  COPYBOOK  : GBAKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AK
******************************************************************
 01  EN-BAK-ENDORSEMENT.

          03 EN-BAK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BAK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BAK-FORM-NUMBER               PIC X(10).
          03 EN-BAK-EFFECTIVE-DATE            PIC X(10).
          03 EN-BAK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
