******************************************************************
*  COPYBOOK  : GBAKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AK
******************************************************************
 01  PT-BAK-PARTY.

          03 PT-BAK-INSURED-NAME              PIC X(40).
          03 PT-BAK-TAX-ID                    PIC X(11).
          03 PT-BAK-ADDRESS-LINE1             PIC X(30).
          03 PT-BAK-ADDRESS-LINE2             PIC X(30).
          03 PT-BAK-CITY                      PIC X(20).
          03 PT-BAK-STATE-CODE                PIC X(2).
          03 PT-BAK-ZIP-CODE                  PIC X(9).
          03 PT-BAK-PHONE                     PIC X(14).
          03 PT-BAK-AGENCY-CODE               PIC X(6).
          03 PT-BAK-AGENT-NAME                PIC X(30).
