******************************************************************
*  COPYBOOK  : GBALE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AL
******************************************************************
 01  EN-BAL-ENDORSEMENT.

          03 EN-BAL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BAL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BAL-FORM-NUMBER               PIC X(10).
          03 EN-BAL-EFFECTIVE-DATE            PIC X(10).
          03 EN-BAL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
