******************************************************************
*  COPYBOOK  : GBALY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AL
******************************************************************
 01  PT-BAL-PARTY.

          03 PT-BAL-INSURED-NAME              PIC X(40).
          03 PT-BAL-TAX-ID                    PIC X(11).
          03 PT-BAL-ADDRESS-LINE1             PIC X(30).
          03 PT-BAL-ADDRESS-LINE2             PIC X(30).
          03 PT-BAL-CITY                      PIC X(20).
          03 PT-BAL-STATE-CODE                PIC X(2).
          03 PT-BAL-ZIP-CODE                  PIC X(9).
          03 PT-BAL-PHONE                     PIC X(14).
          03 PT-BAL-AGENCY-CODE               PIC X(6).
          03 PT-BAL-AGENT-NAME                PIC X(30).
