******************************************************************
*  COPYBOOK  : GBARE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AR
******************************************************************
 01  EN-BAR-ENDORSEMENT.

          03 EN-BAR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BAR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BAR-FORM-NUMBER               PIC X(10).
          03 EN-BAR-EFFECTIVE-DATE            PIC X(10).
          03 EN-BAR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
