******************************************************************
*  COPYBOOK  : GBARY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AR
******************************************************************
 01  PT-BAR-PARTY.

          03 PT-BAR-INSURED-NAME              PIC X(40).
          03 PT-BAR-TAX-ID                    PIC X(11).
          03 PT-BAR-ADDRESS-LINE1             PIC X(30).
          03 PT-BAR-ADDRESS-LINE2             PIC X(30).
          03 PT-BAR-CITY                      PIC X(20).
          03 PT-BAR-STATE-CODE                PIC X(2).
          03 PT-BAR-ZIP-CODE                  PIC X(9).
          03 PT-BAR-PHONE                     PIC X(14).
          03 PT-BAR-AGENCY-CODE               PIC X(6).
          03 PT-BAR-AGENT-NAME                PIC X(30).
