******************************************************************
*  COPYBOOK  : GBAZE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : AZ
******************************************************************
 01  EN-BAZ-ENDORSEMENT.

          03 EN-BAZ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BAZ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BAZ-FORM-NUMBER               PIC X(10).
          03 EN-BAZ-EFFECTIVE-DATE            PIC X(10).
          03 EN-BAZ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
