******************************************************************
*  COPYBOOK  : GBCAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : CA
******************************************************************
 01  EN-BCA-ENDORSEMENT.

          03 EN-BCA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BCA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BCA-FORM-NUMBER               PIC X(10).
          03 EN-BCA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BCA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
