******************************************************************
*  COPYBOOK  : GBCOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : CO
******************************************************************
 01  PT-BCO-PARTY.

          03 PT-BCO-INSURED-NAME              PIC X(40).
          03 PT-BCO-TAX-ID                    PIC X(11).
          03 PT-BCO-ADDRESS-LINE1             PIC X(30).
          03 PT-BCO-ADDRESS-LINE2             PIC X(30).
          03 PT-BCO-CITY                      PIC X(20).
          03 PT-BCO-STATE-CODE                PIC X(2).
          03 PT-BCO-ZIP-CODE                  PIC X(9).
          03 PT-BCO-PHONE                     PIC X(14).
          03 PT-BCO-AGENCY-CODE               PIC X(6).
          03 PT-BCO-AGENT-NAME                PIC X(30).
