******************************************************************
*  COPYBOOK  : GBCOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : CO
******************************************************************
 01  EN-BCO-ENDORSEMENT.

          03 EN-BCO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BCO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BCO-FORM-NUMBER               PIC X(10).
          03 EN-BCO-EFFECTIVE-DATE            PIC X(10).
          03 EN-BCO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
