******************************************************************
*  COPYBOOK  : GBCTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : CT
******************************************************************
 01  PT-BCT-PARTY.

          03 PT-BCT-INSURED-NAME              PIC X(40).
          03 PT-BCT-TAX-ID                    PIC X(11).
          03 PT-BCT-ADDRESS-LINE1             PIC X(30).
          03 PT-BCT-ADDRESS-LINE2             PIC X(30).
          03 PT-BCT-CITY                      PIC X(20).
          03 PT-BCT-STATE-CODE                PIC X(2).
          03 PT-BCT-ZIP-CODE                  PIC X(9).
          03 PT-BCT-PHONE                     PIC X(14).
          03 PT-BCT-AGENCY-CODE               PIC X(6).
          03 PT-BCT-AGENT-NAME                PIC X(30).
