******************************************************************
*  COPYBOOK  : GBCTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : CT
******************************************************************
 01  EN-BCT-ENDORSEMENT.

          03 EN-BCT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BCT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BCT-FORM-NUMBER               PIC X(10).
          03 EN-BCT-EFFECTIVE-DATE            PIC X(10).
          03 EN-BCT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
