******************************************************************
*  COPYBOOK  : GBDCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : DC
******************************************************************
 01  PT-BDC-PARTY.

          03 PT-BDC-INSURED-NAME              PIC X(40).
          03 PT-BDC-TAX-ID                    PIC X(11).
          03 PT-BDC-ADDRESS-LINE1             PIC X(30).
          03 PT-BDC-ADDRESS-LINE2             PIC X(30).
          03 PT-BDC-CITY                      PIC X(20).
          03 PT-BDC-STATE-CODE                PIC X(2).
          03 PT-BDC-ZIP-CODE                  PIC X(9).
          03 PT-BDC-PHONE                     PIC X(14).
          03 PT-BDC-AGENCY-CODE               PIC X(6).
          03 PT-BDC-AGENT-NAME                PIC X(30).
