******************************************************************
*  COPYBOOK  : GBDCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : DC
******************************************************************
 01  EN-BDC-ENDORSEMENT.

          03 EN-BDC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BDC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BDC-FORM-NUMBER               PIC X(10).
          03 EN-BDC-EFFECTIVE-DATE            PIC X(10).
          03 EN-BDC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
