******************************************************************
*  COPYBOOK  : GBDEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : DE
******************************************************************
 01  PT-BDE-PARTY.

          03 PT-BDE-INSURED-NAME              PIC X(40).
          03 PT-BDE-TAX-ID                    PIC X(11).
          03 PT-BDE-ADDRESS-LINE1             PIC X(30).
          03 PT-BDE-ADDRESS-LINE2             PIC X(30).
          03 PT-BDE-CITY                      PIC X(20).
          03 PT-BDE-STATE-CODE                PIC X(2).
          03 PT-BDE-ZIP-CODE                  PIC X(9).
          03 PT-BDE-PHONE                     PIC X(14).
          03 PT-BDE-AGENCY-CODE               PIC X(6).
          03 PT-BDE-AGENT-NAME                PIC X(30).
