******************************************************************
*  COPYBOOK  : GBDEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : DE
******************************************************************
 01  EN-BDE-ENDORSEMENT.

          03 EN-BDE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BDE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BDE-FORM-NUMBER               PIC X(10).
          03 EN-BDE-EFFECTIVE-DATE            PIC X(10).
          03 EN-BDE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
