******************************************************************
*  COPYBOOK  : GBFLE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : FL
******************************************************************
 01  EN-BFL-ENDORSEMENT.

          03 EN-BFL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BFL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BFL-FORM-NUMBER               PIC X(10).
          03 EN-BFL-EFFECTIVE-DATE            PIC X(10).
          03 EN-BFL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
