******************************************************************
*  COPYBOOK  : GBFLY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : FL
******************************************************************
 01  PT-BFL-PARTY.

          03 PT-BFL-INSURED-NAME              PIC X(40).
          03 PT-BFL-TAX-ID                    PIC X(11).
          03 PT-BFL-ADDRESS-LINE1             PIC X(30).
          03 PT-BFL-ADDRESS-LINE2             PIC X(30).
          03 PT-BFL-CITY                      PIC X(20).
          03 PT-BFL-STATE-CODE                PIC X(2).
          03 PT-BFL-ZIP-CODE                  PIC X(9).
          03 PT-BFL-PHONE                     PIC X(14).
          03 PT-BFL-AGENCY-CODE               PIC X(6).
          03 PT-BFL-AGENT-NAME                PIC X(30).
