******************************************************************
*  COPYBOOK  : GBGAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : GA
******************************************************************
 01  EN-BGA-ENDORSEMENT.

          03 EN-BGA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BGA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BGA-FORM-NUMBER               PIC X(10).
          03 EN-BGA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BGA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
