******************************************************************
*  COPYBOOK  : GBGAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : GA
******************************************************************
 01  PT-BGA-PARTY.

          03 PT-BGA-INSURED-NAME              PIC X(40).
          03 PT-BGA-TAX-ID                    PIC X(11).
          03 PT-BGA-ADDRESS-LINE1             PIC X(30).
          03 PT-BGA-ADDRESS-LINE2             PIC X(30).
          03 PT-BGA-CITY                      PIC X(20).
          03 PT-BGA-STATE-CODE                PIC X(2).
          03 PT-BGA-ZIP-CODE                  PIC X(9).
          03 PT-BGA-PHONE                     PIC X(14).
          03 PT-BGA-AGENCY-CODE               PIC X(6).
          03 PT-BGA-AGENT-NAME                PIC X(30).
