******************************************************************
*  COPYBOOK  : GBHIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : HI
******************************************************************
 01  EN-BHI-ENDORSEMENT.

          03 EN-BHI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BHI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BHI-FORM-NUMBER               PIC X(10).
          03 EN-BHI-EFFECTIVE-DATE            PIC X(10).
          03 EN-BHI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
