******************************************************************
*  COPYBOOK  : GBHIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : HI
******************************************************************
 01  PT-BHI-PARTY.

          03 PT-BHI-INSURED-NAME              PIC X(40).
          03 PT-BHI-TAX-ID                    PIC X(11).
          03 PT-BHI-ADDRESS-LINE1             PIC X(30).
          03 PT-BHI-ADDRESS-LINE2             PIC X(30).
          03 PT-BHI-CITY                      PIC X(20).
          03 PT-BHI-STATE-CODE                PIC X(2).
          03 PT-BHI-ZIP-CODE                  PIC X(9).
          03 PT-BHI-PHONE                     PIC X(14).
          03 PT-BHI-AGENCY-CODE               PIC X(6).
          03 PT-BHI-AGENT-NAME                PIC X(30).
