******************************************************************
*  COPYBOOK  : GBIAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IA
******************************************************************
 01  EN-BIA-ENDORSEMENT.

          03 EN-BIA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BIA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BIA-FORM-NUMBER               PIC X(10).
          03 EN-BIA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BIA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
