******************************************************************
*  COPYBOOK  : GBIAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IA
******************************************************************
 01  PT-BIA-PARTY.

          03 PT-BIA-INSURED-NAME              PIC X(40).
          03 PT-BIA-TAX-ID                    PIC X(11).
          03 PT-BIA-ADDRESS-LINE1             PIC X(30).
          03 PT-BIA-ADDRESS-LINE2             PIC X(30).
          03 PT-BIA-CITY                      PIC X(20).
          03 PT-BIA-STATE-CODE                PIC X(2).
          03 PT-BIA-ZIP-CODE                  PIC X(9).
          03 PT-BIA-PHONE                     PIC X(14).
          03 PT-BIA-AGENCY-CODE               PIC X(6).
          03 PT-BIA-AGENT-NAME                PIC X(30).
