******************************************************************
*  COPYBOOK  : GBIDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : ID
******************************************************************
 01  PT-BID-PARTY.

          03 PT-BID-INSURED-NAME              PIC X(40).
          03 PT-BID-TAX-ID                    PIC X(11).
          03 PT-BID-ADDRESS-LINE1             PIC X(30).
          03 PT-BID-ADDRESS-LINE2             PIC X(30).
          03 PT-BID-CITY                      PIC X(20).
          03 PT-BID-STATE-CODE                PIC X(2).
          03 PT-BID-ZIP-CODE                  PIC X(9).
          03 PT-BID-PHONE                     PIC X(14).
          03 PT-BID-AGENCY-CODE               PIC X(6).
          03 PT-BID-AGENT-NAME                PIC X(30).
