******************************************************************
*  COPYBOOK  : GBIDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : ID
******************************************************************
 01  EN-BID-ENDORSEMENT.

          03 EN-BID-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BID-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BID-FORM-NUMBER               PIC X(10).
          03 EN-BID-EFFECTIVE-DATE            PIC X(10).
          03 EN-BID-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
