******************************************************************
*  COPYBOOK  : GBILE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IL
******************************************************************
 01  EN-BIL-ENDORSEMENT.

          03 EN-BIL-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BIL-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BIL-FORM-NUMBER               PIC X(10).
          03 EN-BIL-EFFECTIVE-DATE            PIC X(10).
          03 EN-BIL-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
