******************************************************************
*  COPYBOOK  : GBILY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IL
******************************************************************
 01  PT-BIL-PARTY.

          03 PT-BIL-INSURED-NAME              PIC X(40).
          03 PT-BIL-TAX-ID                    PIC X(11).
          03 PT-BIL-ADDRESS-LINE1             PIC X(30).
          03 PT-BIL-ADDRESS-LINE2             PIC X(30).
          03 PT-BIL-CITY                      PIC X(20).
          03 PT-BIL-STATE-CODE                PIC X(2).
          03 PT-BIL-ZIP-CODE                  PIC X(9).
          03 PT-BIL-PHONE                     PIC X(14).
          03 PT-BIL-AGENCY-CODE               PIC X(6).
          03 PT-BIL-AGENT-NAME                PIC X(30).
