******************************************************************
*  COPYBOOK  : GBINY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IN
******************************************************************
 01  PT-BIN-PARTY.

          03 PT-BIN-INSURED-NAME              PIC X(40).
          03 PT-BIN-TAX-ID                    PIC X(11).
          03 PT-BIN-ADDRESS-LINE1             PIC X(30).
          03 PT-BIN-ADDRESS-LINE2             PIC X(30).
          03 PT-BIN-CITY                      PIC X(20).
          03 PT-BIN-STATE-CODE                PIC X(2).
          03 PT-BIN-ZIP-CODE                  PIC X(9).
          03 PT-BIN-PHONE                     PIC X(14).
          03 PT-BIN-AGENCY-CODE               PIC X(6).
          03 PT-BIN-AGENT-NAME                PIC X(30).
