******************************************************************
*  COPYBOOK  : GBINE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : IN
******************************************************************
 01  EN-BIN-ENDORSEMENT.

          03 EN-BIN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BIN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BIN-FORM-NUMBER               PIC X(10).
          03 EN-BIN-EFFECTIVE-DATE            PIC X(10).
          03 EN-BIN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
