******************************************************************
*  COPYBOOK  : GBKSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : KS
******************************************************************
 01  EN-BKS-ENDORSEMENT.

          03 EN-BKS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BKS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BKS-FORM-NUMBER               PIC X(10).
          03 EN-BKS-EFFECTIVE-DATE            PIC X(10).
          03 EN-BKS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
