******************************************************************
*  COPYBOOK  : GBKSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : KS
******************************************************************
 01  PT-BKS-PARTY.

          03 PT-BKS-INSURED-NAME              PIC X(40).
          03 PT-BKS-TAX-ID                    PIC X(11).
          03 PT-BKS-ADDRESS-LINE1             PIC X(30).
          03 PT-BKS-ADDRESS-LINE2             PIC X(30).
          03 PT-BKS-CITY                      PIC X(20).
          03 PT-BKS-STATE-CODE                PIC X(2).
          03 PT-BKS-ZIP-CODE                  PIC X(9).
          03 PT-BKS-PHONE                     PIC X(14).
          03 PT-BKS-AGENCY-CODE               PIC X(6).
          03 PT-BKS-AGENT-NAME                PIC X(30).
