******************************************************************
*  COPYBOOK  : GBKYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : KY
******************************************************************
 01  PT-BKY-PARTY.

          03 PT-BKY-INSURED-NAME              PIC X(40).
          03 PT-BKY-TAX-ID                    PIC X(11).
          03 PT-BKY-ADDRESS-LINE1             PIC X(30).
          03 PT-BKY-ADDRESS-LINE2             PIC X(30).
          03 PT-BKY-CITY                      PIC X(20).
          03 PT-BKY-STATE-CODE                PIC X(2).
          03 PT-BKY-ZIP-CODE                  PIC X(9).
          03 PT-BKY-PHONE                     PIC X(14).
          03 PT-BKY-AGENCY-CODE               PIC X(6).
          03 PT-BKY-AGENT-NAME                PIC X(30).
