******************************************************************
*  COPYBOOK  : GBKYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : KY
******************************************************************
 01  EN-BKY-ENDORSEMENT.

          03 EN-BKY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BKY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BKY-FORM-NUMBER               PIC X(10).
          03 EN-BKY-EFFECTIVE-DATE            PIC X(10).
          03 EN-BKY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
