******************************************************************
*  COPYBOOK  : GBLAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : LA
******************************************************************
 01  EN-BLA-ENDORSEMENT.

          03 EN-BLA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BLA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BLA-FORM-NUMBER               PIC X(10).
          03 EN-BLA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BLA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
