******************************************************************
*  COPYBOOK  : GBMAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MA
******************************************************************
 01  PT-BMA-PARTY.

          03 PT-BMA-INSURED-NAME              PIC X(40).
          03 PT-BMA-TAX-ID                    PIC X(11).
          03 PT-BMA-ADDRESS-LINE1             PIC X(30).
          03 PT-BMA-ADDRESS-LINE2             PIC X(30).
          03 PT-BMA-CITY                      PIC X(20).
          03 PT-BMA-STATE-CODE                PIC X(2).
          03 PT-BMA-ZIP-CODE                  PIC X(9).
          03 PT-BMA-PHONE                     PIC X(14).
          03 PT-BMA-AGENCY-CODE               PIC X(6).
          03 PT-BMA-AGENT-NAME                PIC X(30).
