******************************************************************
*  COPYBOOK  : GBMAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MA
******************************************************************
 01  EN-BMA-ENDORSEMENT.

          03 EN-BMA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMA-FORM-NUMBER               PIC X(10).
          03 EN-BMA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
