******************************************************************
*  COPYBOOK  : GBMDY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MD
******************************************************************
 01  PT-BMD-PARTY.

          03 PT-BMD-INSURED-NAME              PIC X(40).
          03 PT-BMD-TAX-ID                    PIC X(11).
          03 PT-BMD-ADDRESS-LINE1             PIC X(30).
          03 PT-BMD-ADDRESS-LINE2             PIC X(30).
          03 PT-BMD-CITY                      PIC X(20).
          03 PT-BMD-STATE-CODE                PIC X(2).
          03 PT-BMD-ZIP-CODE                  PIC X(9).
          03 PT-BMD-PHONE                     PIC X(14).
          03 PT-BMD-AGENCY-CODE               PIC X(6).
          03 PT-BMD-AGENT-NAME                PIC X(30).
