******************************************************************
*  COPYBOOK  : GBMDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MD
******************************************************************
 01  EN-BMD-ENDORSEMENT.

          03 EN-BMD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMD-FORM-NUMBER               PIC X(10).
          03 EN-BMD-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
