******************************************************************
*  COPYBOOK  : GBMEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : ME
******************************************************************
 01  EN-BME-ENDORSEMENT.

          03 EN-BME-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BME-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BME-FORM-NUMBER               PIC X(10).
          03 EN-BME-EFFECTIVE-DATE            PIC X(10).
          03 EN-BME-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
