******************************************************************
*  COPYBOOK  : GBMEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : ME
******************************************************************
 01  PT-BME-PARTY.

          03 PT-BME-INSURED-NAME              PIC X(40).
          03 PT-BME-TAX-ID                    PIC X(11).
          03 PT-BME-ADDRESS-LINE1             PIC X(30).
          03 PT-BME-ADDRESS-LINE2             PIC X(30).
          03 PT-BME-CITY                      PIC X(20).
          03 PT-BME-STATE-CODE                PIC X(2).
          03 PT-BME-ZIP-CODE                  PIC X(9).
          03 PT-BME-PHONE                     PIC X(14).
          03 PT-BME-AGENCY-CODE               PIC X(6).
          03 PT-BME-AGENT-NAME                PIC X(30).
