******************************************************************
*  COPYBOOK  : GBMIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MI
******************************************************************
 01  EN-BMI-ENDORSEMENT.

          03 EN-BMI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMI-FORM-NUMBER               PIC X(10).
          03 EN-BMI-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
