******************************************************************
*  COPYBOOK  : GBMIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MI
******************************************************************
 01  PT-BMI-PARTY.

          03 PT-BMI-INSURED-NAME              PIC X(40).
          03 PT-BMI-TAX-ID                    PIC X(11).
          03 PT-BMI-ADDRESS-LINE1             PIC X(30).
          03 PT-BMI-ADDRESS-LINE2             PIC X(30).
          03 PT-BMI-CITY                      PIC X(20).
          03 PT-BMI-STATE-CODE                PIC X(2).
          03 PT-BMI-ZIP-CODE                  PIC X(9).
          03 PT-BMI-PHONE                     PIC X(14).
          03 PT-BMI-AGENCY-CODE               PIC X(6).
          03 PT-BMI-AGENT-NAME                PIC X(30).
