******************************************************************
*  COPYBOOK  : GBMNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MN
******************************************************************
 01  EN-BMN-ENDORSEMENT.

          03 EN-BMN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMN-FORM-NUMBER               PIC X(10).
          03 EN-BMN-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
