******************************************************************
*  COPYBOOK  : GBMOE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MO
******************************************************************
 01  EN-BMO-ENDORSEMENT.

          03 EN-BMO-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMO-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMO-FORM-NUMBER               PIC X(10).
          03 EN-BMO-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMO-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
