******************************************************************
*  COPYBOOK  : GBMOY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MO
******************************************************************
 01  PT-BMO-PARTY.

          03 PT-BMO-INSURED-NAME              PIC X(40).
          03 PT-BMO-TAX-ID                    PIC X(11).
          03 PT-BMO-ADDRESS-LINE1             PIC X(30).
          03 PT-BMO-ADDRESS-LINE2             PIC X(30).
          03 PT-BMO-CITY                      PIC X(20).
          03 PT-BMO-STATE-CODE                PIC X(2).
          03 PT-BMO-ZIP-CODE                  PIC X(9).
          03 PT-BMO-PHONE                     PIC X(14).
          03 PT-BMO-AGENCY-CODE               PIC X(6).
          03 PT-BMO-AGENT-NAME                PIC X(30).
