******************************************************************
*  COPYBOOK  : GBMSY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MS
******************************************************************
 01  PT-BMS-PARTY.

          03 PT-BMS-INSURED-NAME              PIC X(40).
          03 PT-BMS-TAX-ID                    PIC X(11).
          03 PT-BMS-ADDRESS-LINE1             PIC X(30).
          03 PT-BMS-ADDRESS-LINE2             PIC X(30).
          03 PT-BMS-CITY                      PIC X(20).
          03 PT-BMS-STATE-CODE                PIC X(2).
          03 PT-BMS-ZIP-CODE                  PIC X(9).
          03 PT-BMS-PHONE                     PIC X(14).
          03 PT-BMS-AGENCY-CODE               PIC X(6).
          03 PT-BMS-AGENT-NAME                PIC X(30).
