******************************************************************
*  COPYBOOK  : GBMSE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MS
******************************************************************
 01  EN-BMS-ENDORSEMENT.

          03 EN-BMS-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMS-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMS-FORM-NUMBER               PIC X(10).
          03 EN-BMS-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMS-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
