******************************************************************
*  COPYBOOK  : GBMTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MT
******************************************************************
 01  PT-BMT-PARTY.

          03 PT-BMT-INSURED-NAME              PIC X(40).
          03 PT-BMT-TAX-ID                    PIC X(11).
          03 PT-BMT-ADDRESS-LINE1             PIC X(30).
          03 PT-BMT-ADDRESS-LINE2             PIC X(30).
          03 PT-BMT-CITY                      PIC X(20).
          03 PT-BMT-STATE-CODE                PIC X(2).
          03 PT-BMT-ZIP-CODE                  PIC X(9).
          03 PT-BMT-PHONE                     PIC X(14).
          03 PT-BMT-AGENCY-CODE               PIC X(6).
          03 PT-BMT-AGENT-NAME                PIC X(30).
