******************************************************************
*  COPYBOOK  : GBMTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : MT
******************************************************************
 01  EN-BMT-ENDORSEMENT.

          03 EN-BMT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BMT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BMT-FORM-NUMBER               PIC X(10).
          03 EN-BMT-EFFECTIVE-DATE            PIC X(10).
          03 EN-BMT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
