******************************************************************
*  COPYBOOK  : GBNCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NC
******************************************************************
 01  EN-BNC-ENDORSEMENT.

          03 EN-BNC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNC-FORM-NUMBER               PIC X(10).
          03 EN-BNC-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
