******************************************************************
*  COPYBOOK  : GBNCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NC
******************************************************************
 01  PT-BNC-PARTY.

          03 PT-BNC-INSURED-NAME              PIC X(40).
          03 PT-BNC-TAX-ID                    PIC X(11).
          03 PT-BNC-ADDRESS-LINE1             PIC X(30).
          03 PT-BNC-ADDRESS-LINE2             PIC X(30).
          03 PT-BNC-CITY                      PIC X(20).
          03 PT-BNC-STATE-CODE                PIC X(2).
          03 PT-BNC-ZIP-CODE                  PIC X(9).
          03 PT-BNC-PHONE                     PIC X(14).
          03 PT-BNC-AGENCY-CODE               PIC X(6).
          03 PT-BNC-AGENT-NAME                PIC X(30).
