******************************************************************
*  COPYBOOK  : GBNDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : ND
******************************************************************
 01  EN-BND-ENDORSEMENT.

          03 EN-BND-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BND-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BND-FORM-NUMBER               PIC X(10).
          03 EN-BND-EFFECTIVE-DATE            PIC X(10).
          03 EN-BND-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
