******************************************************************
*  COPYBOOK  : GBNEY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NE
******************************************************************
 01  PT-BNE-PARTY.

          03 PT-BNE-INSURED-NAME              PIC X(40).
          03 PT-BNE-TAX-ID                    PIC X(11).
          03 PT-BNE-ADDRESS-LINE1             PIC X(30).
          03 PT-BNE-ADDRESS-LINE2             PIC X(30).
          03 PT-BNE-CITY                      PIC X(20).
          03 PT-BNE-STATE-CODE                PIC X(2).
          03 PT-BNE-ZIP-CODE                  PIC X(9).
          03 PT-BNE-PHONE                     PIC X(14).
          03 PT-BNE-AGENCY-CODE               PIC X(6).
          03 PT-BNE-AGENT-NAME                PIC X(30).
