******************************************************************
*  COPYBOOK  : GBNEE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NE
******************************************************************
 01  EN-BNE-ENDORSEMENT.

          03 EN-BNE-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNE-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNE-FORM-NUMBER               PIC X(10).
          03 EN-BNE-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNE-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
