******************************************************************
*  COPYBOOK  : GBNHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NH
******************************************************************
 01  PT-BNH-PARTY.

          03 PT-BNH-INSURED-NAME              PIC X(40).
          03 PT-BNH-TAX-ID                    PIC X(11).
          03 PT-BNH-ADDRESS-LINE1             PIC X(30).
          03 PT-BNH-ADDRESS-LINE2             PIC X(30).
          03 PT-BNH-CITY                      PIC X(20).
          03 PT-BNH-STATE-CODE                PIC X(2).
          03 PT-BNH-ZIP-CODE                  PIC X(9).
          03 PT-BNH-PHONE                     PIC X(14).
          03 PT-BNH-AGENCY-CODE               PIC X(6).
          03 PT-BNH-AGENT-NAME                PIC X(30).
