******************************************************************
*  COPYBOOK  : GBNHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NH
******************************************************************
 01  EN-BNH-ENDORSEMENT.

          03 EN-BNH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNH-FORM-NUMBER               PIC X(10).
          03 EN-BNH-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
