******************************************************************
*  COPYBOOK  : GBNJE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NJ
******************************************************************
 01  EN-BNJ-ENDORSEMENT.

          03 EN-BNJ-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNJ-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNJ-FORM-NUMBER               PIC X(10).
          03 EN-BNJ-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNJ-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
