******************************************************************
*  COPYBOOK  : GBNJY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NJ
******************************************************************
 01  PT-BNJ-PARTY.

          03 PT-BNJ-INSURED-NAME              PIC X(40).
          03 PT-BNJ-TAX-ID                    PIC X(11).
          03 PT-BNJ-ADDRESS-LINE1             PIC X(30).
          03 PT-BNJ-ADDRESS-LINE2             PIC X(30).
          03 PT-BNJ-CITY                      PIC X(20).
          03 PT-BNJ-STATE-CODE                PIC X(2).
          03 PT-BNJ-ZIP-CODE                  PIC X(9).
          03 PT-BNJ-PHONE                     PIC X(14).
          03 PT-BNJ-AGENCY-CODE               PIC X(6).
          03 PT-BNJ-AGENT-NAME                PIC X(30).
