******************************************************************
*  COPYBOOK  : GBNMY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NM
******************************************************************
 01  PT-BNM-PARTY.

          03 PT-BNM-INSURED-NAME              PIC X(40).
          03 PT-BNM-TAX-ID                    PIC X(11).
          03 PT-BNM-ADDRESS-LINE1             PIC X(30).
          03 PT-BNM-ADDRESS-LINE2             PIC X(30).
          03 PT-BNM-CITY                      PIC X(20).
          03 PT-BNM-STATE-CODE                PIC X(2).
          03 PT-BNM-ZIP-CODE                  PIC X(9).
          03 PT-BNM-PHONE                     PIC X(14).
          03 PT-BNM-AGENCY-CODE               PIC X(6).
          03 PT-BNM-AGENT-NAME                PIC X(30).
