******************************************************************
*  COPYBOOK  : GBNME001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NM
******************************************************************
 01  EN-BNM-ENDORSEMENT.

          03 EN-BNM-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNM-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNM-FORM-NUMBER               PIC X(10).
          03 EN-BNM-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNM-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
