******************************************************************
*  COPYBOOK  : GBNVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NV
******************************************************************
 01  EN-BNV-ENDORSEMENT.

          03 EN-BNV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNV-FORM-NUMBER               PIC X(10).
          03 EN-BNV-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
