******************************************************************
*  COPYBOOK  : GBNYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NY
******************************************************************
 01  PT-BNY-PARTY.

          03 PT-BNY-INSURED-NAME              PIC X(40).
          03 PT-BNY-TAX-ID                    PIC X(11).
          03 PT-BNY-ADDRESS-LINE1             PIC X(30).
          03 PT-BNY-ADDRESS-LINE2             PIC X(30).
          03 PT-BNY-CITY                      PIC X(20).
          03 PT-BNY-STATE-CODE                PIC X(2).
          03 PT-BNY-ZIP-CODE                  PIC X(9).
          03 PT-BNY-PHONE                     PIC X(14).
          03 PT-BNY-AGENCY-CODE               PIC X(6).
          03 PT-BNY-AGENT-NAME                PIC X(30).
