******************************************************************
*  COPYBOOK  : GBNYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : NY
******************************************************************
 01  EN-BNY-ENDORSEMENT.

          03 EN-BNY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BNY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BNY-FORM-NUMBER               PIC X(10).
          03 EN-BNY-EFFECTIVE-DATE            PIC X(10).
          03 EN-BNY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
