******************************************************************
*  COPYBOOK  : GBOHE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OH
******************************************************************
 01  EN-BOH-ENDORSEMENT.

          03 EN-BOH-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BOH-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BOH-FORM-NUMBER               PIC X(10).
          03 EN-BOH-EFFECTIVE-DATE            PIC X(10).
          03 EN-BOH-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
