******************************************************************
*  COPYBOOK  : GBOHY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OH
******************************************************************
 01  PT-BOH-PARTY.

          03 PT-BOH-INSURED-NAME              PIC X(40).
          03 PT-BOH-TAX-ID                    PIC X(11).
          03 PT-BOH-ADDRESS-LINE1             PIC X(30).
          03 PT-BOH-ADDRESS-LINE2             PIC X(30).
          03 PT-BOH-CITY                      PIC X(20).
          03 PT-BOH-STATE-CODE                PIC X(2).
          03 PT-BOH-ZIP-CODE                  PIC X(9).
          03 PT-BOH-PHONE                     PIC X(14).
          03 PT-BOH-AGENCY-CODE               PIC X(6).
          03 PT-BOH-AGENT-NAME                PIC X(30).
