******************************************************************
*  COPYBOOK  : GBOKY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OK
******************************************************************
 01  PT-BOK-PARTY.

          03 PT-BOK-INSURED-NAME              PIC X(40).
          03 PT-BOK-TAX-ID                    PIC X(11).
          03 PT-BOK-ADDRESS-LINE1             PIC X(30).
          03 PT-BOK-ADDRESS-LINE2             PIC X(30).
          03 PT-BOK-CITY                      PIC X(20).
          03 PT-BOK-STATE-CODE                PIC X(2).
          03 PT-BOK-ZIP-CODE                  PIC X(9).
          03 PT-BOK-PHONE                     PIC X(14).
          03 PT-BOK-AGENCY-CODE               PIC X(6).
          03 PT-BOK-AGENT-NAME                PIC X(30).
