******************************************************************
*  COPYBOOK  : GBOKE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OK
******************************************************************
 01  EN-BOK-ENDORSEMENT.

          03 EN-BOK-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BOK-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BOK-FORM-NUMBER               PIC X(10).
          03 EN-BOK-EFFECTIVE-DATE            PIC X(10).
          03 EN-BOK-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
