******************************************************************
*  COPYBOOK  : GBORY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OR
******************************************************************
 01  PT-BOR-PARTY.

          03 PT-BOR-INSURED-NAME              PIC X(40).
          03 PT-BOR-TAX-ID                    PIC X(11).
          03 PT-BOR-ADDRESS-LINE1             PIC X(30).
          03 PT-BOR-ADDRESS-LINE2             PIC X(30).
          03 PT-BOR-CITY                      PIC X(20).
          03 PT-BOR-STATE-CODE                PIC X(2).
          03 PT-BOR-ZIP-CODE                  PIC X(9).
          03 PT-BOR-PHONE                     PIC X(14).
          03 PT-BOR-AGENCY-CODE               PIC X(6).
          03 PT-BOR-AGENT-NAME                PIC X(30).
