******************************************************************
*  COPYBOOK  : GBORE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : OR
******************************************************************
 01  EN-BOR-ENDORSEMENT.

          03 EN-BOR-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BOR-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BOR-FORM-NUMBER               PIC X(10).
          03 EN-BOR-EFFECTIVE-DATE            PIC X(10).
          03 EN-BOR-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
