******************************************************************
*  COPYBOOK  : GBPAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : PA
******************************************************************
 01  EN-BPA-ENDORSEMENT.

          03 EN-BPA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BPA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BPA-FORM-NUMBER               PIC X(10).
          03 EN-BPA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BPA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
