******************************************************************
*  COPYBOOK  : GBRIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : RI
******************************************************************
 01  EN-BRI-ENDORSEMENT.

          03 EN-BRI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BRI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BRI-FORM-NUMBER               PIC X(10).
          03 EN-BRI-EFFECTIVE-DATE            PIC X(10).
          03 EN-BRI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
