******************************************************************
*  COPYBOOK  : GBRIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : RI
******************************************************************
 01  PT-BRI-PARTY.

          03 PT-BRI-INSURED-NAME              PIC X(40).
          03 PT-BRI-TAX-ID                    PIC X(11).
          03 PT-BRI-ADDRESS-LINE1             PIC X(30).
          03 PT-BRI-ADDRESS-LINE2             PIC X(30).
          03 PT-BRI-CITY                      PIC X(20).
          03 PT-BRI-STATE-CODE                PIC X(2).
          03 PT-BRI-ZIP-CODE                  PIC X(9).
          03 PT-BRI-PHONE                     PIC X(14).
          03 PT-BRI-AGENCY-CODE               PIC X(6).
          03 PT-BRI-AGENT-NAME                PIC X(30).
