******************************************************************
*  COPYBOOK  : GBSCY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : SC
******************************************************************
 01  PT-BSC-PARTY.

          03 PT-BSC-INSURED-NAME              PIC X(40).
          03 PT-BSC-TAX-ID                    PIC X(11).
          03 PT-BSC-ADDRESS-LINE1             PIC X(30).
          03 PT-BSC-ADDRESS-LINE2             PIC X(30).
          03 PT-BSC-CITY                      PIC X(20).
          03 PT-BSC-STATE-CODE                PIC X(2).
          03 PT-BSC-ZIP-CODE                  PIC X(9).
          03 PT-BSC-PHONE                     PIC X(14).
          03 PT-BSC-AGENCY-CODE               PIC X(6).
          03 PT-BSC-AGENT-NAME                PIC X(30).
