******************************************************************
*  COPYBOOK  : GBSCE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : SC
******************************************************************
 01  EN-BSC-ENDORSEMENT.

          03 EN-BSC-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BSC-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BSC-FORM-NUMBER               PIC X(10).
          03 EN-BSC-EFFECTIVE-DATE            PIC X(10).
          03 EN-BSC-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
