******************************************************************
*  COPYBOOK  : GBSDE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : SD
******************************************************************
 01  EN-BSD-ENDORSEMENT.

          03 EN-BSD-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BSD-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BSD-FORM-NUMBER               PIC X(10).
          03 EN-BSD-EFFECTIVE-DATE            PIC X(10).
          03 EN-BSD-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
