******************************************************************
*  COPYBOOK  : GBTNE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : TN
******************************************************************
 01  EN-BTN-ENDORSEMENT.

          03 EN-BTN-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BTN-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BTN-FORM-NUMBER               PIC X(10).
          03 EN-BTN-EFFECTIVE-DATE            PIC X(10).
          03 EN-BTN-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
