******************************************************************
*  COPYBOOK  : GBTNY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : TN
******************************************************************
 01  PT-BTN-PARTY.

          03 PT-BTN-INSURED-NAME              PIC X(40).
          03 PT-BTN-TAX-ID                    PIC X(11).
          03 PT-BTN-ADDRESS-LINE1             PIC X(30).
          03 PT-BTN-ADDRESS-LINE2             PIC X(30).
          03 PT-BTN-CITY                      PIC X(20).
          03 PT-BTN-STATE-CODE                PIC X(2).
          03 PT-BTN-ZIP-CODE                  PIC X(9).
          03 PT-BTN-PHONE                     PIC X(14).
          03 PT-BTN-AGENCY-CODE               PIC X(6).
          03 PT-BTN-AGENT-NAME                PIC X(30).
