******************************************************************
*  COPYBOOK  : GBTXY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : TX
******************************************************************
 01  PT-BTX-PARTY.

          03 PT-BTX-INSURED-NAME              PIC X(40).
          03 PT-BTX-TAX-ID                    PIC X(11).
          03 PT-BTX-ADDRESS-LINE1             PIC X(30).
          03 PT-BTX-ADDRESS-LINE2             PIC X(30).
          03 PT-BTX-CITY                      PIC X(20).
          03 PT-BTX-STATE-CODE                PIC X(2).
          03 PT-BTX-ZIP-CODE                  PIC X(9).
          03 PT-BTX-PHONE                     PIC X(14).
          03 PT-BTX-AGENCY-CODE               PIC X(6).
          03 PT-BTX-AGENT-NAME                PIC X(30).
