******************************************************************
*  COPYBOOK  : GBTXE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : TX
******************************************************************
 01  EN-BTX-ENDORSEMENT.

          03 EN-BTX-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BTX-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BTX-FORM-NUMBER               PIC X(10).
          03 EN-BTX-EFFECTIVE-DATE            PIC X(10).
          03 EN-BTX-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
