******************************************************************
*  COPYBOOK  : GBUTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : UT
******************************************************************
 01  PT-BUT-PARTY.

          03 PT-BUT-INSURED-NAME              PIC X(40).
          03 PT-BUT-TAX-ID                    PIC X(11).
          03 PT-BUT-ADDRESS-LINE1             PIC X(30).
          03 PT-BUT-ADDRESS-LINE2             PIC X(30).
          03 PT-BUT-CITY                      PIC X(20).
          03 PT-BUT-STATE-CODE                PIC X(2).
          03 PT-BUT-ZIP-CODE                  PIC X(9).
          03 PT-BUT-PHONE                     PIC X(14).
          03 PT-BUT-AGENCY-CODE               PIC X(6).
          03 PT-BUT-AGENT-NAME                PIC X(30).
