******************************************************************
*  COPYBOOK  : GBUTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : UT
******************************************************************
 01  EN-BUT-ENDORSEMENT.

          03 EN-BUT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BUT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BUT-FORM-NUMBER               PIC X(10).
          03 EN-BUT-EFFECTIVE-DATE            PIC X(10).
          03 EN-BUT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
