******************************************************************
*  COPYBOOK  : GBVAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : VA
******************************************************************
 01  PT-BVA-PARTY.

          03 PT-BVA-INSURED-NAME              PIC X(40).
          03 PT-BVA-TAX-ID                    PIC X(11).
          03 PT-BVA-ADDRESS-LINE1             PIC X(30).
          03 PT-BVA-ADDRESS-LINE2             PIC X(30).
          03 PT-BVA-CITY                      PIC X(20).
          03 PT-BVA-STATE-CODE                PIC X(2).
          03 PT-BVA-ZIP-CODE                  PIC X(9).
          03 PT-BVA-PHONE                     PIC X(14).
          03 PT-BVA-AGENCY-CODE               PIC X(6).
          03 PT-BVA-AGENT-NAME                PIC X(30).
