******************************************************************
*  COPYBOOK  : GBVAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : VA
******************************************************************
 01  EN-BVA-ENDORSEMENT.

          03 EN-BVA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BVA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BVA-FORM-NUMBER               PIC X(10).
          03 EN-BVA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BVA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
