******************************************************************
*  COPYBOOK  : GBVTE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : VT
******************************************************************
 01  EN-BVT-ENDORSEMENT.

          03 EN-BVT-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BVT-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BVT-FORM-NUMBER               PIC X(10).
          03 EN-BVT-EFFECTIVE-DATE            PIC X(10).
          03 EN-BVT-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
