******************************************************************
*  COPYBOOK  : GBVTY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : VT
******************************************************************
 01  PT-BVT-PARTY.

          03 PT-BVT-INSURED-NAME              PIC X(40).
          03 PT-BVT-TAX-ID                    PIC X(11).
          03 PT-BVT-ADDRESS-LINE1             PIC X(30).
          03 PT-BVT-ADDRESS-LINE2             PIC X(30).
          03 PT-BVT-CITY                      PIC X(20).
          03 PT-BVT-STATE-CODE                PIC X(2).
          03 PT-BVT-ZIP-CODE                  PIC X(9).
          03 PT-BVT-PHONE                     PIC X(14).
          03 PT-BVT-AGENCY-CODE               PIC X(6).
          03 PT-BVT-AGENT-NAME                PIC X(30).
