******************************************************************
*  COPYBOOK  : GBWAY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WA
******************************************************************
 01  PT-BWA-PARTY.

          03 PT-BWA-INSURED-NAME              PIC X(40).
          03 PT-BWA-TAX-ID                    PIC X(11).
          03 PT-BWA-ADDRESS-LINE1             PIC X(30).
          03 PT-BWA-ADDRESS-LINE2             PIC X(30).
          03 PT-BWA-CITY                      PIC X(20).
          03 PT-BWA-STATE-CODE                PIC X(2).
          03 PT-BWA-ZIP-CODE                  PIC X(9).
          03 PT-BWA-PHONE                     PIC X(14).
          03 PT-BWA-AGENCY-CODE               PIC X(6).
          03 PT-BWA-AGENT-NAME                PIC X(30).
