******************************************************************
*  COPYBOOK  : GBWAE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WA
******************************************************************
 01  EN-BWA-ENDORSEMENT.

          03 EN-BWA-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BWA-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BWA-FORM-NUMBER               PIC X(10).
          03 EN-BWA-EFFECTIVE-DATE            PIC X(10).
          03 EN-BWA-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
