******************************************************************
*  COPYBOOK  : GBWIY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WI
******************************************************************
 01  PT-BWI-PARTY.

          03 PT-BWI-INSURED-NAME              PIC X(40).
          03 PT-BWI-TAX-ID                    PIC X(11).
          03 PT-BWI-ADDRESS-LINE1             PIC X(30).
          03 PT-BWI-ADDRESS-LINE2             PIC X(30).
          03 PT-BWI-CITY                      PIC X(20).
          03 PT-BWI-STATE-CODE                PIC X(2).
          03 PT-BWI-ZIP-CODE                  PIC X(9).
          03 PT-BWI-PHONE                     PIC X(14).
          03 PT-BWI-AGENCY-CODE               PIC X(6).
          03 PT-BWI-AGENT-NAME                PIC X(30).
