******************************************************************
*  COPYBOOK  : GBWIE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WI
******************************************************************
 01  EN-BWI-ENDORSEMENT.

          03 EN-BWI-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BWI-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BWI-FORM-NUMBER               PIC X(10).
          03 EN-BWI-EFFECTIVE-DATE            PIC X(10).
          03 EN-BWI-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
