******************************************************************
*  COPYBOOK  : GBWVE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WV
******************************************************************
 01  EN-BWV-ENDORSEMENT.

          03 EN-BWV-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BWV-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BWV-FORM-NUMBER               PIC X(10).
          03 EN-BWV-EFFECTIVE-DATE            PIC X(10).
          03 EN-BWV-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
