******************************************************************
*  COPYBOOK  : GBWVY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WV
******************************************************************
 01  PT-BWV-PARTY.

          03 PT-BWV-INSURED-NAME              PIC X(40).
          03 PT-BWV-TAX-ID                    PIC X(11).
          03 PT-BWV-ADDRESS-LINE1             PIC X(30).
          03 PT-BWV-ADDRESS-LINE2             PIC X(30).
          03 PT-BWV-CITY                      PIC X(20).
          03 PT-BWV-STATE-CODE                PIC X(2).
          03 PT-BWV-ZIP-CODE                  PIC X(9).
          03 PT-BWV-PHONE                     PIC X(14).
          03 PT-BWV-AGENCY-CODE               PIC X(6).
          03 PT-BWV-AGENT-NAME                PIC X(30).
