******************************************************************
*  COPYBOOK  : GBWYE001
*  KIND      : ENDORSEMENT
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WY
******************************************************************
 01  EN-BWY-ENDORSEMENT.

          03 EN-BWY-ENDORSEMENT-CODE          PIC X(6).
          03 EN-BWY-ENDORSEMENT-DESC          PIC X(40).
          03 EN-BWY-FORM-NUMBER               PIC X(10).
          03 EN-BWY-EFFECTIVE-DATE            PIC X(10).
          03 EN-BWY-PREMIUM-ADJUSTMENT        PIC S9(7)V9(2).
