******************************************************************
*  COPYBOOK  : GBWYY001
*  KIND      : PARTY-RECORD (named insured / agency)
*  COVERAGE  : Employee Benefits Liability (EB)
*  STATE     : WY
******************************************************************
 01  PT-BWY-PARTY.

          03 PT-BWY-INSURED-NAME              PIC X(40).
          03 PT-BWY-TAX-ID                    PIC X(11).
          03 PT-BWY-ADDRESS-LINE1             PIC X(30).
          03 PT-BWY-ADDRESS-LINE2             PIC X(30).
          03 PT-BWY-CITY                      PIC X(20).
          03 PT-BWY-STATE-CODE                PIC X(2).
          03 PT-BWY-ZIP-CODE                  PIC X(9).
          03 PT-BWY-PHONE                     PIC X(14).
          03 PT-BWY-AGENCY-CODE               PIC X(6).
          03 PT-BWY-AGENT-NAME                PIC X(30).
